[{
  "_id": {
    "$oid": "6526d46bb030211929bf67ea"
  },
  "name": "Turkey, thyme & leek meatloaf",
  "ingredients": [
    "1 tbsp sunflower oil",
    "4 large leeks, sliced",
    "500g pack turkey mince",
    "2 sprigs thyme, leaves removed",
    "85g fresh breadcrumb",
    "1 egg, beaten",
    "2 rashers lean back bacon, fat trimmed, chopped"
  ],
  "category": "dinner",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2019/04/turkish-meatloaf-bf5350b.jpg?resize=768,574",
  "method": [
    "Heat oven to 220C/fan 200C/gas 7. Heat the oil in a frying pan, then soften the leeks for 5 mins. Line the base of a 28 x 18cm baking tin with greaseproof paper.",
    "Mix the mince, thyme, two-thirds of the breadcrumbs, leeks and egg together with a little seasoning, then tip into the tin. Press the mixture firmly into the tin, then ruffle the surface with a fork. Mix the remaining breadcrumbs and bacon together and scatter over the top. Cook for 15 mins, then finish under the grill until golden and crisp on top. Serve with boiled potatoes and carrots."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67eb"
  },
  "name": "Coffee semifreddo",
  "ingredients": [
    "1 tbsp instant coffee",
    "1 tbsp Tia Mariaor brandy",
    "4 large eggs, separated",
    "100g golden caster sugar",
    "300ml pot double cream",
    "100g/4oz pack honeycomb Toblerone, finely chopped",
    "dark chocolatecurls, to decorate"
  ],
  "category": "dessert",
  "image": "https://tastecooking.com/wp-content/uploads/2017/08/semifreddo-909-1-scaled.jpg",
  "method": [
    "Oil and line a 1-litre loaf tin with cling film. Put the coffee, Tia Maria or brandy, egg yolks and sugar in a bowl and stir to dissolve the coffee. Put the egg whites in a large bowl and pour the cream in another.",
    "Beat the egg whites until stiff with an electric whisk, then quickly beat the egg yolk mixture until thick and leaving a trail. Now beat the cream until it holds its shape. If you beat everything in this order, you don’t need to wash the whisks in between.",
    "Fold the cream into the coffee mixture, then carefully fold in the whites. Fold through the Toblerone and tip into the loaf tin. Lightly cover the surface with cling film. When frozen, overwrap in foil and freeze. Will keep for up to 6 weeks. You can make the chocolate curls (see video link, above, for instructions) and keep them in a airtight container or freeze.",
    "To serve, unwrap and turn onto a platter. Strip off the cling film and serve topped with the chocolate curls."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67ec"
  },
  "name": "Spiced vegetable biryani",
  "ingredients": [
    "2 tbsp vegetable oil",
    "1 small cauliflower, broken into small florets",
    "2 large sweet potatoes, peeled and cubed",
    "1 large onion, sliced",
    "1l hot vegetable stock",
    "3 tbsp hot curry paste (Madras is good)",
    "1 red chilli, seeded and finely chopped",
    "large pinch of saffron strands",
    "2 tsp mustard seed (black or white)",
    "500g basmati rice",
    "140g trimmed green bean, halved",
    "2 lemons, juice only",
    "a handful of fresh coriander leaves",
    "50g packet salted roasted cashew nuts",
    "poppadums and raita, to serve"
  ],
  "category": "vegetarian",
  "image": "https://hildaskitchenblog.com/wp-content/uploads/2020/12/vegan-biryani-main-720x480.jpg",
  "method": [
    "Preheat the oven to 220C/gas 7/fan 200C. Pour the oil into a large roasting tin or ovenproof dish and put in the oven for a couple of minutes to heat through. Add all the vegetables to the tin, except the beans, stirring to coat them in the hot oil. Season with salt and pepper and return to the oven for 15 minutes until beginning to brown.",
    "While the vegetables are roasting, stir together the stock, curry paste, chilli, saffron and mustard seeds.",
    "Mix the rice and green beans with the vegetables in the tin, then pour over the stock mixture. Lower the oven to 190C/gas 5/fan 190C. Cover the dish tightly with foil and bake for 30 minutes until the rice is tender and the liquid has been absorbed. Stir in the lemon juice and check the seasoning, then scatter over the coriander and cashew nuts. Serve with a pile of poppadums and a bowl of raita."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67ed"
  },
  "name": "Crunchy peanut & toffee bonbons",
  "ingredients": [
    "100g smooth peanut butter",
    "50g softened butter",
    "140g icing sugar",
    "2 Dime or other toffeesbars, chopped",
    "100g milk chocolate, chopped",
    "100g salted toasted peanuts, chopped"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/crunchy-peanut-tofee-bonbons-b036ccc.jpg?resize=768,574",
  "method": [
    "Put the peanut butter, butter and sugar in a food processor. Pulse until it comes together. Add the toffee and pulse again. Remove and, using the palms of your hands, roll mixture into small balls. Place on a tray. Chill for 30 mins.",
    "Melt the chocolate in a heatproof bowl in the microwave on High for 1 min or set over a pan of boiling water (make sure the bowl doesn't touch the water). Using a fork, dip the balls, one at a time, until half covered in chocolate. Roll in the peanuts. Put on a tray lined with baking parchment and leave to harden (about 2 hrs).",
    "Store between layers of baking parchment in a covered container and keep chilled. Will keep for 1 week in an airtight container."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67ee"
  },
  "name": "Mexican pork koftas",
  "ingredients": [
    "500g minced pork",
    "50g fresh white breadcrumbs",
    "¼ - ½ tsp hot chilli powder, to taste",
    "½ tsp fine sea salt",
    "finely grated zest 1 lime",
    "4 spring onions, finely sliced",
    "1 tsp ground turmeric",
    "1 tsp ground cumin",
    "1 tsp ground coriander",
    "3 tbsp finely chopped coriander",
    "sunflower oil, for greasing",
    "2 ripe but firm avocados",
    "2 garlic cloves, crushed",
    "1 red chilli, deseeded and finely chopped",
    "juice 1 lime",
    "small pack coriander, chopped"
  ],
  "category": "lunch",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lamb-rosemary-koftas-acac640.jpg?quality=90&resize=500,454",
  "method": [
    "Put the pork, breadcrumbs, chilli powder, salt, lime zest, spring onions, turmeric, cumin and ground and chopped coriander in a food processor and season well with ground black pepper. Blitz until the mixture is evenly combined and forms a very thick paste. Form the mince into 32 small ovals and place on a baking tray lined with baking parchment. Can be covered with cling film at this stage and kept in the fridge for up to 8 hrs before baking.",
    "Heat oven to 220C/200C fan/gas 7. Bake the koftas for 10 mins or until lightly browned and cooked through. To make the guacamole, cut the avocados in half and remove the stones. Scoop the flesh into a bowl and add the garlic, chilli, lime juice and coriander. Mash well with a fork and season, then serve with the hot koftas."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67ef"
  },
  "name": "Alaskan yule log",
  "ingredients": [
    "softened butter, for greasing",
    "6 large eggs, separated",
    "140g golden caster sugar",
    "50g cocoa powder",
    "1l tub good-quality vanilla ice cream(not soft scoop)",
    "200g caster sugar",
    "4 large egg whites",
    "½ tsp vanilla extract"
  ],
  "category": "dessert",
  "image": "https://www.mashed.com/img/gallery/yule-log/l-intro-1607706759.jpg",
  "method": [
    "Put your freezer on the fast-freeze setting, or clear some space in the coldest part of the freezer. Heat oven to 180C/160C fan/gas 4. Line a 23 x 33cm Swiss roll tin with baking parchment, grease with a little butter and set aside.",
    "First, make the sponge. Put the egg yolks and sugar in a large bowl and whisk with an electric whisk until thick and creamy. Sift the cocoa powder over the egg mixture and whisk in thoroughly. Wash and dry the beaters. In a clean bowl, whisk the egg whites until stiff but not dry. Fold a third of the egg whites into the cocoa mixture, then gently fold in the rest until evenly distributed.",
    "Pour into the prepared tin and spread gently with a spatula. Bake in the centre of the oven for 25 mins or until well risen and just beginning to shrink away from the sides of the tin. Remove from the oven, loosen the edges with a round-bladed knife and leave to cool in the tin.",
    "Prepare the filling while the cake is cooling. Place a large sheet of cling film on the work surface, take the ice cream out of its tub and place on top. Working quickly, cover the ice cream with cling film, then press and roll into a long sausage shape. It will need to be 33cm long and around 5cm wide. Wrap a second piece of cling film around the first and twist the ends to maintain the sausage shape. Return to the freezer to harden for at least 1 hr.",
    "Line a baking tray with baking parchment. Take the ice cream out of the freezer, unwrap it and place in the centre of the sponge. Using the parchment to help you, bring up the sides to enclose the ice cream and carefully lift the roll onto the lined baking tray, rotating it so the seal is underneath. Trim the ends. Cover the cake and tin with cling film and place in the freezer for at least 4 hrs, or up to 1 week.",
    "Make the meringue topping 20 mins before serving. Put the sugar and 175ml water in a pan and bring to a rolling boil over a high heat. Continue to boil until it reaches 115C on a sugar thermometer.",
    "Meanwhile, put the egg whites in a large mixing bowl or tabletop mixer and whisk the egg whites to soft peaks. Continue whisking at high speed and very slowly trickle in the hot sugar syrup. The meringue will begin to thicken and become glossy after about 10 mins. Continue to whisk until it is just warm, then whisk in the vanilla extract. Use the meringue immediately, as it is easier to work with while warm.",
    "Fit a large piping bag with a 1.5cm star nozzle and fill with the meringue. Take the baking tray out of the freezer and slide the log gently onto a serving platter using a couple of spatulas. Pipe the meringue in lines down the length, then around the ends. Use a cook’s blowtorch to scorch the meringue all over. Alternatively, bake for 8 mins at 220C/200C fan/gas 7 or until the meringue is set and lightly browned. Serve in generous slices (it will sit quite happily for 5-10 mins). Please note this recipe contains lightly cooked egg whites, which may be unsuitable for babies and toddlers, the elderly, pregnant women and people who already feel unwell."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f0"
  },
  "name": "Roast turkey with lemon & garlic",
  "ingredients": [
    "5-6kg oven-ready turkey, neck and giblets removed and kept for the gravy",
    "1 onion, halved",
    "1 lemon, halved (save the zest for the butter)",
    "whole bulb of garlic, halved",
    "2 tbsp sea salt",
    "1 tbsp thyme leaves",
    "1 tsp peppercorns",
    "100g butter",
    "4 tbsp vegetable bouillon powder(we used Marigold)",
    "1 lemon, zested (from the lemon for the turkey)"
  ],
  "category": "dinner",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/crispy-skinned-roast-turkey-with-lemon-garlic-b9a72ef.jpg?quality=90&resize=440,400",
  "method": [
    "Up to two days ahead, make the salt mix by grinding the salt with the thyme leaves and pepper in a spice grinder or using a ",
    ". Sit the turkey in a roasting tin and gently push your fingers under the skin, starting from the neck, until you can push your whole hand in down the length of the breast. Take care not to tear the skin.",
    "Season the bird all over with the salt mix, inside and out and under the skin. Leave the turkey in the tin, breast-side up, and put in the fridge for up to two days – the longer you salt it, the more succulent the turkey will be. For the crispest skin, leave the turkey uncovered so it dries out, but loosely cover it if you prefer.",
    "Tip the butter, vegetable stock powder and lemon zest into a small bowl and mix until completely combined. Cover and chill. Can be made a few days ahead or frozen, wrapped in cling film, for one month.",
    "Remove the turkey from the fridge an hour or so before you want to cook it. Remove the butter from the fridge to soften. Heat oven to 180C/160C fan/gas 4. Work out your cooking time based on 40 mins per kg for the first 4kg, plus 45 mins for every kg after that.",
    "Use your hands to spread the butter under the skin so that it covers the entire breast area and work it into the crevice between the thigh and the main body, then smooth the skin over with your hands. Put the onion, lemon halves, and garlic in the cavity.",
    "Cover the tin loosely with foil and roast for the calculated cooking time. Around 30 mins before the end of cooking, increase the oven temperature to 200C/180C fan/gas 6, remove the foil, baste the turkey and return to the oven. When the turkey is beautifully brown and cooked through, remove from the oven and leave to rest on a warm platter covered with foil for up to 1 hr.  Save the juices from the tin to make gravy."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f1"
  },
  "name": "Lebkuchen",
  "ingredients": [
    "250g plain flour",
    "85g ground almond",
    "2 tsp ground ginger",
    "1 tsp ground cinnamon",
    "½ tsp bicarbonate of soda",
    "200ml clear honey",
    "1 lemon, finely grated zest",
    "85g butter",
    "pinch each ground cloves, grated nutmeg and black pepper",
    "1 tsp baking powder",
    "100g icing sugar",
    "1 egg white, beaten"
  ],
  "category": "dessert",
  "image": "https://food-images.files.bbci.co.uk/food/recipes/lebkuchen_88786_16x9.jpg",
  "method": [
    "Tip the dry ingredients into a large bowl. Heat the honey and butter in a pan over a low heat until the butter melts, then pour into the flour mixture along with the lemon zest. Mix well until the dough is combined and fairly solid. Cover and leave to cool.",
    "Heat oven to 180C/fan160C/gas 4. Using your hands, roll dough into about 30 balls, each 3cm wide, then flatten each one slightly into a disk. Divide the biscuits between two baking trays lined with baking parchment, leaving room for them to expand. Bake for 15 mins, then cool on a wire rack.",
    "To ice the biscuits, mix together the icing sugar, egg white and 1-2 tbsp water to form a smooth, runny icing. Dip the top of each biscuit in the icing and spread with the back of a knife. Leave to dry out in a warm"
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f2"
  },
  "name": "Zesty orange marzipan",
  "ingredients": [
    "175g caster sugar",
    "175g icing sugar, plus extra for dusting",
    "250g ground almond",
    "grated zest and juice 1 orange",
    "1 egg",
    "1 egg yolk",
    "shredless marmalade"
  ],
  "category": "dessert",
  "image": "https://recipes.net/wp-content/uploads/2023/07/zesty-orange-marzipan_75e3c641d6e5c6720e5b2d18326a1649.jpeg",
  "method": [
    "Sift the sugars and ground almonds together, then stir through the orange zest. Beat together the egg and egg yolk, then add to the sugar mixture, stirring well.",
    "Knead briefly to ensure the marzipan is completely mixed and pliable, adding a little orange juice if the mix is too dry, or icing sugar if too wet.",
    "Place the cake on a cake board and use small balls of marzipan to plug any holes in the cake. Now glaze the cake with a thin layer of marmalade. Dust your work surface with a little icing sugar, then roll out the marzipan in one direction, keeping the pressure even and turning a ¼ turn every few rolls.",
    "When large enough (about 40cm in diameter for a 20cm cake), roll the marzipan onto the rolling pin and lift onto the cake. Smooth the top with your palms and continue down over the sides of the cake, smoothing out any folds as you go. Trim with a knife where the marzipan meets the board, then leave to dry overnight.",
    " Although homemade marzipan contains raw eggs, the amount of sugar, and lack of moisture, prevents bacteria growing when left at room temperature, so your cake should last for 1-2 months iced. The most important thing is that you don't scrimp on drying time – once you’ve covered your cake in marzipan it should be left to completely dry out for up to 3 days, before you then cover it with icing. If you want to make marzipan before you are ready to cover your cake, then wrap it well in cling film and keep in a fridge for up to a week – as wrapped in a ball it will still contain a little moisture. As it contains raw eggs it shouldn’t be given to anyone in an at-risk group, including pregnant women, the elderly, the unwell and the very young. You can make a cooked marzipan, which carries no risks. It is a little softer, and harder to work with, but a good substitute if you are at all worried."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f3"
  },
  "name": "Cranberry sauce",
  "ingredients": [
    "250g fresh or frozen cranberries",
    "2 tbsp pomegranate molassesor balsamic vinegar",
    "juice and finely grated zest ½ orange, plus extra zest to serve",
    "2 tbsp golden caster sugar, plus extra to taste",
    "pinch of ground allspice"
  ],
  "category": "side",
  "image": "https://www.simplyrecipes.com/thmb/Z0kqQP4sTHUJcHqlGP_8eTufU7c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Cranberry-Sauce-Lead-Shot-Seo-1b-904f543819fb47deaa0f5d5345c9b74b.jpg",
  "method": [
    "Tip all the ingredients into a small saucepan and bring to a gentle simmer. Stir over a low heat for 10 mins until the cranberries have burst into a thick, glossy, sticky sauce. We like ours on the sour side to give your plate a hit of acidity, but if you prefer it sweeter add a bit more sugar. Leave the sauce to cool, then sprinkle over a little orange zest to serve. Can be kept covered in the fridge for up to a week, or frozen for 4 months."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f4"
  },
  "name": "Chocolate mint loaf cake",
  "ingredients": [
    "2 x 85g salted butter, plus extra for greasing",
    "2 x 50g dark chocolate, broken into pieces",
    "2 x 120g plain flour",
    "2 x 140 golden caster sugar",
    "6 tbsp cocoa",
    "1 tsp bicarbonate of soda",
    "2 large eggs",
    "284ml carton buttermilk",
    "300g box After Eights, broken",
    "50ml double cream",
    "turquoise food colouring",
    "300g Regal-Ice Ready to Roll icing",
    "1 tsp peppermintextract"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/mint-loaf-cake-f0bf07c.jpg?quality=90&resize=440,400",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Grease and line the base and sides of a 22cm square tin. Melt 85g butter and 50g chocolate together in a small pan. Mix 120g flour, 140g sugar, 3 tbsp of the cocoa and ½ tsp bicarbonate in a bowl.",
    "Whisk together 1 egg with half the buttermilk (about 140ml). Scrape the melted chocolate mixture and egg mixture into the dry ingredients, along with 100ml boiling water. Whizz briefly with an electric whisk until lump-free. Scrape into the tin and bake for 18-20 mins until a skewer comes out clean.",
    "Cool the cake in the tin for 15 mins, then transfer to a wire rack to finish cooling while you repeat steps 1 and 2 to make a second cake. Cool both completely.",
    "To make the icing, melt the After Eights and cream together in a saucepan. Cool, then chill until spreadable.",
    "Trim the cake edges, then halve to make 4 rectangles. Use half of the icing to sandwich the layers together, then spread the rest over the top and sides. Chill.",
    "Knead some colouring into the ready-to-roll icing with the peppermint extract. Roll out on an icing sugar dusted surface, then lift over to cover the cake, smoothing with your hands. Trim excess icing, then scatter with decorations.",
    "Chill again for 1 hr to firm up, then serve or keep in the fridge, removing 30 mins before serving."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f5"
  },
  "name": "Cranberry & cream cheese muffins",
  "ingredients": [
    "100g soft cheese",
    "250g caster sugar",
    "175g cranberries",
    "200g plain flour",
    "2 tsp baking powder",
    "2 eggs",
    "75ml flavourless oil, such as sunflower",
    "1 tsp vanilla extract"
  ],
  "category": "dessert",
  "image": "https://www.julieseatsandtreats.com/wp-content/uploads/2014/10/Cranberry-Muffins-2-of-6.jpg",
  "method": [
    "Heat oven to 190C/170C fan/gas 5. Line a 12-hole muffin tin with muffin cases. Beat the soft cheese with 25g of the sugar and chill until needed. Heat the cranberries together with another 25g of sugar until they start to pop. Mash lightly and cool.",
    "Sift the flour into a large bowl and add the remaining sugar, baking powder and a pinch of salt. Add the eggs, oil, vanilla and cranberry mixture, and stir together. Don’t worry if the mix looks a bit lumpy. Divide it between the cases, they should look about two-thirds full. Make a small dip in the centre of each and put a blob of soft cheese in. Bake for 25 mins or until risen and golden. Cool on a wire rack."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f6"
  },
  "name": "Pineapple & ginger Pavlova",
  "ingredients": [
    "4 large egg whites",
    "225g white caster sugar",
    "1 tsp ground ginger",
    "1 tsp cornflour",
    "1 tsp white wine vinegar",
    "½ large pineapple, peeled, cored and cut into 4-5 wedges",
    "3 tbsp ginger syrupfrom the jar (see below), plus extra to drizzle",
    "6 balls stem gingerin syrup, roughly chopped",
    "500ml double cream",
    "1 tbsp icing sugar, plus extra for dusting handful mint leaves, shredded"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2023/07/Pineapple-and-ginger-pavlova-df6842c.jpg?quality=90&fit=700,466",
  "method": [
    "Heat oven to 150C/130C fan/gas 2. Place the egg whites in a large very clean bowl, and whisk to stiff peaks with an electric hand whisk. Continue to whisk while you add the sugar, 1 tbsp at a time, until the mixture is thick and glossy. Continue to whisk as you add the ginger, cornflour and vinegar.",
    "Draw a 23cm circle on a piece of baking parchment, then turn it over and place on a large baking tray. Spread out the meringue mixture to fill the circle, creating a dip in the middle and higher sides. Run a palette knife up the edges at regular intervals if you want to create ridges. Bake for 1 hr, then leave in the oven with the door shut for 8 hrs until the Pavlova is completely cool.",
    "While the Pavlova bakes, heat a clean griddle pan over a medium-high heat until hot. Brush the pineapple wedges with the ginger syrup and griddle for 2 mins until char lines appear and the pineapple is slightly softened. Leave to cool completely, then cut into chunks. (The pineapple can be griddled the day before and chilled. Let it come to room temperature before you assemble the Pavlova. The Pavlova base can be made up to 2 days before serving, stored in an airtight container, then topped with cream and pineapple just before serving).",
    "When you’re ready to serve, whizz the stem ginger and 2 tbsp of the syrup in the small bowl of a food processor to a chunky paste. Add the cream and icing sugar and whip to soft peaks, then spoon into the crater of the meringue. Top with the pineapple, drizzle with a little extra ginger syrup, scatter over the mint and dust with icing sugar."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f7"
  },
  "name": "Sweet potato & butternut soup",
  "ingredients": [
    "500g sweet potatoes, peeled and diced",
    "1 butternut squash, peeled, deseeded and diced",
    "1 tbsp clear honey",
    "1 tbsp olive oil, plus a drizzle",
    "2 onions, roughly chopped",
    "3 garlic cloves, crushed",
    "1l vegetable or chicken stock",
    "1 tsp cinnamon",
    "1 tsp grated nutmeg",
    "100ml double cream",
    "1 tbsp olive oil",
    "3 garlic cloves, crushed",
    "100g butter, at room temperature",
    "zest 1 lemon",
    "2 tbsp snipped chives",
    "1 tbsp chopped thyme",
    "2 ciabattaloaves, cut into slices"
  ],
  "category": "lunch",
  "image": "https://hips.hearstapps.com/hmg-prod/images/long-butternut-squash-and-sweet-potato-soup-0090-landscape-pf-1574163704.jpg?crop=0.669xw:1.00xh;0.168xw,0&resize=1200:*",
  "method": [
    "Heat oven to 220C/200C fan/gas 7. Put the sweet potato and butternut squash on a baking tray and add the honey and a drizzle of olive oil. Roast for 40-45 mins until soft and starting to caramelise at the edges, stirring occasionally.",
    "Meanwhile, fry the onions in 1 tbsp olive oil until soft, then add the garlic, chicken stock, cinnamon and nutmeg. Bring to the boil, and simmer for 5 mins.",
    "Remove the sweet potatoes and butternut squash from the oven and add to the pan with the stock. Blend everything until smooth using a stick blender. Stir in most of the cream and bring back to a gentle simmer, and season with salt and pepper to taste.",
    "To make the lemon & garlic toasts, gently warm the olive oil and garlic in a pan over a low heat for a few mins; the garlic should be softened but not browned. Remove from the heat and mix in the butter and lemon zest until smooth. Leave to cool, then stir in the chives and thyme.",
    "Toast the ciabatta slices, and top each with a spoonful of garlic butter. Serve with the soup, drizzled with the remaining cream, and some black pepper."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f8"
  },
  "name": "Ham & cheese croquetas",
  "ingredients": [
    "25g butter",
    "½ small onion, finely chopped",
    "50g plain flour",
    "250ml milk",
    "140g sliced smoked ham, diced",
    "50g mature cheddar, coarsely grated",
    "50g gruyère, finely grated",
    "1 tsp Dijon mustard",
    "2 tbsp double cream",
    "2 large eggs",
    "50g plain flour",
    "140g fine dried breadcrumbs",
    "sunflower oil, for deep frying",
    "300g ripe tomatoes, roughly chopped",
    "1 long red chilli, finely chopped (deseeded if you don't like it too hot)",
    "1 small red onion, finely chopped",
    "4 large garlic cloves, crushed",
    "100g demerara sugar",
    "100ml red wine vinegar"
  ],
  "category": "appetizer",
  "image": "https://d3lp4xedbqa8a5.cloudfront.net/s3/digital-cougar-assets/AwwFood/2020/12/10/32148/HL0946X03-ham-cheese-croquettes_3237.jpg?width=768&height=639&mode=crop&quality=75&anchor=middlecenter",
  "method": [
    "To make the croquetas, melt the butter in a medium saucepan and gently fry the onion for 3 mins or until lightly coloured. Stir in the flour and cook for 30 secs. Gradually add the milk, stirring constantly, and cook over a low heat for 5 mins until thick and glossy. Stir in the ham, cheese, mustard and cream, and season to taste. Cook for 1 min more until the cheese melts, stirring constantly.",
    "Pour into a bowl and cover the surface with cling film to stop a skin forming. Leave to cool, then chill for 4 hrs or overnight - the mixture needs to be very stiff to form the croquetas. Take heaped teaspoons of the mixture and, with wet hands, roll into 24 small oval shapes and put on a tray. Beat the eggs in a shallow bowl, put the flour on a plate and half of the breadcrumbs in a bowl.",
    "Roll each of the croquetas lightly in flour, then in egg before coating in breadcrumbs. Place on a baking tray lined with baking parchment. Use the remaining breadcrumbs to top up the bowl halfway through the coating process. Chill for 30 mins (or to freeze, see tip, below left).",
    "Meanwhile, make the tomato chilli jam. Put all the ingredients in a large saucepan and bring to a gentle simmer. Cover loosely with a lit and cook for 50 mins - 1 hr, stirring occasionally, until thick and glossy. Leave to cool before serving.",
    "Fill a large saucepan one-third full with the sunflower oil and heat to 180C (or heat the oil in an electric deep-fat fryer). Do not overheat and do not leave hot oil unattended. Using a metal slotted spoon, lower 6 croquets into the oil and cook for 1.5 mins or until golden brown. Transfer to a baking tray lined with kitchen paper to absorb excess oil, and continue cooking the rest. Serve with the chilli jam for dipping."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67f9"
  },
  "name": "Mini chicken fajitas",
  "ingredients": [
    "2 tbsp sunflower oil",
    "2 skinless chicken breasts, cut into 1½ cm/½ in chunks",
    "1 red pepper, deseeded and cut into 1½ cm/½ in chunks",
    "1 yellow pepper, deseeded and cut into 1½ cm/½ in chunks",
    "1 tsp ground cumin",
    "1 tsp ground coriander",
    "¼ tsp hot chilli powder",
    "227g can chopped tomatoes",
    "2 tbsp chipotle paste",
    "4 spring onions, trimmed and thinly sliced",
    "large pack coriander, leaves chopped",
    "3 large flour tortillas",
    "75g ready-grated mozzarella",
    "1 ripe avocado, stoned and peeled",
    "juice 1 large lime",
    "1 garlic clove, crushed",
    "2 heaped tbsp finely chopped coriander",
    "36 cocktail sticks"
  ],
  "category": "lunch",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/mini-chicken-fajitas-9a29b14.jpg?resize=768,574",
  "method": [
    "Heat the oil in a large, non-stick frying pan or wok and stir-fry the chicken and peppers for 2 mins. Sprinkle over the spices and cook for 30 secs more, stirring. Tip the tomatoes into the pan and stir in the chipotle paste. Simmer for 5 mins or until the sauce is thick and glossy, stirring regularly. Stir in the spring onions and coriander, cook for 1 min more, then remove from the heat and leave to cool.",
    "Cut the tortillas into quarters, then cut each quarter into three pieces, so you have 36 triangles. Place 1 tsp of the chicken mixture and a little cheese at the widest end of a triangle. Roll the pointed end of the triangle around the filling and secure with a cocktail stick. Place on a baking tray lined with baking parchment. Fill and roll the other triangles. Cover with cling film and chill for up to 8 hrs until ready to reheat.",
    "To make the dip, mash all the ingredients in a bowl until almost smooth. Cover the surface of the dip with cling film and chill for up to 24 hrs.",
    "When ready to serve, heat oven to 200C/180C fan/gas 6. Uncover the fajitas and bake for 6-8 mins or until hot throughout. Serve with the guacamole."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67fa"
  },
  "name": "Caramel chocolate log",
  "ingredients": [
    "butter, for greasing",
    "4 large eggs",
    "125g golden caster sugar, plus extra for sprinkling",
    "25g cocoa powder",
    "50g oat flour(check the label to ensure it’s gluten-free)",
    "100g dulce de leche(or Carnation caramel)",
    "icing sugar, for dusting",
    "50g white chocolate(check the label to ensure it’s gluten-free), melted",
    "400ml double cream",
    "2 tbsp light brown soft sugar",
    "½ tsp ground ginger",
    "½ tsp ground cinnamon",
    "¼ tsp ground cardamom(the seeds from 3 pods, crushed)"
  ],
  "category": "dessert",
  "image": "https://www.piquefood.co.uk/cdn/shop/products/PiqueChristmas_YuleeLog.jpg?v=1669802321",
  "method": [
    "Lightly grease a 26 x 36cm baking tray with a substantial rim and line with baking parchment. Heat oven to 180C/160C fan/gas 4.",
    "To make the filling, put all the ingredients in a small saucepan and bring to the boil over a medium heat, whisking to dissolve the sugar and prevent lumps. Pour into a small container, cover with cling film and place in the fridge for a few hrs or until fully chilled.",
    "Put the eggs and caster sugar in a large bowl and use an electric whisk to whisk for 5-8 mins or until the mixture has tripled in volume and holds a ribbon on the surface when the beaters are lifted from the bowl. In a separate bowl, mix together the cocoa powder, oat flour and a pinch of salt. Working in three additions, carefully sieve the dry ingredients over the egg mixture and carefully fold in, keeping the mixture light and airy. Carefully pour the batter onto the prepared tray and gently level out to an even layer.",
    "Bake for 12-14 mins or until the cake springs back when lightly pressed. Remove from the oven and carefully slip the cake and parchment onto a wire rack to cool (unlike other roll cakes, this one isn’t pre-rolled as it is more likely to crack).",
    "Once the cake is at room temperature, confidently turn over in one motion onto a piece of parchment sprinkled lightly with caster sugar, then peel off the lining parchment.",
    "Whisk the spiced cream filling until it holds soft peaks, then spread to an even layer, leaving 2cm along the short edge clear. Spoon the dulce de leche randomly all over the filling and use a knife or a spoon to swirl together.",
    "Carefully roll the cake, using the parchment underneath to help, making sure the uncovered sponge edge is at the end of the roll. Don’t worry if the cake splits a little, this is to be expected. Dust the cake with a thin layer of icing sugar and carefully lift onto a serving plate. To finish, drizzle the cake with the white chocolate. As this cake is made with very little fat, it is best served on the day it is made, as it will dry out more quickly."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67fb"
  },
  "name": "Baked glazed ham",
  "ingredients": [
    "1 raw smoked gammonon the bone (about 5-6kg), rind left on",
    "100ml maple syrup",
    "200g apricot jam",
    "300g light brown soft sugar",
    "12 whole cloves"
  ],
  "category": "dinner",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/spiced_ham-2f98278.jpg?quality=90&resize=500,454",
  "method": [
    "Heat oven to 180C/160C fan/ gas 4. Put the ham on a wire rack or trivet set over a large roasting tin, pour in 480ml warm water and cover tightly with foil. Put the ham in the oven, immediately reduce the heat to 160C/140C fan/gas 3 and cook for 5 hrs.",
    "Meanwhile, put the maple syrup, apricot jam and brown sugar in a heavy-based pan and stir in 50ml water. Bring to the boil, then remove from the heat and leave to cool.",
    "Take the ham out of the oven. Increase the temperature to 200C/180C fan/gas 6. Open the foil, being careful of the hot steam. Remove the rind from the ham by inserting a sharp knife under it at the opposite end to the knuckle bone, gently lifting it away from the fat (try to keep as much fat on the leg as possible so that it will protect the ham and stop it drying out).",
    "Decorate the ham by scoring the fat with a knife to make large diamond shapes, taking the knife from one corner to the other, then making parallel scores 4cm apart. Repeat in the opposite direction. Put a clove in the corner of each diamond. Brush the ham with the sugar mixture, pushing it into the scores with the brush.",
    "Return the ham to the oven, placing it back on the trivet over the water. Bake for a further 45 mins until deeply coloured. Serve hot or cold. Will keep in the fridge for up to one week."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67fc"
  },
  "name": "Crumpets & burnt honey butter",
  "ingredients": [
    "250ml milk",
    "200g plain flour",
    "1 tsp fast-action dried yeast",
    "1 tsp golden caster sugar",
    "2 tbsp vegetable oil, plus extra for greasing",
    "5 tbsp clear honey",
    "140g unsalted butter, at room temperature"
  ],
  "category": "breakfast",
  "image": "https://cdn1.wolfermans.com/wcsstore/Wolfermans/images/catalog/19_50666_61w_01ex.jpg",
  "method": [
    "Gently heat the milk in a small pan until it starts to bubble around the edges, then leave it to cool until it is tepid. Put the flour, yeast, sugar and ½ tsp fine salt in a large bowl, and gradually mix in the cooled milk to make a smooth, loose batter. Cover and leave to rise in a warm place for 1hr-1hr 30 mins or until doubled in size and very bubbly.",
    "Meanwhile, make the honey butter. Heat the honey in a small saucepan over a medium-high heat. Let it bubble until it turns to a deep gold, then remove and cool slightly. Using electric beaters or a wooden spoon, beat the butter in a large bowl until fluffy and pale, add a large pinch of sea salt, then fold in the warm honey. Scrape into a serving bowl and chill. Can be made a day ahead.",
    "When the batter has risen, heat the grill to high. Lightly grease the insides of 4 x 9cm metal cooks’ rings with oil. Heat a large non-stick frying pan over a low-medium heat, add 1 tbsp oil and put the rings in the pan. Spoon the batter into the rings until they are half full. Let the crumpets cook slowly for about 10 mins or until the mixture has set and the bubbles on top have all popped. Lift the rings away carefully. If your pan has a heatproof handle, grill the crumpets in the pan for 7-10 mins or until the tops are golden brown. If not, transfer to a baking sheet and grill them on that instead. Can be made up to a day ahead or frozen. Warm through in an oven at 140C/120C fan/gas 1 if you’ve made them in advance. Repeat with the remaining mix, then serve with the burnt honey butter."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67fd"
  },
  "name": "Saté wings with peanut sauce",
  "ingredients": [
    "1.6kg whole chicken wings",
    "sweet chilli sauce",
    "1 cucumber, deseeded and cut into sticks, to serve",
    "1 tbsp vegetable oil",
    "1 tbsp light soy sauce",
    "2 heaped tsp turmeric",
    "2 heaped tsp ground cumin",
    "4 garlic cloves, crushed",
    "2 tbsp coconut cream",
    "3 tbsp golden caster sugar",
    "1 tbsp sunflower oil",
    "3 garlic cloves, crushed",
    "knob of ginger, finely grated",
    "1 lemongrassstalk, bruised",
    "1 Thai chilli, pricked all over with the tip of a knife (see tip, top left)",
    "1 tsp ground cumin",
    "4 tbsp crunchy peanut butter",
    "1 tbsp golden caster sugar",
    "2 tbsp coconut cream",
    "100ml chicken stock(see 'Tip')"
  ],
  "category": "appetizer",
  "image": "https://www.kitchensanctuary.com/wp-content/uploads/2015/08/Chicken-Satay-wide-FS1-7311.webp",
  "method": [
    "Using a sharp knife or kitchen shears, snip the wing tips from the wings at the first knuckle. Discard the tips or use to make stock (see above left). Cut the remaining wing through the joint. Put the wings in a large non-metallic bowl or a food bag. Mix together the marinade ingredients and pour over the wings, toss well to coat, then chill for at least 4 hrs or overnight.",
    "For the sauce, heat the oil in a pan, then add the garlic, ginger, lemongrass and chilli, and fry for 30 secs until aromatic. Stir in the cumin, toast for a few secs, then stir in the remaining ingredients. Simmer just long enough to make a slightly thickened sauce. Spoon into a bowl, cover and leave to cool. Can be made up to 3 days ahead and chilled.",
    "Heat oven to 200C/180C fan/gas 6. Spread the wings over a large baking tray, sprinkle with a little salt and roast for 40-45 mins, turning halfway, until crisped and golden. If a large amount of juice has collected in the tray at the halfway point, pour it away before continuing to roast. Just before serving, warm the peanut sauce gently and remove the lemongrass and chilli. Serve with the wings, sweet chilli sauce and cucumber sticks."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67fe"
  },
  "name": "Panettone",
  "ingredients": [
    "4 tbsp warm milk",
    "2 x 7g sachets fast-action dried yeast",
    "100g caster sugar",
    "250g butter, softened",
    "5 medium eggs, lightly beaten",
    "2 tsp vanilla extract",
    "grated zest of 1 lemon",
    "grated zest of 1 orange",
    "500g strong white bread flour, plus extra for dusting",
    "80g raisins",
    "80g sultanas",
    "3 tbsp dark rum",
    "100g good-quality candied lemon and orange peel, finely chopped",
    "30g whole blanched almonds, roughly chopped",
    "1 tbsp caster sugar",
    "1 tbsp egg white",
    "1 tbsp icing sugar"
  ],
  "category": "dessert",
  "image": "https://leitesculinaria.com/wp-content/uploads/2022/12/panettone-fp.jpg",
  "method": [
    "Grease a panettone tin (see Tip) or a 20cm deep cake tin, or use a panettone case.",
    "Place the warm milk in a bowl and add the yeast and 1 tsp of sugar and leave for a few minutes.",
    "Put the remaining sugar in a large bowl and beat together with the butter and vanilla extract until really light, creamy and pale.",
    "Stir in the lemon and orange zest. Add the eggs a little at a time until all are well incorporated. Spoon in a tablespoon of the flour if the mixture starts to curdle and beat this in with the eggs.",
    "Place the flour in a large bowl and mix with a good pinch of salt and make a well in the centre. Add the yeast mixture then the butter and egg mixture, folding in with a large spoon to make a soft dough. Knead for 5 mins in the bowl until it all starts to come together. It will be a pretty sticky dough at this stage.",
    "Turn out the dough onto a floured surface and knead for a further 10 mins, until everything has come together and you have a very soft and stretchy dough. Add a light sprinkling of flour to the surface and your hands as you go to stop the mixture sticking, but try not to add too much. Place in a lightly greased bowl and cover with cling film. Leave in a warm place for 2 hrs until doubled in size.",
    "Place the raisins and sultanas in a small saucepan with the rum and heat gently for 5 – 7 mins until the fruit has absorbed the liquid and is plump and juicy. Set aside to cool.",
    "When the dough is risen, tip it out onto a lightly floured surface and knead for another 5 mins. Gradually knead in the soaked raisins, sultanas and chopped candied peel. Shape the dough into a ball and pop into the prepared tin. If using a 20cm cake tin, wrap a layer of baking parchment around the outside of the tin, to come up about 5cm above the rim, and secure the paper with string. This will help contain the dough as it rises. Cover lightly with cling film and leave to rise for another hour until it has risen to the top of the tin or paper.",
    "Preheat the oven to 180C/fan 160C/gas 4. Adjust the oven shelf to the right height. Mix together the almonds, caster sugar and egg white for the topping and gently brush over the top of the panettone. Place in the oven and bake for 40 - 50 mins until golden and risen and a skewer comes out clean when inserted into the middle of the cake. Leave to cool in the tin for 10 mins before turning out onto a wire rack. Leave to cool completely before dusting lightly with icing sugar and cutting into wedges to serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf67ff"
  },
  "name": "Panforte",
  "ingredients": [
    "flavourless oil, for greasing",
    "edible rice paper(optional)",
    "300g nuts, toasted and chopped (we used pistachios and hazelnuts)",
    "50g candied peel, finely chopped",
    "250g dried fruit, chopped (we used dates and apricots)",
    "50g plain flour",
    "2 tsp spices(we used 1 tsp cinnamon, ¾ tsp ginger and ¼ tsp cardamom)",
    "125g honey",
    "150g golden caster sugar",
    "3 tbsp fortified wineor liqueur (we used Marsala)",
    "icing sugar, to dust"
  ],
  "category": "dessert",
  "image": "https://food-images.files.bbci.co.uk/food/recipes/panforte_54621_16x9.jpg",
  "method": [
    "Heat oven to 150C/130C fan/gas 2. Grease and line the base of a 20cm springform cake tin with edible rice paper or baking parchment. Tip the nuts, candied peel and dried fruit into a bowl. Sift over the flour and spices, and mix together.",
    "Heat the honey, sugar and wine in a medium saucepan over a medium heat. Bubble for 3-4 mins until the sugar has melted. Pour the hot liquid over the fruit and nuts, then mix. Scrape the mixture into the tin and use the back of a wet metal spoon to flatten it. Bake for 35-40 mins until the surface is still soft but not sticky – it will firm up as it cools.",
    "Leave to cool in the tin for 10 mins, then remove using a palette knife to release any sticky edges. If using baking parchment, peel it off and discard it; the edible rice paper can be left on. Cool completely on a wire rack, then dust generously with icing sugar, rubbing the sugar gently into the surface. Cut into wedges to serve. Will keep wrapped in baking parchment in an airtight tin for one month."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6800"
  },
  "name": "Naan, spinach & halloumi bites",
  "ingredients": [
    "2 tbsp butter",
    "2 crushed garlic cloves",
    "2 tsp garam masala",
    "2 x 80g bags washed baby spinach",
    "2 x 250g packs halloumi cheese",
    "4 naan bread"
  ],
  "category": "appetizer",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/naan-spinach-halloumi-bites-19c99c6.jpg?resize=768,574",
  "method": [
    "Warm the butter in a large pan with the crushed garlic cloves and garam masala. Roughly chop the washed baby spinach and add to the melted butter and spices. Cook until the spinach has wilted, then season to taste.",
    "Cut the halloumi into cubes and grill the tops until golden. Heat the naan breads under the grill – just to warm through – then spread with the spinach mixture.",
    "Evenly distribute the grilled halloumi over the bread, then cut the bread to fit the cheese, and secure with cocktail sticks. Serve warm."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6801"
  },
  "name": "Fruitcake & apricot butter icing",
  "ingredients": [
    "200g butter, softened",
    "100g whole almond",
    "200g plain flour",
    "200g icing sugar",
    "4 medium eggs",
    "700g mixed dried fruit",
    "25ml brandy",
    "150g butter, softened",
    "150g apricot jam",
    "275g icing sugar, sifted"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-849538_10-8c4e963.jpg?quality=90&resize=440,400",
  "method": [
    "Heat oven to 160C/140C fan/gas 3. Grease a deep 20cm round cake tin with a little bit of the butter, then line with greaseproof paper or baking parchment. Wrap a couple of sheets of newspaper around the outside of the tin, then secure with string.",
    "In a food processor, whizz the almonds with the flour until the mix resembles crumbs. Beat the butter and icing sugar until light and fluffy. Beat in the eggs, one by one, then fold in the flour and almonds, dried fruit and brandy. Scrape into the tin, level the surface and bake for 1 hr 15 mins, until a skewer poked in comes out clean. Cool in the tin.",
    "When the cake is completely cold, make the icing quickly by beating the butter, jam and icing sugar until pale. Don’t allow the butter to get too warm or overbeat as the icing might split. Swirl all over the cake, then leave in a cool place to set (but not the fridge)."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6803"
  },
  "name": "Mini croque monsieurs",
  "ingredients": [
    "150g grated gruyère",
    "200ml tub crème fraîche",
    "1 tsp Dijon mustard",
    "salt and black pepper",
    "a pinch of nutmeg",
    "10 thick slices of white bread(crusts removed)",
    "cooked sliced ham",
    "butter, softened"
  ],
  "category": "appetizer",
  "image": "https://static.thiriet.com/data/common_public/gallery_images/site/18756/18774/106364,20_mini_croque-monsieur.jpg",
  "method": [
    "Heat oven to 190C/170C fan/gas 5. Mix together 100g of the grated Gruyère, crème fraîche and Dijon mustard. Season with salt, black pepper and a pinch of nutmeg and spread half the mixture over 5 slices of white bread. Top with a layer of cooked sliced ham and another slice of bread.",
    "Spread softened butter over one side of the sandwich and place on a baking sheet, butter-side down. Top the unbuttered side with the rest of the cheese mixture the remaining 50g grated Gruyère. Can be assembled the day before and chilled. To serve, bake in the oven for 20 mins or until golden, then slice the sandwiches into bite-sized pieces and serve straight away."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6804"
  },
  "name": "White chocolate & ricotta cheesecake",
  "ingredients": [
    "50g butter, melted",
    "150g digestive biscuit",
    "50g amaretti biscuit",
    "sunflower oil, for greasing",
    "200g white chocolate, chopped",
    "5 leaves gelatine",
    "6 tbsp milk",
    "500g tub ricotta",
    "300ml pot double cream",
    "50g icing sugar",
    "2 large eggs, separated",
    "white chocolatecurls",
    "pomegranateseeds",
    "icing sugar, for dusting (optional)"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-444629_12-49bf557.jpg?quality=90&resize=440,400",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. Melt the butter in a pan or microwave. Very finely crush the biscuits together, stir with the butter, then press very firmly into the base of a 20cm round loosebottomed cake tin. Bake for 6 mins. Cool, then wipe around the inside of the tin with a little oil on kitchen paper.",
    "Soak the gelatine in water while you make the filling. Tip the chocolate into a bowl over a pan of simmering water, then add the milk. Gently heat until melted, then stir together. Squeeze the gelatine dry, add to the chocolate mixture and stir to dissolve.",
    "Beat the ricotta, cream, sugar and egg yolks together. In a separate bowl, whisk the egg whites.",
    "Stir the chocolate and ricotta mixtures together, then gently fold in the egg whites. Carefully pour onto the cooled biscuit base. Cover the tin with cling film, then chill until firm, preferably overnight.",
    "To decorate, very generously top the cheesecake with the white chocolate curls, then remove from the tin, scatter with the pomegranate seeds and dust all over with icing sugar, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6805"
  },
  "name": "Coconut cupcakes",
  "ingredients": [
    "400g can full-fat coconut milk(must not contain stabilisers)",
    "140g icing sugar",
    "1 tsp vanilla bean paste",
    "50g desiccated coconut",
    "100g coconut oil",
    "225g golden caster sugar",
    "3 large eggs",
    "200g gluten-free self-raising flour(the mix should include xanthan gum – I used Doves Farm)",
    "100ml coconut milk",
    "1 tsp vanilla extract"
  ],
  "category": "dessert",
  "image": "https://preppykitchen.com/wp-content/uploads/2022/04/Coconut-Cupcakes-Recipe-Card.jpg",
  "method": [
    "Chill the can of coconut milk overnight. The next day, make the cakes. Heat oven to 180C/160C fan/gas 4 and line a 12-hole muffin tin with muffin cases. Put the coconut oil and sugar in a large bowl and use an electric whisk to beat together for about 5 mins until light and creamy. Add the eggs, one at a time, beating until fully combined before adding more. Working in three additions, add the flour, alternating with the coconut milk, then add the vanilla extract.",
    "Scoop the batter into the prepared muffin tin using an ice cream scoop, then bake for 20-22 mins or until the cakes are golden and a skewer inserted into the middle comes out clean. Remove the cupcakes from the tin and cool on a wire rack.",
    "The whipped cream is best made within a few hours of serving. Open the can of coconut milk upside down and pour off the thin liquid. Scoop the thick coconut milk into a large bowl, add the icing sugar and the vanilla, and whisk for 2-3 mins until soft and fluffy. Spread or scoop the whipped cream onto the cupcakes and sprinkle with the desiccated coconut. Best stored in the fridge and eaten within a couple of days."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6806"
  },
  "name": "Brioche French toast",
  "ingredients": [
    "4 eggs",
    "200ml single cream",
    "½ tsp vanilla seed paste",
    "1 tbsp golden caster sugar",
    "4 thick, generous slices or 8 thin slices of day-old brioche",
    "25g butter, for frying",
    "1 tbsp vegetable oil, for frying",
    "12 rashers bacon",
    "2 bananas, sliced",
    "maple syrup, to serve"
  ],
  "category": "breakfast",
  "image": "https://www.kingarthurbaking.com/sites/default/files/styles/featured_image/public/recipe_legacy/3136-3-large.jpg?itok=o2R8x9R2",
  "method": [
    "In a large bowl, whisk the eggs vigorously, then add the single cream, vanilla and sugar, and whisk again.",
    "When you’re ready to cook, heat the oven to its lowest setting, pop a baking tray inside and pour the cream mixture into a shallow dish or tub that will allow space for the brioche to lay flat. Heat a griddle or a frying pan to a medium heat, and melt the butter and the oil together.",
    "Place the brioche slices in the cream mixture for 1 min, then turn each slice and gently press all over, allowing them to soak up the liquid for another 1 min or so until fully soaked.",
    "Remove the brioche from the mixture and place onto the hot griddle or pan (you may need to do this in batches). Cook for a few mins on either side until the inside is tender and moist (but not wet). To check this, make a small cut in the middle with a knife – the inside should be like cooked bread pudding. Keep warm in the oven while you cook the remaining slices.",
    "In the meantime, fry the bacon in a pan for 5 mins until crispy. Serve the French toast topped with bacon, bananas and a drizzle of maple syrup."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6807"
  },
  "name": "Cherry & coconut Florentines",
  "ingredients": [
    "140g light muscovado sugar",
    "100g clear honey",
    "200g salted butter",
    "100g desiccated coconut",
    "140g flaked almonds",
    "300g glacé cherry, sliced",
    "4 tbsp plain flour",
    "250g dark, milk or white chocolate, or a mix"
  ],
  "category": "dessert",
  "image": "https://goldfm.lk/life/recipes/1490159994_661404162179679_goldstyles.jpg",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. Put the sugar, honey and butter in a large pan and gently melt together. When all the sugar has dissolved stir in the coconut, flaked almonds, sliced cherries and flour.",
    "Line a large baking tray with greaseproof paper (about 40 x 30cm), and roughly spread the Florentine mixture out to a thin layer – don’t worry if you have small gaps, it should melt together in the oven. Bake for 10-12 mins until a rich golden colour, then set aside to cool and firm up.",
    "Melt the chocolate(s) all in separate heatproof bowls over gently simmering water. Line a second large tray or board with greaseproof paper and carefully flip the cooled Florentine bake onto it. Peel off the greaseproof paper. Spread the melted chocolate over, if you’re using a few types just leave a gap between each.",
    "Leave aside until set, then stamp out shapes using cookie star cutters - if the cutter is digging into your hands (as the Florentine mix may be a little hard), rest a small plate or pan on top of it and push down on this instead."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6808"
  },
  "name": "Mushroom & olive tatins",
  "ingredients": [
    "2 x 250g packs Portabellini mushroom, stalks removed",
    "2 tbsp olive oil",
    "1 tbsp thyme",
    "1 sheet puff pastry, from a 425g pack",
    "2 tbsp pine nut",
    "6 kalamata or green olives, chopped",
    "2 heaped tbsp vegetarian tapenade",
    "2 tsp extra-virgin olive oil",
    "1 tsp balsamic vinegar",
    "few toasted pine nut and chopped olives",
    "handful rocket leaves"
  ],
  "category": "vegetarian",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-18027_11-33038e7.jpg?resize=768,574",
  "method": [
    "Heat oven to 240C/fan 220C/gas 9. Spread the mushrooms, stalk side up, on 2 baking trays. Drizzle with oil, sprinkle with thyme, then season well. Roast for 12 mins until juicy.",
    "Take two 15cm sandwich cake tins. Unravel the pastry, then using the tin as a guide, cut two circles. It’s best to put the tins on the pastry before cutting to get the best possible fit – you may need to patch one of the rounds slightly with some pastry trimmings.",
    "Arrange the mushrooms, overlapping (one up, one down) in the tins and scatter with pine nuts and olives. Spread tapenade over one side of the pastry, then place, tapenade side-down, on top of the mushrooms.",
    "Bake for 15 mins, then tip onto plates. To serve, combine the oil, vinegar, pine nuts, olives and rocket and pile on top of the tarts."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6809"
  },
  "name": "Moreish mocha profiterole",
  "ingredients": [
    "100g plain flour",
    "85g unsalted butter",
    "3 eggs, beaten",
    "4 tbsp Bird's custard powder",
    "6 tbsp golden caster sugar",
    "600ml milk",
    "2 tbsp coffee essence (dissolve 2 tbsp instant coffee granules in 2 tbsp hot water - we used Nescafé Partners’ Blend)",
    "284ml double cream",
    "100g icing sugar",
    "100g dark chocolate, in pieces",
    "50g butter",
    "50ml coffee",
    "1-2 tbsp coffee liqueur such as Kahlúa"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/mocha-profiteroles-0372a30.jpg?quality=90&fit=700,350",
  "method": [
    "Sift the flour into a bowl and stir in a pinch of salt. Put butter and 200ml cold water into a pan, bring to a rolling boil, then take off the heat. Tip in the flour and salt and stir to form a smooth paste. Now beat the mixture until it starts to come away from the sides of the pan, then tip onto a plate and leave to cool.",
    "Heat oven to 200C/fan 180C/gas 6. Return paste to the pan, then gradually beat in the eggs, mixing well. Spoon walnut-sized balls onto a baking sheet, then bake for 20-25 mins until golden. Remove from oven, poke the underneath with a teaspoon, turn upside-down, then bake for 5 mins to dry out. Cool on a wire rack before filling.",
    "For the filling, mix the custard powder and sugar with a splash of milk until you have a smooth paste. Heat the remaining milk, then stir into the paste. Pour the mixture into a pan and bring to the boil, stirring. Cook for 5 mins until you have a thick custard. Stir in coffee, then leave to cool. Softly whip the cream, sift in the icing sugar and mix, then fold into the custard. Pipe the cream into each choux bun.",
    "For the sauce, melt chocolate and butter with the coffee in a bowl in the microwave on Medium for 1-2 mins. Pour in the liqueur, mix well, then pour over the filled buns."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf680a"
  },
  "name": "Spinach & artichoke filo pie",
  "ingredients": [
    "2 small leeks, very thinly sliced",
    "50g butter, plus a knob",
    "400g frozen leaf spinach, thawed and well drained and chopped",
    "250g tub ricotta cheese",
    "4 large eggs, beaten",
    "140g grated parmesan cheese",
    "1⁄2 nutmeg, grated",
    "400g can artichoke heart, drained and halved",
    "85g SunBlush tomato",
    "270g pack filo pastry",
    "2 tbsp olive oil"
  ],
  "category": "vegetarian",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-5329_11-443b82d.jpg?quality=90&resize=440,400",
  "method": [
    "Soften the leeks in the butter for a couple of mins. Add the spinach to the pan, cover and cook for 5-6 mins more until the spinach has just thawed.",
    "In a separate bowl, beat the ricotta and eggs with the parmesan, spinach mix, nutmeg and plenty of seasoning. Stir in the artichokes and tomatoes.",
    "Heat oven to 180C/fan 160C/gas 4. Line the base and sides of a greased 23cm clip-sided or loose-based tin with the filo pastry. Brushing each sheet lightly with the oil, place in the tin, oil-side down, leaving excess to hang over the edge. Turn the tin a quarter turn after each sheet.",
    "Tip filling into the tin, fold excess pastry onto the top of the pie, a sheet at a time, crumpling to give a ruffled effect. Bake for 11⁄2hrs until golden and firm."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf680b"
  },
  "name": "Poule au pot & garlic cream",
  "ingredients": [
    "1½ kg chicken",
    "300ml white wine",
    "1 onion, peeled but left whole",
    "3 cloves",
    "1 bouquet garni(tied bundle of herbs)",
    "2 garlic cloves",
    "12 small potatoes",
    "4 carrots, cut into 5cm lengths",
    "2 turnips, cut into wedges",
    "3 leeks, cut into 5cm lengths",
    "roughly chopped parsley, to serve",
    "200g lean minced pork",
    "100g streaky bacon, cut into dice",
    "100g chicken livers, finely chopped",
    "2 tbsp olive oil",
    "2 shallots, diced",
    "2 garlic cloves, crushed",
    "1 egg, beaten",
    "handful parsleyleaves, chopped",
    "100g fresh white breadcrumbs",
    "3 garlic cloves, left whole",
    "200ml tub crème fraîche"
  ],
  "category": "dinner",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-486463_11-64cb820.jpg?quality=90&resize=440,400",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Put the chicken in a flameproof casserole dish and pour over 600ml water and the wine. Stud the onion with the cloves. Add to the pan with the bouquet garni, garlic and seasoning, then bring to the boil. Cover and put in the oven for 1½ hrs.",
    "To make the garlic cream, simmer the unpeeled garlic cloves in a small pan of water for 30 mins until soft. When cool enough to handle, squeeze out into a bowl and mash with salt and pepper. Stir in the crème fraîche and tip into a bowl, then keep in the fridge until needed.",
    "For the stuffing, mix the meats in a bowl. Heat the oil in a small pan and gently fry the shallots and garlic until softened but not browned. Add to the bowl with the egg, parsley, breadcrumbs, seasoning, then mix well. Shape into 18 balls and put in a shallow baking tray.",
    "Remove chicken after 1½ hrs and put it on the hob on medium heat. Place the stuffing in the oven for 25-30 mins until browned and crisp. Add the vegetables to the chicken pot. Cook for 25-30 mins, then lift out the chicken to a plate and keep the veg warm in the stock.",
    "Remove chicken’s skin, and break the flesh into chunks. Put on a warm platter with the stuffing and the veg. Add a ladle of cooking stock and the parsley. Serve the rest of the cooking juices in a jug."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf680c"
  },
  "name": "Hash browns with mustard & salmon",
  "ingredients": [
    "1 large potato(about350g/12oz), washed",
    "1 tbsp plain flour",
    "1 tbsp wholegrain mustardor horseradish sauce",
    "knob of butter",
    "1 tbsp sunflower oil",
    "4 slices smoked salmon",
    "soured cream or crème fraîche, to serve",
    "chives, to serve"
  ],
  "category": "breakfast",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-18398_12-1f1d90f.jpg?quality=90&resize=440,400",
  "method": [
    "Grate the unpeeled potato onto a clean tea towel. Bring up the edges of the towel, then squeeze over the sink to remove any excess water in the potatoes. Tip into a bowl and add the flour and mustard or horseradish. Season well and mix together.",
    "Divide the mixture into 8 balls and flatten between your hands. Heat a large frying pan with the butter and oil, then add the potatoes to the pan. Cook for 2-3 mins on each side, over a medium heat, until golden.",
    "Stack a couple of hash browns on each serving plate and top with a slice of smoked salmon, a dollop of soured cream or crème fraîche and some chives to serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf680d"
  },
  "name": "Lemon meringue ice cream",
  "ingredients": [
    "500g carton fresh custard",
    "142ml carton single cream",
    "142ml carton double cream",
    "zest and juice of 3 juicy lemons, unwaxed if possible",
    "6 good quality meringues, crushed (we used Sainsbury's Meringue Nests)",
    "8 good quality ice cream cones"
  ],
  "category": "dessert",
  "image": "https://www.yourhomebasedmom.com/wp-content/uploads/2021/09/lemon-meringue-pie-ice-cream-0003-scaled.jpg",
  "method": [
    "In a large bowl, mix the custard and the single cream.",
    "Whip the double cream until it forms soft peaks, then stir in the lemon zest and juice. Fold this into the custard mixture.",
    "Pour into an ice cream machine and churn according to the manufacturer’s instructions. Gently fold in the meringue, then spoon into a freezer container and freeze. Remove from the freezer at least half an hour before serving. To serve, scoop into the ice cream cones and eat immediately."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf680e"
  },
  "name": "Salted almond brittle",
  "ingredients": [
    "100g bag toasted flaked almond",
    "100g golden caster sugar",
    "50g butter, plus extra for greasing",
    "½ tsp salt"
  ],
  "category": "dessert",
  "image": "https://static01.nyt.com/images/2022/04/06/dining/01Matzorex/merlin_204710154_4b153eca-2f89-4389-9104-3707cb99cdc0-articleLarge.jpg?w=1280&q=75",
  "method": [
    "Lightly butter a lipped baking tray and spread the almonds over it in a thin, even layer. Put the sugar, butter, salt and 4 tbsp water into a smooth-bottomed frying pan and heat gently, stirring, until the sugar dissolves. Increase the heat and boil for about 5 mins, or until it starts to turn light golden brown. Stir every now and again as some patches will start to caramelise faster than others. Carefully tip the caramel over the nuts and leave to cool completely.",
    "Once cold, shatter the caramel. An easy way to get clean sharp pieces is to put the point of a sharp knife vertically onto the caramel and bash the handle with a rolling pin, like a hammer and chisel. Serve on top of the Chocolate amaretti puddings. Keep for up to 2 days in an airtight container, interleaved with non-stick paper, in a cool, dry place (not the fridge)."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf680f"
  },
  "name": "Tomato & pepper dip",
  "ingredients": [
    "375g jar of Peppadew sweet piquante peppers",
    "3 tomatoes, roughly chopped",
    "1 tbsp sundried tomato paste",
    "a bunch of chives, snipped"
  ],
  "category": "side",
  "image": "https://www.chilipeppermadness.com/wp-content/uploads/2018/03/Roasted-Red-Pepper-Dip3.jpg",
  "method": [
    "Drain and rinse a the jar of Peppadew sweet piquante peppers and tip them into a food processor or blender. Add the tomatoes, roughly chopped, sundried tomato paste and most of the bunch of chives, snipped.",
    "Whizz together until blended, but still chunky. Season with pepper and spoon half into a serving dish, sprinkle over the remaining chives and serve with lots of crisp, fresh, raw veg sticks. You can also grill a few soft flour tortillas until crisp, then snap them into pieces. Pop them under a hot grill – they take about a minute each, turning once. The other half of the dip will keep refrigerated for three days."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6810"
  },
  "name": "Classic vinaigrette",
  "ingredients": [
    "2 tsp Dijon mustard",
    "2 tbsp red wine vinegar",
    "6 tbsp light olive oil"
  ],
  "category": "side",
  "image": "https://d1vnxpj2ayvwak.cloudfront.net/primary/25/uq/x8/25uqx84wnfx5eg0q0j0bq419dhlbggqj.jpg",
  "method": [
    "Put the mustard, vinegar and olive oil in a jar and season. Shake vigorously to mix. Store in a cool place (not the fridge) until ready to use. Use for all your salads or try one of our recipes, right. Vinaigrette will keep for a week."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6811"
  },
  "name": "Crispy Roast Duck",
  "ingredients": [
    "3 medium-sized duckss (each about 2¼kg/5lb), with giblets",
    "fine sea salt"
  ],
  "category": "dinner",
  "image": "https://www.gastrosenses.com/wp-content/uploads/2020/11/Crispy-Whole-Roast-Duck.jpg",
  "method": [
    "Remove the duck’s giblets and wash them. Cut off any greenish parts from the livers and discard, then roughly chop the rest. Quarter the crops (the gullet), slicing any very red flesh away from the white sinew, which should be discarded. Put all bits and pieces into a large roasting tin.",
    "Cut off the parson’s nose from each duck and add to the tin. Remove the wings: hold and pull on a wing, turning the skin back so you can see inside to where the wing is attached to the shoulder bone. Cut between the bones to release the wing, then cut around it from the skin side to remove it. Repeat with all wings and add them to the tin.",
    "Turn one of the ducks on to its breast. Cut down each side of the backbone, using a very sharp, sturdy kitchen knife and/or game scissors. Remove the backbone, then turn the duck the other way up and cut down each side of the breastbone, keeping the blade close to the bone so you don’t cut away any breast meat. Put all the bones into the tin and repeat with the other ducks.",
    "Remove any lumps of fat from inside the duck and set aside. Cut off any flappy bits of skin and discard. Wash the duck halves then pat very dry. Prick the skin all over, especially the thick, fatty areas, then sprinkle with fine sea salt.",
    "Preheat the oven to 230C/Gas 8/fan oven 210C. Arrange the duck halves skin-side up on a rack set inside a large roasting tin. Roast for 11⁄4-11⁄2 hours, or until the skin is crisp and dark golden. You will need to drain off the fat that accumulates once or twice: pour it straight into the tin if you’re going to roast potatoes, otherwise into a heatproof bowl.",
    "Leave the duck to rest for 10-15 minutes, serve with the gravy and veg (see 'Goes well with' recipes, right)."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6812"
  },
  "name": "Smoked salmon kedgeree",
  "ingredients": [
    "300g basmati rice",
    "8 eggs",
    "400g pack sliced smoked salmon",
    "knob of butter",
    "450g red onion, sliced",
    "8 garlic cloves, sliced",
    "large knob of fresh ginger, peeled and chopped",
    "1 tsp each fennel and cumin seeds",
    "6 cardamom pods",
    "4 bay leaves",
    "1 tbsp tomato purée",
    "1 heaped tsp curry powder",
    "large bunch coriander, leaves reserved, stalks chopped",
    "1l chicken stock, preferably fresh",
    "284ml tub double cream"
  ],
  "category": "lunch",
  "image": "https://cdn.mos.cms.futurecdn.net/QrEG6DANPSH68yRuEEgcLe.jpg",
  "method": [
    "To make the sauce, heat the butter in a large pan, then tip in the onions, garlic, ginger, spices and bay. Fry over medium heat for 8-10 mins until the onions colour. Stir in the purée, curry powder and coriander stalks, then cook for a few mins until everything is sticky. Pour in the stock and cream, season, stir well, then bring to the boil. Gently simmer for 15 mins until reduced by half. Strain through a sieve into a container. Keep covered in the fridge for up to two days.",
    "Rinse the rice in several changes of water, then put in a pan with enough cold water to cover it by 1.5cm. Cover the pan, then place over a high heat. Bring to a fast boil, stir, return the lid, turn heat to minimum, then leave the pan for 2 mins. Turn the heat off; leave for a further 10 mins. If making ahead, cool quickly, then refrigerate.",
    "On the day, poach the eggs, then set aside. Roughly chop the salmon and coriander leaves. Reheat rice until piping hot. Heat sauce until simmering, then stir in the rice. Stir though salmon and most of the coriander. Spoon into bowls"
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6813"
  },
  "name": "Tuna & red onion salad",
  "ingredients": [
    "tuna",
    "new potatoes, cooked",
    "red onion",
    "capers",
    "a handful of rocketor watercress"
  ],
  "category": "lunch",
  "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/04/Tuna-Salad-3.jpg",
  "method": [
    "Mix canned tuna (drained) with cooked new potatoes, red onion, capers and a handful of rocket or watercress, and toss with a bought fat-free dressing."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6814"
  },
  "name": "Spiced blackened prawns & clementine salsa",
  "ingredients": [
    "20 raw shell-on giant tiger prawns",
    "50g unsalted butter, melted",
    "1 lime, cut into wedges to serve",
    "4 clementines, peeled and chopped",
    "1 lime, juiced",
    "2 tbsp extra virgin olive oil",
    "1 small red onion, finely chopped",
    "1 red chilli, deseeded and finely chopped",
    "¼ cucumber, chopped",
    "½ small pack coriander, chopped",
    "1 tbsp smoked paprika",
    "1 tsp garlic salt",
    "1 tsp dried oregano",
    "1 tsp dried thyme",
    "1 tsp cayenne pepper",
    "1 tsp ground cumin"
  ],
  "category": "lunch",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/spiced-blackened-prawns-22fa609.jpg?quality=90&resize=440,400",
  "method": [
    "Start by butterflying the prawns. Using a small serrated knife, cut down the back of the prawns through the shells and the flesh from the heads to the tails, cutting just far enough that you can open it up, then remove the black entrails. Once all the prawns are butterflied, set aside.",
    "Combine all the salsa ingredients in a bowl with some seasoning. Ideally leave the salsa at room temperature for 30 mins so that the flavours can infuse.",
    "Mix all the seasoning ingredients together, along with 1 tsp fine salt and 1/ 2 tsp cracked pepper, in a bowl. Brush the prawns inside and out with the melted butter, then toss in the spice mix. Heat two large frying pans over a high heat, tip in the prawns and cook for 4-6 mins until they have just turned pink and the insides are opaque. Serve on a board with the salsa and lime wedges."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6815"
  },
  "name": "Ham & mushroom turnovers",
  "ingredients": [
    "250ml milk",
    "1 tbsp each butterand flour, mixed to a paste, plus extra for dusting",
    "140g button mushroom, cut into quarters",
    "1 tbsp olive oil",
    "140g ham, chopped into small pieces",
    "85g leftover cheese(amount will vary according to type - go with your taste buds), cut into small pieces",
    "1 tbsp chopped herbs- tarragon, parsley and chives all work well",
    "500g block puff pastry",
    "1 egg, beaten"
  ],
  "category": "appetizer",
  "image": "https://www.tastingtable.com/img/gallery/mushrooms-provide-a-savory-twist-in-classic-turnovers/l-intro-1695764657.jpg",
  "method": [
    "The first thing to do is to make a thick white sauce that will be the base of the turnover filling. Bring the milk to a simmer, then add the butter and flour paste. Whisk the paste into the simmering milk and allow it to boil for 3-4 mins, whisking gently all the time to prevent it from catching. You should now have a very thick white sauce. Cool the sauce in a bowl. Fry the mushrooms in the oil for 3-5 mins until golden, then leave to cool.",
    "Place the ham, cheese and mushrooms into a bowl, then gradually add the white sauce until everything is well coated. Finally, add the herbs.",
    "Roll out the pastry on a floured surface to about the thickness of a £1 coin and cut out 4 saucer-size rounds (about 18cm wide), re-rolling the trimmings if you need to. Brush the edges of each round with beaten egg. Spoon the mixture onto 1 side of each round, then fold over and seal the edges well. The turnovers can now be frozen for up to 1 month. Brush the turnover with the remaining egg, then chill for 30 mins.",
    "Heat oven to 200C/180C fan/gas 6. Place the turnovers on a baking sheet and bake for about 35 mins until puffed up and golden. Leave to cool slightly and enjoy warm."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6816"
  },
  "name": "Crab & avocado sesame toasts",
  "ingredients": [
    "100g guacamole",
    "16 shop-bought crostini",
    "200g white crabmeat",
    "2 tbsp sesame seed",
    "limewedges, to serve"
  ],
  "category": "appetizer",
  "image": "https://sp-ao.shortpixel.ai/client/to_webp,q_lossy,ret_img/https://truenorthseafood.com/wp-content/uploads/2020/11/Crab-a-cado.jpg",
  "method": [
    "Divide the guacamole between the crostini. Top each one with a spoonful of crabmeat. Toast the sesame seeds in a pan, then sprinkle over each crostini. Serve with lime wedges."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6817"
  },
  "name": "Prawn & grapefruit salad",
  "ingredients": [
    "2 pink grapefruits, zest and juice from 1, segments cut from the other",
    "2 tbsp olive oil",
    "1 tbsp red wine vinegar",
    "1 tsp caster sugar",
    "2 tbsp chopped dill",
    "300g cooked, peeled prawn",
    "½ cucumber, halved lengthways, seeds scooped out with a teaspoon, diced",
    "2 shallots, finely chopped",
    "2 handfuls frisée, torn",
    "2 handfuls rocket",
    "100g pack pomegranateseeds"
  ],
  "category": "lunch",
  "image": "https://fodmap-publicsite-us-east-2.s3.amazonaws.com/production/media/images/prawn_salad.original.jpg",
  "method": [
    "Whisk together the grapefruit zest and juice, oil, vinegar, sugar and dill to make a dressing. Mix half with the prawns and allow to marinate for 10 mins.",
    "Just before serving, gently toss the cucumber, shallots, frisée and rocket with the remaining dressing. Add a pile to each of 6 starter plates, along with the prawns and grapefruit segments. Scatter over the pomegranate seeds and serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6818"
  },
  "name": "Onion quiche with cheddar & bacon",
  "ingredients": [
    "25g butter",
    "2 large onions, halved and thinly sliced",
    "1 tbsp fresh thyme leaves, plus a few sprigs",
    "350g shop-bought shortcrust pastry",
    "plain flour, for dusting",
    "200g pack smoked baconlardons",
    "300g pot double cream",
    "100ml milk",
    "3 large eggs",
    "2-3 pinches of nutmeg, plus extra for the top",
    "140g mature cheddar, grated"
  ],
  "category": "lunch",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/caramelised-onion-quihe-with-cheddar-bacon-4267ce6.jpg?resize=768,574",
  "method": [
    "Melt the butter in a large non-stick frying pan, add the onions and cook for 20 mins, stirring now and then, until they are soft and golden brown. Season, stir in the thyme leaves, then transfer to a plate to cool.",
    "Heat oven to 200C/180C fan/gas 6 with a large baking sheet inside. Roll out the pastry on a lightly floured surface until large enough to line a 25cm loose-bottomed tart tin, with a little overhang of pastry all the way round the top. This will stop the pastry shrinking in the oven later. If there is more overhang than you need, trim off the excess with scissors. Gently press the pastry into the sides of the tin and prick the base with a fork. Chill for 15 mins.",
    "Line the pastry case with a sheet of baking parchment and fill with ceramic baking beans. Bake for 15 mins on the hot baking sheet (this helps to prevent a soggy bottom). Carefully remove the parchment and beans, then return to the oven for 10 mins more until the pastry looks cooked like shortbread, but is not too brown.",
    "Meanwhile, put the bacon in the pan you cooked the onions in (there’s no need to wash it first or add any oil) and fry for 10 mins until golden. Lift from the pan onto kitchen paper to remove any excess fat. Beat the cream, milk and eggs with seasoning and nutmeg, then stir in the bacon and half the cheese.",
    "Remove the pastry case from the oven and reduce heat to 190C/170C fan/gas 5. Spoon the caramelised onions evenly over the base of the pastry case. Pour in the bacon mixture, then scatter with the remaining cheese, the thyme sprigs and a little nutmeg. Bake for 25-30 mins until golden and the filling is just set with a slight wobble in the centre.",
    "Trim the excess pastry and leave to settle for 10 mins, then remove from the tin and slice."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6819"
  },
  "name": "Sticky Thai pork",
  "ingredients": [
    "1 thumb-size piece fresh root ginger",
    "1 garlic clove, roughly chopped",
    "2 fat green chillies, seeds left in",
    "small bunch coriander, stalks finely chopped (or if you can find a bunch with the root intact, chop that instead)",
    "50g dried shrimp, soaked in water for 10 mins, then drained",
    "1 tbsp groundnut or vegetable oil",
    "200g minced pork",
    "1 tsp fish sauce",
    "100g palm sugaror light muscovado sugar",
    "½ pineapple, peeled and sliced very thinly, to serve"
  ],
  "category": "dinner",
  "image": "https://img.taste.com.au/mgkBria3/taste/2017/11/sticky-pork-belly-bites-taste_1980x1320-132894-1.jpg",
  "method": [
    "Put the ginger, garlic, chilli, coriander stalks (or root) and shrimp into a food processor and whizz to a paste.",
    "Heat a wok, add the oil, then add the paste. Fry until fragrant. Add the pork, stir well and fry for 5 mins until cooked through. Stir in the fish sauce and the palm sugar, then cook for a good 10 mins more, until the meat becomes sticky, dark and caramelised. Can be made up to 2 days ahead, then reheated. Cool a little, top each pineapple slice with a teaspoon of the sticky pork and devour."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf681a"
  },
  "name": "Warm Mexican bean dip",
  "ingredients": [
    "1 onion, chopped",
    "1 tbsp olive oil",
    "1 tsp soft brown sugar",
    "1 tsp winevinegar",
    "1 tsp Cajun seasoning",
    "400g tin mixed beans, rinsed and drained",
    "400g tin chopped tomatoes, with garlic",
    "handful grated cheddar",
    "100g tortilla chips",
    "serve with chopped avocado(optional)"
  ],
  "category": "side",
  "image": "https://img.bestrecipes.com.au/ZiunlZg3/w643-h428-cfill-q90/br/2016/11/mexican-bean-dip-recipe-515059-1.jpg",
  "method": [
    "Fry the chopped onion in olive oil until soft. Add soft brown sugar, wine vinegar and Cajun seasoning. Cook for 1 min then add the mixed beans and chopped tomatoes with garlic. Simmer for 10-15 mins until the sauce has thickened then season.",
    "Scatter handful grated cheddar onto tortilla chips. Microwave on High for 1 min until cheese has melted. Serve alongside the dip (top with some chopped avocado if you like). Make ahead and reheat dip before guests arrive."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf681c"
  },
  "name": "Berry semifreddo",
  "ingredients": [
    "3 egg whites",
    "1 tsp powdered instant coffee",
    "175g golden caster sugar",
    "50g toasted chopped hazelnut",
    "2 x 284ml cartons double cream",
    "500g bag frozen mixed berry",
    "142ml carton double cream",
    "1 tbsp golden syrup",
    "140g dark chocolate (70% cocoa solids), broken into pieces",
    "25g butter"
  ],
  "category": "dessert",
  "image": "https://images.eatsmarter.com/sites/default/files/styles/max_size/public/berry-semifreddo-471041.jpg",
  "method": [
    "Preheat the oven to fan 90C/ conventional 110C/gas 1⁄4 and cover a baking sheet with baking parchment. Tip the egg whites into a large bowl, sprinkle in the coffee powder and whisk until the whites are stiff. Add half the caster sugar and whisk in well, then tip in the remaining sugar and the chopped hazelnuts and whisk until blended and standing in stiff peaks.",
    "Spread the meringue mixture to a depth of about 2cm on the baking parchment (any shape will do as you’re going to break it up later). Bake for 3 hours until crisp right through. Remove and cool.",
    "Cut out a 28cm circle of baking parchment and make 10cm cuts towards the centre all the way round. Use this to line the bottom and sides of a loose-bottomed 20cm round cake tin.",
    "Pour the cream from both cartons into a bowl and whip until it just holds its shape. Break the meringue into smallish pieces with your hands. Set aside about a third of the meringue for the top of the cake, and mix the rest into the cream. Spread out about a third of the cream mixture in the bottom of the tin and cover with half the frozen berries. Repeat these layers once more, then cover with the remaining cream mixture and top with the reserved meringue. Cover the cake with cling film and compress evenly with a small plate that fits inside the tin. Wrap in foil, label and freeze for up to a month.",
    "Make the sauce. Put the cream and golden syrup in a small pan with 3 tbsp water. Heat until just bubbling, then turn the heat down to low and add the chocolate and butter. Heat gently, stirring occasionally, until the chocolate melts and the mixture becomes smooth and glossy. Pour into a freezer container, cool, seal, label and freeze for up to a month.",
    " transfer the cake and the chocolate sauce from the freezer to the fridge 8 hours before you plan to serve. After 2-3 hours, take out the cake. Unwrap it and carefully balance the cake tin on a jam jar or can, then push down on the sides of the tin to release. Peel away the baking parchment from the sides. Now lift the cake off the base of the tin, discarding the parchment underneath (a wide palette knife or fish slice will help here) and stand the cake on a serving plate. Return to the fridge for 5 hours before serving with the chocolate sauce.",
    "To warm the chocolate sauce, pour it into a heatproof bowl over a pan with a little hot water in the bottom and heat gently, stirring occasionally, until warm, smooth and glossy."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf681d"
  },
  "name": "Triple chocolate mousse",
  "ingredients": [
    "butter, for greasing",
    "425ml double cream",
    "75g each good-quality milk, white, plain chocolate, broken into pieces",
    "6 eggs, separated into 2-egg batches",
    "75g caster sugar",
    "50g plain chocolate, melted",
    "icing sugar, single cream, chocolate curls"
  ],
  "category": "dessert",
  "image": "https://i.ytimg.com/vi/4IvISVSNEEk/maxresdefault.jpg",
  "method": [
    "For a 1.2 litre terrine, cut a strip of greaseproof paper as long as the tin and wide enough to cover the bottom and come up both long sides, with about 7.5cm to spare. Put the paper in the tin as if to line it, then draw a line across the paper on both sides where it meets the bottom edge, and the top edge, of the tin. Take the paper out of the tin and draw two lines at equal intervals between the bottom and top edge lines you have already drawn. (This will help you make each layer exactly the same depth when filling the tin.) Lightly grease the paper and use to line the tin.",
    "Whip a third of the cream to just soft peak stage, then chill. Melt the milk chocolate in a heatproof bowl set over a pan of simmering water or microwave on High for 2 mins. Whisk 2 egg yolks and 25g/1oz sugar in a heatproof bowl over a pan of simmering water with a hand-held electric blender for about 2-3 mins until the mixture has at least doubled in volume. Once you have reached this stage, remove the bowl from the heat and keep whisking, adding the melted chocolate – this not only incorporates the chocolate, but also cools the mixture more quickly. Leave to cool for a few minutes, then carefully fold in the whipped cream.",
    "Quickly whisk two egg whites into soft peaks, making sure the bowl and whisk are spotless to ensure the maximum volume is obtained. Using a large metal spoon, carefully fold the egg white into the chocolate mixture so you don’t knock out too much air.",
    "Pour mixture into the terrine, filling it to first mark (any extra can be frozen), then freeze for 20-30 mins before starting the white chocolate mixture. Repeat process with white chocolate, then the plain; cover with plastic film and freeze completely. To guarantee a good set, make terrine at least 8-10 hrs or up to 2 days before.",
    "Dip the tin briefly in a large bowl of hot water. Put a chopping board or flat plate on top and invert the mousse. Gently remove the paper and open freeze for about 10 mins to re-set. To decorate, pipe an outline of melted plain chocolate in a teardrop shape onto each plate. Dust the plates lightly with icing sugar, then carefully fill the teardrop with cream. Slice the mousse, wiping the knife after each cut, and put a slice on each plate. Decorate with chocolate curls and serve at once."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf681e"
  },
  "name": "Cheesy spinach parcels",
  "ingredients": [
    "225g fresh spinach, washed",
    "1 tbsp groundnut oil",
    "1 large shallot, finely diced",
    "25g walnuts or pine nut, roughly chopped",
    "75g vegetarian cheddar, grated",
    "pinch freshly grated nutmeg",
    "2 tbsp double cream",
    "1 tsp walnut oil",
    "25g butter, melted",
    "12 squares filo pastry, each measuring 16cm x 16cm"
  ],
  "category": "appetizer",
  "image": "https://supervalue.imgix.net/assets/recipes/Spinach-Cheese-Parcels.jpg",
  "method": [
    "Heat oven to 190C/fan 170C/gas 5. Place spinach in a pan and stir over a high heat until wilted. Strain, squeeze out as much liquid as possible, then roughly chop.",
    "Heat oil in a frying pan, sauté shallot until softened. Add walnuts, then fry for 2-3 mins. Remove from heat, stir in spinach, cheese, nutmeg, cream and seasoning.",
    "Mix walnut oil with butter. Brush a thin coating on a piece of pastry. Place another piece on top with corners at a different angle, brush with the butter and repeat with one more piece. Place a spoonful of spinach mix in the centre, bring up corners of pastry and pinch in the middle to form a parcel. Repeat to make remaining parcels, then transfer to a greased baking tray. Brush parcels with remaining butter and oil. Bake for 20 mins until golden."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf681f"
  },
  "name": "Venetian-style scallops",
  "ingredients": [
    "12 large fresh scallops, separated from their shells (ask your fishmonger to do this for you)",
    "4 concave scallops shells, as serving dishes",
    "3 slices day-old white bread",
    "6 tbsp extra-virgin olive oil",
    "large handful fresh finely chopped flatleaf parsley",
    "1 garlic clove, finely chopped",
    "juice of a lemon, plus wedges to serve"
  ],
  "category": "dinner",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-385459_11-bab62e4.jpg?quality=90&resize=440,400",
  "method": [
    "Rinse the scallops in cold water then pat dry with kitchen paper. With scissors, snip off the corals (the orange part) as closely as you can to the plump white scallop, and reserve. Scrub the scallop shells thoroughly and dry them.",
    "Remove the crusts from the bread and discard. Break the bread into smallish pieces, then pulse in the food processor to make into fine breadcrumbs. Tip into a large non-stick frying pan and toast the breadcrumbs over a moderate heat, stirring every now and then. When they are evenly browned, set aside.",
    "Brush any crumbs from the pan with kitchen paper then add the olive oil. When hot, add the scallops but not the corals. Fry over a moderate heat for 3 minutes on each side, then add the corals, chopped parsley and garlic and fry a further minute. If you have shelled your own scallops and saved some of their sweet juice, strain it through muslin to remove any sand then add it to the pan now and let it bubble over a high heat. Season to taste with salt and pepper, add the lemon juice and mix well.",
    "Spoon three scallops and their corals with some of the pan juices onto each of the cleaned shells, then scatter with the dry toasted breadcrumbs. Serve with the lemon wedges."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6820"
  },
  "name": "Chicory salad & blue cheese dressing",
  "ingredients": [
    "4 heads of chicory(it's nice to have a mix of 2 red and 2 white)",
    "4 tbsp olive oil",
    "200g blue cheese(stilton or similar)",
    "2 tbsp white wine vinegar",
    "75ml double cream",
    "juice ½ lemon",
    "4 tbsp crème fraîche"
  ],
  "category": "vegetarian",
  "image": "https://www.raymondblanc.com/wp-content/uploads/2018/04/Raymond_Blanc_001-934-1920x1080.jpg",
  "method": [
    "Slice the base off each chicory and peel off the leaves until you reach the core, which you can either cut into quarters or leave whole. Arrange the leaves on a platter.",
    "Drizzle the chicory with a little olive oil and season with salt and pepper. Crumble half the blue cheese over the chicory, then mix the remaining cheese with the vinegar, squashing with a fork to make it creamy. Add the cream, lemon juice and crème fraîche, then whisk together. Adjust the seasoning, spoon over the salad and serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6821"
  },
  "name": "Classic nougat",
  "ingredients": [
    "100g whole blanched almonds",
    "100g peeled pistachios",
    "100g peeled hazelnuts",
    "2 sheets edible rice paper",
    "icing sugarfor dusting",
    "150g clear honey(use a floral-flavoured honey for extra flavour)",
    "300g white caster sugar",
    "100g liquid glucose",
    "2 medium egg whites",
    "1 tsp vanilla extract"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/nougat-d53dd97.jpg?resize=768,574",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Scatter the nuts over a ",
    " and toast in the oven for 10 mins, then set aside (they don’t need to cool). Cut the two pieces of rice paper to fit a 20 x 20cm square tin. Line the tin with one sheet of rice paper, brush the sides of the tin with oil, then dust the tin with icing sugar. ",
    "Put the honey into a ",
    ", then in another saucepan tip in the sugar, glucose and 100ml of water. Put the egg whites in the very clean bowl of a tabletop mixer with a whisk attachment and whisk on a low speed. Heat and boil the honey until it reaches 121C on a digital cooking thermometer, then straightaway pour the honey over the egg whites and set the speed to medium. While the whites and honey are whisking, bring the sugar and water to the boil and keep boiling until the syrup reaches 145C exactly on a digital cooking thermometer. Pour the hot syrup in a slow, steady stream into the beating egg white mixture. Continue beating for about 10 mins until you have a thick, glossy, firm meringue. It’s hard to over-whisk at this stage but easy to under-whisk, so keep going until the meringue looks like sticky chewing gum.",
    "Use a ",
    " to stir though the nuts (which should still be warm), the vanilla extract and a small pinch of salt. Scrape the mixture into the lined tin, then smooth over to spread the mixture out evenly (if you have an offset spatula, now is the time to use it). Finally, top with the remaining sheet of rice paper and press down. Leave the nougat to set for at least 2 hrs or overnight. ",
    "To turn out and portion, use a spatula to loosen the edges of the nougat away from the tin, then invert the tin on to a clean board and use a sharp serated, hot knife to portion into bars or squares. "
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6822"
  },
  "name": "Fortune cookies",
  "ingredients": [
    "2 egg whites",
    "1 tsp vanilla extract",
    "1 tsp almond extract",
    "3 tbsp sunflower oil",
    "100g plain flour",
    "2 tsp cornflour",
    "100g caster sugar",
    "1½ tbsp black sesame seeds"
  ],
  "category": "dessert",
  "image": "https://www.thespruceeats.com/thmb/tW07APdBu9qKH3MSKG4IVISfSzI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/fortune-cookie-recipe-694545-hero-01-3a76ceb6582e4893b49900785cd2333c.jpg",
  "method": [
    "Preheat the oven to 180C/160 fan/gas 4 and line a large baking sheet with baking parchment, or use a silicone baking sheet. Write or print fortunes on paper measuring 6cm long by 1cm wide.",
    "Put the egg whites, vanilla, almond extract, oil and 2 tsp cold water into a bowl and whisk with an electric hand whisk until frothy, 20-30 secs. Measure the flour, cornflour, sugar and a good pinch of salt into a bowl, then sift into the egg white mixture. Whisk everything together until you have a smooth batter-like consistency. Chill the mixture for 1 hr.",
    "Next, put a tbsp of mixture onto the prepared baking sheet. Oil a metal spoon, then use the back of it to swirl the mixture out into a 8-10cm circle. Repeat with another tablespoon of the mixture, to create 2 cookies. Make sure there is space between each cookie as they will spread in the oven. It is best to only bake 2-3 cookies at a time, as you will need to shape them whilst they are hot. Sprinkle 1 of the cookies with black sesame seeds, then bake for 10-12 mins until the edges of the cookies turn golden.",
    "One at a time remove the cookies with a palette knife once they are out the oven. You want them to still be soft so you can shape them so work quickly. Turn the cookie over so that the sesame seeds are face down and put the fortune in the middle of the circle. Fold the circle in half to secure the fortune and pinch the 2 edges together to seal. Pop the cookie on the rim of a mug or cup and very gently pull the 2 corners down to get the fortune cookie shape. Hold for 10 secs, then transfer the cookies to muffin tins so that they hold their shape whilst cooling completely. Repeat with the remaining cookie mixture."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6823"
  },
  "name": "Limoncello plum tart",
  "ingredients": [
    "500g ready-made shortcrust pastry",
    "zest and juice of 2 unwaxed lemons",
    "4 tbsp double cream",
    "100g pack ground almonds",
    "5 eggs",
    "100g butter, melted",
    "8 tbsp limoncello liqueur",
    "6 plums, stoned and cut into wedges",
    "200g golden caster sugar"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-5177_12-7bb3573.jpg?resize=768,574",
  "method": [
    "Roll out the pastry and use to line a loose-bottomed tart tin, 25cm diameter and about 3.5-4cm deep. Chill for at least half an hour.",
    "Heat oven to 180C/fan 160C/gas 4. Line the pastry with greaseproof paper, fill with baking beans and bake blind for 15 mins. Remove beans and paper.",
    "Put the lemon zest and juice, cream, almonds, sugar, eggs and melted butter in a large bowl and whisk until smooth then stir in the limoncello.",
    "Put the plums in the pastry case then pour the custard mixture over. Bake for about 20-30 mins until the custard is just set. Allow to cool then dredge with icing sugar before serving."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6824"
  },
  "name": "Cinnamon rolls",
  "ingredients": [
    "350g can ready-made croissant dough(we used Jus Rol)",
    "30g unsalted butter, softened",
    "2 tsp cinnamon",
    "6 tbsp soft light brown sugar"
  ],
  "category": "dessert",
  "image": "https://assets.tmecosys.com/image/upload/t_web767x639/img/recipe/ras/Assets/086c2cec-ac6e-4194-a156-f090a5e9c7af/Derivates/fa851505-6649-4678-b493-291f4dad822a.jpg",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Line a 23cm cake tin with a square of baking parchment so the corners stick up (this will help you to lift the rolls out).",
    "Unroll the croissant dough from the can and lay it out on your work surface. Cut it into three sections along the dotted lines, but don’t cut the diagonal line. Spread over a quarter of the butter.",
    "Mix the cinnamon and sugar together. Using one square of dough at a time, sprinkle over 2-3 tsp of the sugar and roll up the dough. When you have three rolls, cut each one in half and then each half into three. Arrange the rolls in the tin in two circles – you need to spread them well apart as they will rise and spread. Stick the end bits in among fatter pieces from the centre of the rolls so they cook evenly. Bake for 15 mins or until the rolls are risen and cooked through.",
    "Meanwhile, heat the remaining sugar mix with the remaining butter until you have a thick caramel (don’t worry if some of the butter separates out, it will soak into the dough). When the rolls are cooked, pour over the caramel. Leave to cool a little, then eat warm."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6825"
  },
  "name": "Cranberry-pistachio brownies",
  "ingredients": [
    "200g butter, diced, plus extra for greasing",
    "2 x 150g bars plain chocolate (about 40% cocoa solids is fine)",
    "280g light muscovado sugar",
    "4 tbsp cranberry juice or milk",
    "4 medium eggs",
    "200g plain flour",
    "½ tsp ground cinnamon",
    "1 x 75g pack dried cranberries",
    "100g pistachios, sliced",
    "icing sugar to dust, optional"
  ],
  "category": "dessert",
  "image": "https://ournourishingtable.com/wp-content/uploads/2018/05/cranberry-pistachio-choc-scaled.jpg",
  "method": [
    "Heat the oven to 180C/fan 160C/gas 4. Butter a non-stick baking tin (about 31 x 17 x 3.5cm) or line the base if you prefer. Break the chocolate into a saucepan, add the butter, sugar and juice or milk, then warm gently, stirring frequently until melted and evenly mixed. Allow to cool slightly, then beat in the eggs one at a time. Fold in the flour, cinnamon and cranberries.",
    "Spread half the mixture into the prepared tin, scatter over the nuts, then gently spread the rest of the mixture on top. Bake for 25-30 mins. Cut into squares while still warm. Will keep in an airtight container for up to a week."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6826"
  },
  "name": "Stuffed mushroom bruschettas",
  "ingredients": [
    "4 thick slices country-style loaves, white or brown",
    "2 x 20g/1oz tubs garlic butter or 50g/2oz softened butter beaten with 1 chopped clove of garlic",
    "4 large flat mushrooms",
    "200g jar roasted red peppers, either strips in oil or whole peppers in brine",
    "150g firm goat's cheese"
  ],
  "category": "appetizer",
  "image": "https://static.diabetesfoodhub.org/system/thumbs/system/images/recipes/1710-diabetic-Bruschetta-Stuffed-Mushrooms_Diabetes-Superfoods-Cookbook_010419_3885281428.jpg",
  "method": [
    "Preheat the oven to 190C/Gas 5/170C fan. Spread both sides of each slice of bread with garlic butter (no need to remove the crusts). Put the bread slices in one layer on a baking sheet. Put a mushroom on top of each and drizzle with a little olive oil. Sprinkle with salt and pepper.",
    "Drain the peppers, slice if necessary, and divide between the mushrooms. Cut the goat’s cheese into four slices and put one slice on top of each stack. Bake for 25-30 minutes, until the mushrooms are cooked and the cheese golden. Serve with a mixed salad."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6827"
  },
  "name": "Mustard chicken with tarrago",
  "ingredients": [
    "1 heaped tsp Dijon mustard",
    "140g butter, softened",
    "2 chicken approx 1½ kg/3lb 5oz each",
    "whole garlic bulb, cut across the middle",
    "175ml white wine",
    "300ml chicken stock",
    "500g bag Chantenay or baby carrot",
    "small handful each chopped tarragon and parsley"
  ],
  "category": "dinner",
  "image": "https://danishcreamery.com/wp-content/uploads/recipe-tarragon-butter-roast-chicken-1.jpg",
  "method": [
    "Heat oven to 200C/fan 180C/gas 6. Beat the mustard and butter together, then season well. Put the chickens into a large roasting tin; then, starting at the neck end, pull the skin away from the breast and thigh meat with your fingers. Stuff the butter under the skin, saving 1 tbsp for later. Put half the garlic bulb into each cavity. Season generously, cover with foil, then roast for 1 hr, uncovering for the final 20 mins, until crisp and golden.",
    "Lift the birds onto a board, then sit the pan on the hob and splash in the wine. Reduce for 5 mins, scraping up the meaty bits with a wooden spoon, then add the stock and bring to a simmer. Tip in the carrots, cover with a sheet of foil, then cook for 5 mins. You can do this ahead of time. Add the peas and simmer for a few mins until tender. Just before serving, whisk in the reserved mustard butter, chopped herbs and any resting juices, then season to taste. If you like, transfer everything to a platter and bring to the table – or simply return the chickens to the roasting pan."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6828"
  },
  "name": "Honey-roast carrots",
  "ingredients": [
    "1kg Chantenay carrot, or large carrots, cut into big chunks",
    "1 heaped tsp clear honey",
    "juice 1 large orange",
    "2 tbsp mild olive oil"
  ],
  "category": "side",
  "image": "https://food-images.files.bbci.co.uk/food/recipes/honey_roast_carrots_07540_16x9.jpg",
  "method": [
    "Heat oven to 200C/180C/gas 6. Boil carrots for 5 mins till almost cooked, drain and cool. Mix the rest of the ingredients in a small roasting tray, tip in carrots, season and roast for 20 mins until cooked, but still with a little bite."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6829"
  },
  "name": "Mini creamy mushroom pies",
  "ingredients": [
    "25g butter, plus extra for greasing",
    "1 tsp olive oil",
    "1 small onion, finely sliced",
    "1 garlic clove, crushed",
    "350g mixed mushroom, sliced",
    "small handful parsley, finely chopped",
    "100ml single cream",
    "375g pack ready-rolled shortcrust pastry",
    "a little plain flour, for dusting",
    "1 egg, beaten",
    "1 tsp caraway seed"
  ],
  "category": "vegetarian",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1173470_11-47fdfff.jpg?quality=90&resize=440,400",
  "method": [
    "Heat the butter and oil in a frying pan. Add the onion and fry until soft. Stir in the garlic and mushrooms, season and cook for 5 mins until the mushrooms are soft. Stir in the parsley and cream. Remove from the heat and allow to cool.",
    "Heat oven to 200C/180C fan/gas 6. Grease a 6-hole muffin tin with butter, then line each hole with a long thin strip of baking parchment. Roll out the pastry on a lightly floured surface and stamp out 6 x 10 cm circles. Press a circle into each hole to line. Roll out the remaining pastry (you may need to re-roll trimmings) and stamp out 6 x 8cm circles.",
    "Divide the mushroom mix between the pies. Brush the pastry edges with a little egg, top each with a pastry lid and carefully press the pastry edges together to seal.",
    "Brush with the remaining egg and sprinkle with caraway seeds. Bake for 25-30 mins until golden. Allow to cool in the tin slightly before serving, or cool on a wire rack and keep in airtight containers for up to 1 day. Reheat before serving."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf682a"
  },
  "name": "Cranberry chicken salad",
  "ingredients": [
    "2 skinless chicken breasts",
    "4 tsp olive oil",
    "2 red onions, thinly sliced",
    "200g mixed leaves",
    "½ cucumber, deseeded and sliced",
    "25g dried cranberries",
    "85g/3oz cranberrysauce",
    "juice 1 lime"
  ],
  "category": "lunch",
  "image": "https://www.nospoonnecessary.com/wp-content/uploads/2019/11/Cranberry-Chicken-Salad-80.jpg",
  "method": [
    "Slice each chicken breast in half horizontally to give 4 thin breasts, then rub with half the oil and season. Heat a non-stick frying pan and fry the chicken for 3 mins on each side until cooked through. Set aside on a plate.",
    "Heat the remaining oil in the pan and fry the onions for 5 mins. Slice the chicken, collecting any juices, and layer up with the onions, leaves, cucumber and dried cranberries. Mix the cranberry sauce, lime juice, 2 tbsp water and any chicken resting juices, and drizzle over the salad."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf682b"
  },
  "name": "Chicken, kale & sprout stir-fry",
  "ingredients": [
    "100g soba noodle",
    "100g shredded curly kale",
    "2 tsp sesame oil",
    "2 lean chicken breasts, skin removed and sliced into thin strips",
    "25g piece fresh ginger, peeled and sliced into matchsticks",
    "1 red pepper, deseeded and thinly sliced",
    "handful Brussels sprout, cut into quarters",
    "1 tbsp low-sodium soy sauce",
    "2 tbsp rice wine or white wine vinegar",
    "zest and juice 1 lime"
  ],
  "category": "dinner",
  "image": "https://mamashire.com/wp-content/uploads/Easy-Chicken-Stir-Fry-1-1B.jpg",
  "method": [
    "Cook the noodles following pack instructions, then drain and set aside. meanwhile, heat a large wok or frying pan and add the kale along with a good splash of water and cook for 1-2 mins until wilted, with a little bite remaining, then cool under running water to keep the colour.",
    "Add half the oil and cook the chicken strips until browned, then remove and set aside. Heat the remaining oil and fry the ginger, pepper and sprouts until softened a little. return the chicken and kale and add the noodles.",
    "Tip in the soy, rice wine and lime zest and juice along with enough water to create a sauce that clings to the ingredients. Serve immediately."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf682c"
  },
  "name": "Korean rice pot",
  "ingredients": [
    "500ml/ 18 fl oz hot chicken stock",
    "250g/ 9oz long grain rice",
    "300g/ 11oz cooked turkey, diced",
    "250g/ 9oz baby spinach",
    "2 carrots, shredded",
    "1 tsp toasted sesame oil",
    "1 tsp toasted sesame seed",
    "2 tbsp vegetable oil",
    "4 eggs",
    "2 tbsp thick chilli sauce"
  ],
  "category": "dinner",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2022/11/Spanish-rice-0aad18a.jpg?quality=90&resize=556,505",
  "method": [
    "Pour the chicken stock into a large pan and bring to the boil. Add the rice and turkey, bring back to the boil and simmer for 12-15 mins until the stock has been absorbed and rice is tender.",
    "Meanwhile, put the spinach in a colander and pour over a kettle of hot water to lightly wilt. Keep the spinach and carrots separate, but dress both with the sesame oil and seeds.",
    "Cover the cooked rice with a lid and leave to sit for a couple of mins. Meanwhile, heat vegetable oil in a non-stick pan set over a high heat. Fry eggs so the white crisps up nicely round the edges.",
    "Spoon the rice into large bowls and arrange the spinach and carrots on top. Finish each with a fried egg and a dollop of chilli sauce. Serve immediately."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf682d"
  },
  "name": "Spinach, cheese & onion rice torte",
  "ingredients": [
    "400g spinach",
    "2 tbsp olive oil",
    "1 large onion, finely chopped",
    "2 garlic cloves, finely chopped",
    "pinch of chilli flakes",
    "300g courgette, cubed",
    "100g risotto rice",
    "100g mature cheddar, grated",
    "2 large eggsand 1 medium egg",
    "1 tbsp Dijon mustard",
    "500g pack shortcrust pastry",
    "2 tbsp milk",
    "2 tsp sesame seed"
  ],
  "category": "vegetarian",
  "image": "https://static01.nyt.com/images/2012/04/10/health/nutrition/10recipehealth/10recipehealth-superJumbo.jpg",
  "method": [
    "Wash the spinach and put it in a large saucepan with just the water that clings to its leaves. Heat for 1-2 mins until gently wilted, then tip into a colander and allow to cool. Once cool, squeeze out the excess water and chop finely.",
    "Heat the oil in a frying pan and gently cook the onion for about 5 mins until softened. Stir in the garlic and chilli flakes, and cook for 1 min more. Tip into a bowl, add the spinach, courgettes, rice and cheese, and toss together.",
    "Beat the 2 large eggs with the mustard, a pinch of salt and a good grinding of black pepper. Add to the spinach mixture and mix well. Heat oven to 200C/180C fan/gas 6. Put a baking sheet in the oven to preheat. Cut the pastry in half and roll 1 piece out on a lightly floured work surface until you have a sheet that measures 32 x 17cm. Place in a 30 x 15cm tin and prick it well all over the base. Roll out the remaining piece of pastry to the same size.",
    "Spoon the spinach mixture into the pastry base. Beat together the milk and remaining medium egg, then brush the edges of the pastry with it. Lay the other sheet of pastry over the top and press down gently to seal. Brush the top with a little more beaten egg and sprinkle with the sesame seeds.",
    "Place the tin on the preheated baking tray and bake for 10 mins, then reduce the temperature to 160C/140C fan/gas 4 and bake for a further 30 mins until the pastry is golden. Leave to cool for 10 mins before cutting into squares."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf682e"
  },
  "name": "Winter pilaf",
  "ingredients": [
    "1 tsp olive oil",
    "1 red or white onion, chopped",
    "1 garlic clove, crushed",
    "4 cardamom pods, bashed",
    "1 tsp ground cumin",
    "1 cinnamon stick",
    "100g mixed brown and wild rice(or basmati)",
    "300ml vegetable stock",
    "handful leftover cooked turkey, goose or duck, shredded",
    "handful toasted nuts",
    "handful coriander, roughly chopped",
    "leftover cranberrysauce, to serve"
  ],
  "category": "dinner",
  "image": "https://cdn.cleaneatingmag.com/wp-content/uploads/2015/12/parmesan-crusted-winter-cabbage-pilaf.jpg?crop=4:3&width=1600",
  "method": [
    "Heat the oil in a pan and gently fry the onions and garlic until softened, about 5 mins. Add the spices and rice, then stir-fry for 1-2 mins. Pour in the hot stock and simmer until the stock is nearly all absorbed, about 20-25 mins. Stir in the turkey, add seasoning, then continue cooking until warmed through. Scatter over the nuts and coriander. Divide between two bowls and serve with a dollop of cranberry sauce."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf682f"
  },
  "name": "Sprout & chorizo carbonara",
  "ingredients": [
    "2 tsp olive oil",
    "140g cubed chorizo",
    "250g Brussels sprouts",
    "200g spaghetti",
    "3 egg yolks",
    "150ml single cream",
    "50ml milk",
    "25g grated parmesan, plus extra, to serve",
    "black pepper, to taste"
  ],
  "category": "lunch",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/sprout_chorizo_carbonara-3ffc55e.jpg?quality=90&resize=440,400",
  "method": [
    "Heat a large frying pan with the olive oil and boil a large pan of salted water. Add the cubed chorizo to the frying pan and cook for 5 minutes, stirring, until the oils are released into the pan. Halve and finely slice the Brussels sprouts. Add these to the frying pan, season and cook for 10 mins, stirring now and then, until tender.",
    "Cook the spaghetti following pack instructions. Whisk the egg yolks, single cream and milk with the grated Parmesan and a good grind of black pepper.",
    "When the pasta is cooked, drain, reserving a cup of the cooking water, and add the pasta to the frying pan. Turn the heat to very low and add the egg mixture. Toss everything together for 2-3 mins until the sauce has thickened, adding a splash more water if it looks to dry. Serve with extra Parmesan."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6830"
  },
  "name": "Salmon with garlic chickpeas",
  "ingredients": [
    "4 skinless salmon fillets, about 150g/5oz each",
    "2 tsp black peppercorns",
    "1 tsp paprika",
    "grated zest and juice 2 limes",
    "1 tbsp olive oil",
    "2 x 400g/14oz cans chickpeas",
    "3 tbsp olive oil",
    "2 garlic cloves, finely chopped",
    "150ml vegetable stock",
    "130g bag baby spinach"
  ],
  "category": "dinner",
  "image": "https://jonoandjules.files.wordpress.com/2018/01/pepper-crusted-salmon-with-garlic-chickpeas-1.jpg",
  "method": [
    "Heat oven to 190C/fan 170C/gas 5. Put the salmon fillets in a shallow ovenproof dish in a single layer. Roughly crush the peppercorns with a pestle and mortar, or tip into a cup and crush with the end of a rolling pin. Mix with the paprika, lime zest and a little sea salt. Brush the salmon lightly with oil, then sprinkle over the pepper mix. Bake for 12-15 mins until the salmon is just cooked.",
    "Meanwhile, tip the chickpeas into a colander, rinse well under cold running water, then drain. Heat the oil in a pan, add the garlic, then gently cook for 5 mins without browning. Add the chickpeas and stock, then warm through. Crush the chickpeas lightly with a potato masher, then add the spinach and stir well until the leaves are wilted. Add the lime juice and some salt and pepper, then heat through. Serve with the salmon."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6832"
  },
  "name": "Pickled onions",
  "ingredients": [
    "500g small shallot",
    "50g salt",
    "500ml malt vinegar",
    "200g clear honey"
  ],
  "category": "side",
  "image": "https://www.thespruceeats.com/thmb/A6xApAtc37p9TGQvU1z2FSU3GLs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/easy-quick-pickled-onions-recipe-3062118-hero-images-2-e0a1c398ab224b179881a1b02be04032.jpg",
  "method": [
    "Place the onions in a large heatproof bowl and pour over boiling water to cover. Leave to cool. Once cool, trim roots and tops and peel. Sprinkle the salt over the peeled onions, stir and leave overnight.",
    "Next day rinse the onions well and dry with kitchen towel. Place the vinegar and honey into a large pan and gently heat just to dissolve the honey into the vinegar, but do not boil.",
    "Pack the onions into clean, sterilized jars. Pour over the hot vinegar mixture to fill the jars, and check there are no air pockets. Seal the jars and leave to cool. The onions will be ready to eat after about 1 month or better if kept for 2. Once opened store in the fridge."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6833"
  },
  "name": "Lime & coconut dhal",
  "ingredients": [
    "1-2 tbsp mild curry paste",
    "160ml tin coconut cream",
    "zest of 1 lime, plus a squeeze of juice",
    "1 heaped tsp brown sugar",
    "400g tin lentils, drained",
    "handful chopped coriander, plus extra to serve",
    "2 warmed naan bread, cut into fingers"
  ],
  "category": "vegetarian",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/sri_lankan_dal_with_59252_16x9.jpg",
  "method": [
    "Heat the curry paste in a pan for 1 min. Pour in the coconut cream and stir to combine. Add the lime zest, brown sugar and lentils. Bring to a simmer and cook for 10 mins, adding a squeeze of lime juice and seasoning. Stir through a handful chopped coriander and serve with warmed naan breads. Sprinkle extra coriander on the dhal if you like. Great warm or at room temperature."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6834"
  },
  "name": "Smoked salmon with lentil salad",
  "ingredients": [
    "175g Puy lentils",
    "1 shallot, finely chopped",
    "1 tbsp wholegrain mustard",
    "2 tbsp white wine vinegar",
    "6 tbsp good olive oil",
    "3 eggs",
    "2 tbsp dill, chopped, plus extra fronds to garnish",
    "12 slices smoked salmon"
  ],
  "category": "lunch",
  "image": "https://img.taste.com.au/5wN3AemM/taste/2016/11/hot-smoked-salmon-lentil-salad-96208-1.jpeg",
  "method": [
    "Rinse the lentils, then put them in a pan and cover generously with water. Bring to the boil, then turn down the heat and simmer for 25-30 mins until tender. Drain well and leave to cool. Put the shallot in a bowl with the mustard, vinegar and seasoning. Mix well and whisk in the oil.",
    "Put the eggs into a small pan and cover with water. Bring to the boil, then simmer for 3 mins. Cool quickly under running cold water and peel off the shells. Put in a bowl of cold water until ready to serve.",
    "Stir the dill into the dressing and pour it over the lentils. Spoon onto 6 plates, then halve the eggs and put one half on each plate with two slices of smoked salmon. Sprinkle with black pepper, scatter over a few dill fronds and serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6835"
  },
  "name": "Artichoke & wild mushroom pie",
  "ingredients": [
    "3 tbsp olive oil",
    "2 large onions, finely sliced",
    "300g grilled artichoke hearts, halved",
    "300g mixed mushrooms, halved if large",
    "1 garlic clove, crushed",
    "1 tsp fresh thyme leaves",
    "500g pack ready-made shortcrust pastry",
    "1 egg, a pinch of salt and 1 tbsp water, beaten together to glaze",
    "large handful flat leaf parsley leaves, very roughly chopped",
    "142ml carton soured cream, to serve"
  ],
  "category": "vegetarian",
  "image": "https://www.telegraph.co.uk/multimedia/archive/02085/Veg18th_2085779c.jpg?imwidth=680",
  "method": [
    "Heat oven to 200C/fan 180C/gas 6. Heat half the oil in a medium frying pan, then gently fry the onions for 12-15 mins until softened and lightly browned. Tip the onions into a bowl and mix with the artichoke hearts, season if you like and set aside. Heat the remaining oil in the same pan (there’s no need to clean it) over a high-ish heat. Add the mushrooms, then stir-fry for 2-3 mins until soft, throw in the garlic and thyme and continue to cook for a minute. Remove from the heat, season well and allow to cool.",
    "On a floured surface, roll out the pastry into a rough circle about 40cm in diameter and drape over a large baking sheet.",
    "Pile the onions and artichokes into the middle of the pastry and spread them out evenly, leaving a 10cm border around the edge, then pile the mushrooms on top.",
    "Bring the edges of the pastry up over the filling. Brush the exposed pastry edge with the egg glaze. Bake for 20-25 mins until the pastry is crisp and golden brown. Sprinkle with parsley and serve immediately with the sour cream and relish."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6836"
  },
  "name": "Peppers filled with corn, chilli & cheese",
  "ingredients": [
    "4 peppers, any colour, tops removed and deseeded",
    "2 tbsp olive oil",
    "1 red onion, finely chopped",
    "1 tsp ground cumin",
    "1 red chilli, deseeded and finely chopped or 1 tsp cayenne pepper",
    "2 courgettes, diced",
    "175g frozen sweetcorn",
    "1 avocado, diced",
    "50g vegetarian cheddar, grated",
    "2 tbsp chopped fresh coriander"
  ],
  "category": "vegetarian",
  "image": "https://www.savoryonline.com/app/uploads/recipes/179220/corn-stuffed-peppers.jpg",
  "method": [
    "Heat oven to 190C/fan 170C/gas 5. Bring a large pan of water to the boil, then cook the peppers for 5 mins. Remove and drain, cut side down, on some kitchen paper.",
    "Heat 1 tbsp of the oil in a frying pan and cook the onion for 3 mins until tender. Add the cumin and chilli or cayenne pepper and cook for a further 2-3 mins. Add the courgette, then cook for 4 mins until tender.",
    "Remove from the heat, then stir in the sweetcorn, avocado, cheese, coriander and seasoning. Spoon the filling into the peppers, then stand them in a baking dish. Drizzle with remaining oil, then bake for 30-35 mins until the peppers are very soft.",
    "Leave to stand for about 5 mins, then serve warm with soured cream, a chilli bean salad and corn chips."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6837"
  },
  "name": "Vegan tiffin",
  "ingredients": [
    "75g coconut oil, plus extra for the tin",
    "200g vegan dark chocolate(at least 70%), roughly chopped",
    "2 tbsp golden syrup",
    "200g vegan ginger nuts",
    "100g dried cranberries",
    "50g pistachios, toasted and chopped"
  ],
  "category": "dessert",
  "image": "https://nourishingamy.com/wp-content/uploads/2021/05/easy-vegan-chocolate-tiffins-5.jpg",
  "method": [
    "Lightly oil a 20cm square brownie tin with coconut oil and line the base with baking parchment. Melt the chocolate with the coconut oil and golden syrup in the microwave in 30-second bursts until smooth and glossy.",
    "Break the ginger nuts into small pieces in a bowl, then add the dried cranberries and pistachios. Scrape in the chocolate mixture and give everything a good mix to combine, then spoon the tiffin into the tin. Use the back of the spoon to smooth out the top and press it down, then chill in the fridge for 2 hrs or until set hard. Once set, cut into 25 mini squares. Will keep for a week in the fridge."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6838"
  },
  "name": "Chinese roast duck",
  "ingredients": [
    "2 ducks",
    "140g caster sugar",
    "6 star aniseseeds",
    "large piece ginger, sliced",
    "small bunch spring onions, roughly chopped",
    "2 tbsp maltsyrup or maltose (available in most Chinese supermarkets)",
    "3 tbsp red wine vinegar"
  ],
  "category": "dinner",
  "image": "https://cdn.vox-cdn.com/thumbor/ylBacq6miUUf7D1c37Dm-bSrP2Y=/0x163:1950x1138/fit-in/1200x600/cdn.vox-cdn.com/uploads/chorus_asset/file/19537786/shutterstock_11697397.jpg",
  "method": [
    "The day before, soak 4 wooden skewers in water for 20 mins. Wash the ducks inside and out with cold water, drain and pat dry with kitchen paper. Mix together the sugar, star anise, ginger, spring onions and a few good pinches of salt, then use this to fill the cavities. Close the cavities with wooden skewers and set aside.",
    "In a small bowl, mix the maltose and 2 tbsp of the vinegar. Add the remaining vinegar to a jug of boiling water and pour over the ducks. (The boiling water opens up the pores, while the vinegar helps to strip some of the waxiness from the skin, so it will be more receptive to the maltose, which adds sweetness and a lacquered caramel colour.) Smear the maltose mixture over the ducks, then place them in a large plastic container and put in the fridge overnight, uncovered.",
    "To cook, heat oven to 220C/200C fan/ gas 7. (Fan ovens are particularly effective for roasting duck.) Put a little water in the bottom of a large roasting tin, place the ducks on a rack over the top and cover with foil. Roast for about 45 mins. Take off the foil and roast for another 45 mins – the duck must be well done, there is no such thing as a rare Chinese roast duck! Take the duck out of the oven and let it rest for a good 20 mins before carving."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6839"
  },
  "name": "Parsnip gnocchi",
  "ingredients": [
    "400g parsnip, peeled and cut into chunks",
    "600g potatoes, peeled and cut into chunks",
    "60ml olive oil, plus a drizzle to serve",
    "3 unpeeled garlic cloves",
    "1 tsp ground nutmeg(around 1 clove)",
    "100g ‘00’ flour",
    "2 tbsp nutritional yeast",
    "½ small pack thyme, leaves picked, to serve",
    "30g walnuts, toasted and chopped, to serve"
  ],
  "category": "side",
  "image": "https://www.naturopathy-uk.com/wp-content/uploads/2019/04/RECIPE-Parsnip-gnocchi.jpg",
  "method": [
    "Heat oven to 220C/200C fan/gas 7. Toss the parsnips and potatoes in 2 tbsp of the olive oil and tip into a roasting tin along with the garlic cloves. Roast for 40 mins or until the veg is completely soft. Remove from the oven and leave to cool a little. Squeeze the garlic from their skins, then discard the skins. Tip everything into a ",
    ", along with the nutmeg, flour and nutritional yeast, season well, then pulse until well combined and holding together as a dough.",
    "Bring a large pan of salted water to the boil. Tip the dough onto a floured surface, cut into four chunks and roll each into a sausage about 35cm long and 2.5cm wide. Use the back of a table knife to cut each sausage into small pillow-shaped gnocchi, each around 2cm long. Cook the gnocchi in batches for 1 min or until they float to the surface. Remove from the water with a slotted spoon and drain on kitchen paper.",
    "In a frying pan, heat the rest of the oil over a medium heat until shimmering. Add half the gnocchi and fry until lightly golden on each side, around 3-4 mins. Transfer them to a tray using a slotted spoon while you cook the second batch. When all the gnocchi are golden, return them all to the pan to warm through before dividing between four plates. Sprinkle over some black pepper, then top with the thyme leaves, toasted walnuts and a drizzle of olive oil, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf683a"
  },
  "name": "Madeira gravy",
  "ingredients": [
    "200ml madeira",
    "3 tbsp plain flour",
    "600ml turkey or chicken stock, fresh or made with cubes",
    "2 tbsp wholegrain mustard",
    "200ml/7fl oz turkeyjuices, skimmed of all fat (make up with stock if you don't have enough; add it all if you have more)"
  ],
  "category": "side",
  "image": "https://www.oryana.coop/wp-content/uploads/2019/11/gravy-boat-1024x683.jpg",
  "method": [
    "Gradually mix the Madeira into the flour until smooth. Heat the stock in a pan, then pour in the flour mixture and mustard, stirring until thickened. Chill until ready to serve, covering the surface with cling film to stop a skin forming. On the day, reheat in a pan with the turkey juices until bubbling."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf683b"
  },
  "name": "Turkey tonnato salad",
  "ingredients": [
    "100g mayonnaise(an olive oil one works best)",
    "1 tbsp capers, drained",
    "2 anchoviesfrom a can, 1 cut into thin slices",
    "80g tunain oil (a good-quality one will make all the difference here), drained",
    "juice ½ lemon",
    "400g/14oz or thereabouts leftover turkey- white and/or brown meat",
    "100g bag rocket"
  ],
  "category": "lunch",
  "image": "https://images.eatsmarter.com/sites/default/files/styles/1600x1200/public/turkey-breast-with-tuna-sauce-turkey-tonnato-560252.jpg",
  "method": [
    "Put the mayo, most of the capers, 1 whole anchovy, the tuna and most of the lemon juice into a food processor. Whizz until the tuna is completely mixed into the mayo. Season with pepper first, then taste, and add salt and more lemon juice, if you need to. If your sauce seems a bit thick, whizz in a drop of water. Can be made up to a day ahead.",
    "Spread the turkey and rocket over a large serving plate, then spoon over the dressing and scatter with the remaining capers and sliced anchovy. Serve straight away with crusty bread."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf683c"
  },
  "name": "Chicken liver & mushroom nests",
  "ingredients": [
    "3 tbsp sunflower oil",
    "3 onions, finely chopped",
    "250g pack chestnut mushroom, chopped",
    "1 garlic clove, crushed",
    "400g pack chicken liver, trimmed of any sinewy bits",
    "3 tbsp brandy",
    "140g white breadcrumb",
    "bunch flatleaf parsley, chopped",
    "handful walnuts, chopped",
    "12 smoked, dry-cured streaky bacon rashers"
  ],
  "category": "appetizer",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/livermushroom73-f6674b2-scaled.jpg?quality=90&fit=700,700",
  "method": [
    "Heat oven to 190C/170C fan/gas 5. Heat the oil in a large frying pan, then soften the onions for 10 mins with the pan covered. Turn up the heat, add the mushrooms and fry for about 10 mins until golden and all their liquid has evaporated. Stir in the garlic and cook for 1 min more. Tip everything onto a plate.",
    "Pat the livers dry, then add a little more oil to the pan. Sizzle in batches for about 20 secs on each side until just golden but not cooked through. Set aside on a plate as you go. Tip in the brandy and let it reduce to 1 tbsp. Roughly chop the livers once cooled, then mix with the oniony mushrooms, brandy, bread and almost all the parsley and nuts.",
    "To cook, wind bacon rashers into the wells of a 12-hole bun tin, like little nests. Spoon in the stuffing (reserving 250g for your turkey), scatter with remaining nuts, then bake, covered with foil, for 20 mins. Uncover and cook for 25 mins more until the bacon is gold. Scatter with remaining chopped parsley to serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf683d"
  },
  "name": "Cranberry & chestnut falafel",
  "ingredients": [
    "1 sweet potato, peeled and cut into big chunks",
    "400g can chickpea, drained",
    "200g ready-cooked vacuum-packed chestnut",
    "1 large egg",
    "½ tsp chilli flakes",
    "2 tsp cumin seed",
    "1 garlic clove",
    "small pack coriander, roughly chopped, plus a little more to serve",
    "85g cranberry, defrosted if frozen and halved if you have time",
    "4 tbsp vegetable or sunflower oil",
    "150g pot creamy Greek-style yogurt, to serve"
  ],
  "category": "vegetarian",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/falafel-fa36e79.jpg?quality=90&resize=440,400",
  "method": [
    "Put the sweet potato into a microwave-proof bowl, add 1 tsp water and cook on High for 2 mins. Mash in a large bowl.",
    "Put the chickpeas and chestnuts into a food processor and pulse until well chopped but not pasty. Tip on top of the sweet potato, then add the egg, spices, garlic and coriander. Season generously and mix well with your hands. Add the cranberries. Shape dessertspoon-sized balls of the mix into 20 or so patties. Can be made ahead and chilled for up to 3 days.",
    "Heat 2 tbsp oil in a large non-stick frying pan. Fry half of the falafels for 2 mins on each side until golden. Lift onto kitchen paper to drain. Repeat with the second batch. Can be made up to 2 days ahead and reheated. Let the falafel cool for a few mins before serving with the yogurt, plus a scattering of coriander."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf683e"
  },
  "name": "Lemon meringue cupcakes",
  "ingredients": [
    "200g caster sugar",
    "100g softened butter",
    "2 eggs, plus 2 egg whites",
    "zest 2 lemons, plus 2-3 tbsp lemon juice",
    "100g self-raising flour",
    "4 tbsp lemon curd"
  ],
  "category": "dessert",
  "image": "https://glutenfreecuppatea.co.uk/wp-content/uploads/2020/11/gluten-free-lemon-meringue-cupcake-recipe-featured1.jpg",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Beat half the sugar and all the butter until pale, then add whole eggs, one by one, beating in well each time. Stir in the zest and a squeeze of lemon juice, then fold in flour. Check the batter’s consistency; it should softly drop off the end of a spoon. Add more lemon juice if it’s a bit stiff.",
    "Line a 12-hole bun tin with cake cases and put 1 large tbsp mix in each. Smooth then make a little dip in the centre. Spoon 1 tsp lemon curd into each dip and cover with 1 tbsp cake mix. Bake for 10 mins.",
    "Meanwhile, place the egg whites into a clean bowl, whisk until stiff peaks form, then whisk in the rest of the sugar a tbsp at a time. Keep whisking until the mixture looks glossy and has thickened a little, like shaving foam. Spoon the mixture into a freezer bag and snip off the end to leave a hole with a 1.5cm diameter.",
    "Take the cakes out of the oven – tops should be very pale and just firm – then pipe meringue all over the cakes. Return to the oven for 10-15 mins until the cakes are cooked through and meringue lightly browned. Can be made 1 day ahead."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf683f"
  },
  "name": "Beetroot & red onion tarte tatin",
  "ingredients": [
    "400g beetroot, cut into wedges",
    "1 red onion, cut into wedges",
    "3 tbsp olive oil",
    "2 tbsp rice wine vinegar",
    "2 tbsp soft brown sugar",
    "2 star anise",
    "flour, for rolling",
    "500g block puff pastry(we used vegan Jus-Rol)",
    "1 orange, zested",
    "peppery green salad, to serve"
  ],
  "category": "vegetarian",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/beetroot-star-anise-red-onion-tart-tatin-6617a3f.jpg?resize=440%2C230",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. In a bowl, toss the beetroot and onion in 2 tbsp of the oil, the vinegar and sugar. Add the star anise and season well. Heat the rest of the oil in a large, ovenproof ",
    ", then nestle in the veg so that they cover the surface of the pan. Cover with foil and cook in the oven for 45 mins.",
    "On a well-floured surface, roll the pastry to a thickness of 0.5cm and cut out a circle the same size as your frying pan. Carefully take the pan out of the oven, remove the foil and wiggle the beets and onion around in the pan to make a compact layer. Put the pastry on top, tucking it in all around the edges, then return the pan to the oven and bake for 35 mins or until the pastry has puffed up and is a deep golden brown.",
    "Slide a palate knife around the edge of the tart, then put a plate on top of the pastry, serving side down. Flip the pan over to turn the tart out onto the plate – be careful not to burn yourself with the handle. Top with the orange zest and a sprinkle of sea salt, then serve with a peppery salad on the side."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6840"
  },
  "name": "Cheese straws",
  "ingredients": [
    "350g pack ready-rolled puff pastry",
    "four handfuls grated parmesan(or vegetarian alternative)",
    "handful flour, to roll pastry on"
  ],
  "category": "appetizer",
  "image": "https://realfood.tesco.com/media/images/RFO-Hero-636x418-CheeseStraws-54c1d8ff-a7b0-4094-a013-689f0f97a5bc-0-636x418.jpg",
  "method": [
    "heat oven to 220c/fan 200c/gas 7. Unroll a puff pastry, scatter over a couple of handfuls of grated Parmesan, then fold in half. On a lightly floured surface, roll out to the thickness of a £1 coin. Cut into 1cm strips, then twist the strips 3-4 times. Lay on a baking sheet, scatter over more cheese and bake for 12 mins, or until golden. Leave to cool, then keep in an airtight container for up to 2 days. As these cheese straws are very delicate, roll them in kitchen paper before packing into a plastic container."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6841"
  },
  "name": "Hazelnut brownies",
  "ingredients": [
    "box of 16 Ferrero Rocherchocolates",
    "250g pack salted butter, plus extra for greasing",
    "250g golden caster sugar",
    "225g light muscovado sugar",
    "100g cocoa powder",
    "4 large eggs",
    "100g self-raising flour",
    "85g ready-chopped hazelnuts",
    "4 tbsp Frangelicoor Fratello hazelnut liqueur (or Disaronno)"
  ],
  "category": "dessert",
  "image": "https://www.dixiecrystals.com/sites/default/files/recipe/Nutella-Hazelnut-Brownies-imperial.jpg",
  "method": [
    "Unwrap the chocolates, place on a tray and pop in the freezer. Heat oven to 180C/160C fan/gas 4. Lightly grease and line the base and sides of a 21-22cm square tin with baking parchment.",
    "Put the butter, sugars and cocoa into your largest saucepan and gently melt together, stirring regularly so the mixture doesn’t catch. Once the sugar granules have just about disappeared, take off the heat, tip into a bowl and leave to cool for 5 mins.",
    "Use a whisk or wooden spoon to beat the eggs, one by one, into the mixture. When they’re completely incorporated and the mixture is smooth and shiny, stir in the flour, hazelnuts and liqueur. Tip the mixture into the prepared tin and bake for 35 mins.",
    "Remove the tin from the oven and use a cutlery knife to mark the top of the brownies into 16 squares (don’t cut through, it’s just as a guide). Use a teaspoon to push a little dent in the centre of each portion and add a frozen Ferrero Rocher chocolate into each dip. Return to the oven for 3 mins, then remove and leave to cool completely.",
    "Once cool, cut into 16 squares. Will keep for 3 days in an airtight container."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6842"
  },
  "name": "Chocolate profiteroles & salted caramel",
  "ingredients": [
    "75g plain flour",
    "2 tbsp cocoa powder",
    "85g slightly salted butter, chopped into small pieces",
    "3 medium eggs, beaten",
    "½ x 397g can caramel(we used Carnation)",
    "½ -1 tsp sea saltflakes",
    "300ml pot double or whipping cream",
    "100g white chocolate, finely chopped",
    "50g dark chocolate, finely chopped",
    "chocolate sprinklesor edible glitter (optional)"
  ],
  "category": "dessert",
  "image": "https://thehappyfoodie.co.uk/wp-content/uploads/2021/08/16_s900x0_c2417x1411_l0x828.jpg",
  "method": [
    "Sieve the flour and cocoa into a bowl. Put the butter in a saucepan and add 225ml water. Bring to a fast boil, then simmer until the butter has melted. Tip in the flour mixture and quickly beat with a wooden spoon until the mixture comes together to a smooth, shiny dough, and pulls away from the sides of the pan. Tip the dough into a bowl and spread it up the sides with your spoon to help it to cool down quickly (but don’t let it cool completely – it’s easier to incorporate the eggs while it’s still warm). Heat oven to 200C/180C fan/ gas 6 and line 2 baking sheets with baking parchment.",
    "While the dough is still warm, add the eggs a little at a time, beating well with a wooden spoon between each addition. You’re looking for a smooth consistency, that reluctantly falls off the spoon in a V shape (you may not need to use all the egg). If the mixture becomes too runny, you won’t be able to pipe it; if it’s too thick, it won’t puff up in the oven. When you’re happy with the consistency, spoon it into a disposable piping bag.",
    "Snip off the end of the piping bag to give you a 1cm opening. Holding the bag at a 90-degree angle to the baking tray, pipe balls of the dough, about the size of a walnut, over the 2 sheets – you should make 18-20 in total. Dip your finger in a little water and gently pat down any peaks on the top of the balls of dough. Place the 2 sheets in the oven and bake for 25-30 mins, swapping the trays over after 20 mins. The choux buns should be puffed up and crisp when cooked. Leave to cool completely.",
    "Spoon the caramel into a large bowl, add 1/2 tsp salt, mix well and taste – add a little more salt if you like. Add the cream and whisk until holding soft peaks (the cream can now be stored in the fridge for up to 1 day).",
    "Split the choux buns in half, spoon a generous dollop of salted caramel cream into each and replace the lids. Melt the white and dark chocolates in 2 bowls suspended over pans of gently simmering water, or in the microwave. Transfer the dark chocolate to a piping bag and set aside to cool a little. Top each bun with a spoonful of white chocolate, stack the profiteroles on a plate or cake stand, then drizzle over the dark chocolate and sprinkle with chocolate sprinkles or edible glitter, if you like. Serve straight away."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6843"
  },
  "name": "Hazelnut & Baileys meringue cake",
  "ingredients": [
    "sunflower oil, for greasing",
    "150g toasted hazelnuts",
    "5 egg whites",
    "280g golden caster sugar",
    "1 tbsp white wine vinegar",
    "300ml pot double cream",
    "2 tbsp icing sugar, plus extra for dusting",
    "3 tbsp Baileyscream liqueur (optional)",
    "200g pack fresh raspberries"
  ],
  "category": "dessert",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2023/07/Hazelnut-baileys-meringue-cake-bb10a69.jpg?quality=90&fit=700,466",
  "method": [
    "Heat oven to 190C/170C fan/gas 5. Line 2 x 20cm sandwich tins with foil, then lightly oil the foil. Whizz the nuts in a processor until finely ground.",
    "Whisk the egg whites in a bowl until they form stiff peaks. Whisk in most of the sugar, a spoonful at a time, until the mixture is stiff and glossy. Stir the rest of the sugar into the nuts, then fold into the meringue with the vinegar. Divide between the tins and level the tops.",
    "Bake for 40-45 mins until firm, then cool in the oven. When the meringues are cold, carefully peel off the foil.",
    "To serve, whisk the cream, icing sugar and Baileys together until softly stiff. Put one of the meringues, top-side down, on a plate, then spread with the cream and scatter over the raspberries. Put the other meringue layer on top and dust generously with icing sugar."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6844"
  },
  "name": "Creamed leek tart",
  "ingredients": [
    "300g plain flour, plus extra for dusting",
    "140g unsalted butter, cut into small pieces, plus extra for greasing",
    "1 medium egg",
    "4 tbsp iced water",
    "85g unsalted butter",
    "800g leek, sliced lengthways then into 2½ cm/1in pieces",
    "½ tbsp plain flour",
    "300ml milk",
    "200ml double cream",
    "2 medium eggs",
    "4 medium egg yolks, beaten together with the other eggs",
    "100g gruyère, grated",
    "1 tsp English mustard"
  ],
  "category": "breakfast",
  "image": "https://www.greedygourmet.com/wp-content/uploads/2007/11/leek-tart-slice-720x480.jpg",
  "method": [
    "Pulse the flour and butter in a food processor until you have fine crumbs. Add the egg yolk and water, and bring together into a ball. Do not knead. Roll the pastry in cling film and chill for at least 1 hr.",
    "Meanwhile, heat the butter in a pan, then add the leeks. Cook over a low heat for 20-25 mins until soft, stirring often. Season to taste. Stir in the flour, cook for 3-4 mins, stirring, then stir in the milk and cream. Once smooth, simmer for 15 mins to cook out the flour. Season well, then cool. If making ahead, cover the surface with cling film and chill for up to 2 days. Stir the eggs and egg yolks into the mix, along with the grated cheese and the mustard.",
    "Heat oven to 190C/170C fan/gas 5. Roll out the pastry on a floured surface to about 5mm/¼in thick, and gently lay it over a 23cm loose-bottomed tart tin. Using a small ball of pastry to help, gently press the pastry into the sides of the tin. Trim, leaving a slight overhang. Line the pastry with baking paper, fill with baking beans, then bake for 15 mins. Remove the beans and paper, and bake for 10 mins more or until golden and biscuity. Cool on a wire rack. Turn oven down to 180C/160C fan/gas 4.",
    "Spoon the leek mix into the case and smooth the top. Bake for 30 mins until set and golden. Rest the tart for 15-20 mins before you slice it, and serve warm. If making ahead, chill the tart. Once cooled, for up to 2 days, or freeze for a week. Defrost in fridge, then warm in the oven for 20 mins before serving."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6845"
  },
  "name": "Smoked salmon terrine",
  "ingredients": [
    "600g smoked salmonslices",
    "600g cream cheese",
    "150ml double cream",
    "zest and juice 1 lemon, thin wedges to serve",
    "1 tbsp very finely chopped dill, plus a few fronds to serve",
    "2 tbsp finely snipped chive",
    "a little oil, for greasing",
    "melba toastor toasted soda bread, to serve"
  ],
  "category": "lunch",
  "image": "https://www.sainsburysmagazine.co.uk/uploads/media/2400x1800/05/13165-Gleneagles-Terrine.jpg?v=1-0",
  "method": [
    "Grease a loaf tin, a 900g/2lb one is ideal but you can use one slightly smaller or bigger. Line with cling film, then cover just the base with one layer of smoked salmon slices, trimmed to fit neatly.",
    "Whizz the cream cheese, cream, lemon zest and juice together in a food processor to combine. Scrape out and stir in the dill and chives with some seasoning. Spread an 8th of the cream cheese mixture over as evenly as you can. Top with a layer of salmon slices. Repeat with the cream cheese and salmon - you should be able to do 7 layers of cream cheese (By starting with just an 8th of the mixture, it means as the tin widens you'll have enough to put a bit more as you go further up creating even layers.) Finish with a last layer of salmon (and treat yourself to a smoked salmon sarnie with any trimmings!) Cover with cling film, pressing down gently, then chill overnight.",
    "To serve, turn onto a platter and gently peel off the cling film. Scatter with a few dill fronds and serve with lemon wedges and toast."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6846"
  },
  "name": "Turkey curry",
  "ingredients": [
    "1 tbsp sunflower oil",
    "1 large onion, thickly sliced",
    "1 green pepper, deseeded and chopped",
    "2 tbsp curry paste(or gluten-free alternative)",
    "2 garlic cloves, crushed",
    "400g can chopped tomato",
    "300g leftover turkey, diced",
    "300g leftover cooked potato(either boiled or roast), diced",
    "2 tbsp mango chutney",
    "small pack coriander, roughly chopped",
    "rice or naan bread, to serve"
  ],
  "category": "dinner",
  "image": "https://www.foodandwine.com/thmb/faAIM-3gCuQPRsv4GHYnWJ_g5mo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/turkey-curry-FT-RECIPE0521-6902c59d365c4d778ecb0e8904cf3161.jpg",
  "method": [
    "Heat the oil in a large pan over a fairly high heat. Cook the onion and pepper for 3-4 mins until starting to soften and brown slightly. Stir in the curry paste and garlic, then cook for another 1-2 mins. Add the chopped tomatoes and 150ml water. Bring to the boil and bubble for 5 mins.",
    "Turn the heat down, stir in the turkey and potatoes, and cook for another 2-3 mins, then season and add the mango chutney. Scatter with coriander and serve with rice or naan."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6847"
  },
  "name": "Red wine gravy",
  "ingredients": [
    "200ml red wine (we used Merlot)",
    "3 tbsp cornflour",
    "600ml turkey or chicken stock, made with cubes or freshly made",
    "2 tbsp redcurrant jelly",
    "200ml/7fl oz turkey juices, skimmed of all fat (make up with stock if you don't have enough)"
  ],
  "category": "side",
  "image": "https://food-images.files.bbci.co.uk/food/recipes/red_wine_gravy_75820_16x9.jpg",
  "method": [
    "Mix 3 tbsp red wine with the cornflour until smooth, then mix in all the wine. Heat stock in a pan, then pour in the red wine mixture and redcurrant jelly, stirring until thickened. Cover the surface with cling film to stop a skin forming. Chill for up to 2 days. To serve, reheat in a pan until bubbling, then stir in the turkey juices and transfer to a warm gravy boat."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6848"
  },
  "name": "Turkey cacciatore",
  "ingredients": [
    "2 small or 1 large onion, chopped",
    "2 garlic cloves, crushed",
    "3 tbsp olive oil",
    "2 tsp dried oregano",
    "3 x cans chopped tomatoesor cherry tomatoes",
    "1 tbsp sugar",
    "little splash vinegar",
    "about 500g leftover turkey, shredded into chunks",
    "1 x 125g balls mozzarella",
    "2 good handfuls fresh breadcrumbs"
  ],
  "category": "dinner",
  "image": "https://img.hellofresh.com/f_auto,fl_lossy,h_640,q_auto,w_1200/hellofresh_s3/image/turkey-cacciatore-rigatoni-1c80ffd8.jpg",
  "method": [
    "Fry the onion and garlic in the oil until softened. Add the tomatoes and sugar, a little splash of vinegar and some seasoning, then simmer for 20 mins until really thick. Stir in the turkey and transfer to a baking dish. Heat oven to 220C/200C fan/gas 7.",
    "Tear over the mozzarella in chunks, then scatter over the breadcrumbs with a bit more ground pepper. Bake for 20 mins until turkey is piping hot through, and the top is golden and bubbling. Eat with mash, jackets, rice or pasta"
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf684a"
  },
  "name": "Reindeer cake pops",
  "ingredients": [
    "150g chocolate cake",
    "25g soft butter",
    "50g icing sugar",
    "25g plain chocolate",
    "100g milk chocolate",
    "small pretzels, broken into large 'antler' shape pieces",
    "8 small jelly sweets, red chocolatebeans or Smarties",
    "2 tbsp royal icingcoloured black or purchased black writing icing",
    "8 cake pop sticksand a polystyrene block to stand up the cake pops",
    ""
  ],
  "category": "dessert",
  "image": "https://i2.wp.com/thehousewifemodern.com/wp-content/uploads/2014/12/LR_Reideer-Cake-Pops.jpg",
  "method": [
    "Crumble the cake into fine crumbs using your hands or in a food processor. Put into a bowl. In another bowl, beat together the butter and icing sugar until creamy.",
    "Melt the plain chocolate in the microwave or in a bowl over a pan of barely simmering water. Add the melted chocolate to the butter mixture and combine well. Add this to the cake crumbs and mix thoroughly using your hands, until it sticks together. Divide the mixture into eight and shape each one into a smooth ball. Insert a cake pop stick, place on a tray lined with baking parchment and chill for at least 2 hours.",
    "Melt the milk chocolate in the microwave or in a bowl over a pan of barely simmering water. Take a cake pop and dip in the chocolate. Shake gently until the excess has drained off. Push into a polystyrene block.",
    "Make two holes in the top of the head and insert a pretzel 'antler' in each one. Press a sweetie nose onto the front and hold for a few seconds until attached. Repeat with all the other cake pops. Leave to set for about 20 mins and then using black icing, pipe on eyes and a mouth."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf684b"
  },
  "name": "Jamaican ginger & pineapple cake",
  "ingredients": [
    "225ml vegetable oil, plus extra for greasing",
    "75ml full-fat milk",
    "3 tbsp molasses",
    "375g plain flour",
    "1 tbsp baking powder",
    "1 tsp bicarbonate of soda",
    "300g dark muscovado sugar",
    "1 ½ tsp ground ginger",
    "1 tsp ground cinnamon",
    "½ tsp ground allspice",
    "300ml buttermilk",
    "100ml ginger beer(we used Old Jamaica)",
    "3 large eggs",
    "227g can pineapple ringsin juice, drained and chopped into small chunks (reserve the juice for the glaze)",
    "4 tbsp liquid molasses",
    "200g icing sugar",
    "pineapple juice(from above)",
    "5 rings of dried or glacé pineapple",
    "crystallised ginger, to decorate"
  ],
  "category": "dessert",
  "image": "https://img.delicious.com.au/OA2ufzC1/w759-h506-cfill/del/2016/12/jamie-olivers-gingerbread-cake-with-tipsy-pineapple-40319-2.jpg",
  "method": [
    "Heat oven to 180C/160C fan/gas 4 and brush with oil the inside of a 2.4 -litre non-stick bundt tin. Make sure you get into any corners to ensure the cake doesn’t stick. Pour the milk and molasses into a pan and heat gently, whisking until the molasses has melted, then set aside to cool a little. Combine the flour, baking powder, bicarb, sugar, spices and 1/2 tsp salt in a large bowl. Shake the bowl a few times so any lumps of sugar come to the surface and squeeze through your fingers.",
    "In a jug, mix the oil, buttermilk, ginger beer and eggs. Add the cooled molasses mixture and whisk again, then pour into the dry ingredients, along with the chopped pineapple. Stir everything to combine, then scrape into the tin. Bake for 1 hr until a skewer inserted into the centre comes out clean. If not, return to the oven for another 10 mins and check again. Leave to cool in the tin for 15 mins, then very carefully turn out onto a wire rack.",
    "For the glaze, combine the molasses, icing sugar and pineapple juice in a saucepan and set over a low heat. Whisk until smooth and glossy, then brush generously all over the cooling cake, allowing it to soak in. To serve, top with the glacé pineapple ( hold in place with halved cocktail sticks, if you like), and crystallised ginger. Will keep well in an airtight container for five days."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf684c"
  },
  "name": "Pigs in blankets",
  "ingredients": [
    "8 rasherssmoked streaky bacon",
    "16 chipolatas"
  ],
  "category": "appetizer",
  "image": "https://img.taste.com.au/dTQA9cCI/taste/2016/11/pigs-in-blankets-118438-2.jpeg",
  "method": [
    "Heat oven to 190C/170C fan/gas 5. Cut the bacon rashers in half. Wrap a piece of bacon around each of the chipolatas.",
    "Place on a baking tray and cook for 30-35 mins until golden."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf684d"
  },
  "name": "Celeriac, hazelnut & truffle soup",
  "ingredients": [
    "1 tbsp olive oil",
    "small bunch thyme",
    "2 bay leaves",
    "1 onion, chopped",
    "1 fat garlic clove, chopped",
    "1 celeriac(about 1kg), peeled and chopped",
    "1 potato(about 200g), chopped",
    "1l veg stock(check the label to ensure it’s vegan – we used Marigold)",
    "100ml soya cream",
    "50g blanched hazelnuts, toasted and roughly chopped",
    "1 tbsp truffle oil, plus an extra drizzle to serve"
  ],
  "category": "lunch",
  "image": "https://www.saveur.com/uploads/2019/12/18/DNLWMXWCMNCY5OHNBHJ2W4VD6I.jpg?auto=webp&auto=webp&optimize=high&quality=70&width=1440",
  "method": [
    "In a large saucepan, heat the oil over a low heat. Tie the thyme sprigs and bay leaves together with a piece of string and add them to the pan with the onion and a pinch of salt. Cook for about 10 mins until softened but not coloured.",
    "Stir in the garlic and cook for 1 min more, then tip in the celeriac and potato. Give everything a good stir and season with a big pinch of salt and white pepper. Pour in the stock, bring to the boil, then simmer for around 30 mins until the vegetables are completely soft.",
    "Discard the herbs, then stir through the cream, remove from the heat and blitz until completely smooth. Stir through 1/2 tbsp truffle oil at a time and taste for seasoning – the strength of the oil will vary, so it’s better to start with less oil and add a little at a time.",
    "To serve, reheat the soup until piping hot, then ladle into bowls and top with the hazelnuts, some black pepper and an extra drizzle of truffle oil."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf684e"
  },
  "name": "Spiced apple cheesecake",
  "ingredients": [
    "100g butter, melted, plus extra for tin",
    "250g ginger nuts",
    "100g stem gingerin syrup, drained and chopped",
    "1 tsp ground cinnamon",
    "1 tsp ground ginger",
    "600g cream cheese",
    "300g ricotta, drained",
    "seeds of 1 vanilla pod",
    "120g golden caster sugar",
    "1 lemon, zested",
    "1 tsp ground cinnamon",
    "1 tsp ground ginger",
    "1 tsp mixed spice",
    "3 Granny Smith apples, peeled and cored",
    "200g golden caster sugar",
    "50ml brandy"
  ],
  "category": "dessert",
  "image": "https://www.dominosugar.com/sites/dominosugar_com/files/styles/m/public/2022-08/Web_Recipe_Description_Image-Apple%20Cheesecake%207.jpg.webp?itok=9o_ixWFM",
  "method": [
    "Butter and line the base of a 23cm loose-bottomed cake tin. Whizz the biscuits to a rough crumb in a ",
    ", or put them in a sandwich bag and crush with a ",
    ". Tip the crumbs into a bowl with the melted butter, stem ginger and spices, and stir well. Press the mixture into the tin, pushing up the sides a little (putting your hand in a food bag makes this easier). Leave the base to set for 30 mins in the fridge.",
    "For the cheese layer, whisk all the ingredients together until smooth, then pour over the base. Chill in the fridge overnight.",
    "The next day, make the topping. Mix the cinnamon, ginger and mixed spice in a large bowl. Cut each apple into 12 wedges, then toss the wedges in the spice mixture. Heat the sugar and 4 tbsp water in a saucepan and bubble to a caramel. As soon as the sugar becomes a dark caramel, take off the heat and carefully toss through the apples. Pour in the brandy, and the whole lot will bubble and seize. Return the pan to the heat and simmer gently to re-dissolve the caramel and cook the apples in the syrup. Remove from the heat and set the apples aside to cool in the syrup.",
    "Ease the cheesecake out of the tin. Spoon the apples over the top with a slotted spoon. Serve the sticky brandy syrup on the side as a sauce."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf684f"
  },
  "name": "Fruitcake",
  "ingredients": [
    "175ml olive oil, plus extra for greasing",
    "100g light brown muscovado sugar",
    "2 eggs, beaten",
    "225g plain flour",
    "1 tsp baking powder",
    "1 tsp ground cinnamon",
    "½ tsp allspice",
    "½ orange, juiced",
    "½ lemon, juiced",
    "200g mixed dried fruit",
    "200g apricot jam",
    "icing sugar, for dusting"
  ],
  "category": "dessert",
  "image": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/12/christmas-fruitcake.jpg?quality=82&strip=1",
  "method": [
    "Heat oven to 160C/140C fan/ gas 3. Grease and line the base of two 20cm springform cake tins with baking parchment.",
    "Stir together the oil and sugar, add the eggs, flour, baking powder, spices and juices, and mix thoroughly with a wooden spoon until pourable and reasonably runny. Gently fold in the fruit, then divide the batter evenly between the tins. Bake for 20-25 mins or until a skewer inserted in the centre comes out clean, then leave to cool.",
    "When cool, remove from the tins and sandwich the cakes together with jam. Sieve some icing sugar on top to serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6851"
  },
  "name": "Turkey noodle soup",
  "ingredients": [
    "1.2l low-sodium chicken stock",
    "4 small carrots, peeled and chopped",
    "140g medium egg noodles",
    "200g/7oz shredded, cooked turkeyor chicken",
    "200g frozen peas",
    "1 bunch spring onions, sliced, white and green parts separated"
  ],
  "category": "lunch",
  "image": "https://www.smalltownwoman.com/wp-content/uploads/2021/12/Turkey-Noodle-Soup-Recipe-Card-1.jpg",
  "method": [
    "Bring the stock to the boil and throw in the carrots. Boil for 4 mins, then add the noodles and simmer for 3 mins. Stir in the turkey, peas and the white part of the spring onions, heat for 1 min or until everything is hot through. Ladle into bowls, scatter with the green part of the onions to serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6853"
  },
  "name": "Risotto with duck & mushrooms",
  "ingredients": [
    "2 tbsp butter",
    "1 onion, finely chopped",
    "2 carrots, finely chopped",
    "2 celerysticks, finely chopped",
    "3 garlic cloves, crushed",
    "thymesprig, leaves picked",
    "300g risotto rice",
    "300ml red wine",
    "1.4l chicken stock, hot",
    "about 175g leftover duck, shredded",
    "200g pack chestnut mushroom, thickly sliced",
    "handful flat-leaf parsley, chopped"
  ],
  "category": "dinner",
  "image": "https://images.squarespace-cdn.com/content/v1/5e3b571c57c3897ac7789b45/1617942930871-4SVLS9MBAAK3NR8I79XW/2021_AB_DuckBreast_MushroomRisotto_Website-1.jpg",
  "method": [
    "Heat 1 tbsp butter in a wide saucepan, then add the onion, carrots and celery. Cover, then gently cook for 10 mins until soft. Tip in two-thirds of the garlic, fry for 1 min, turn up the heat, then add the thyme and rice. Stir for a few mins, then add the wine and let it reduce to almost nothing.",
    "Stir in the stock over a medium heat, ladle by ladle, waiting for each addition to absorb before adding the next. Keep the heat on medium – too hot and the stock will evaporate rather than be absorbed by the rice. When the rice is creamy and justcooked, take off the heat, add the duck, then cover for 5 mins to heat through.",
    "Melt the remaining butter in another wide pan, add the mushrooms, then fry them on a high heat for about 3 mins until golden. Add the remaining garlic, fry for 1 min more, then season. Stir the mushrooms into the risotto, then scatter with parsley and serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6854"
  },
  "name": "Cauliflower cakes & green yogurt sauce",
  "ingredients": [
    "1 small cauliflower(600g), trimmed and finely chopped",
    "1 garlic clove, crushed",
    "4 spring onions, finely sliced",
    "1 red chilli, deseeded and chopped",
    "75g parmesan(or vegetarian alternative), grated",
    "1 lemon, zested (save the juice for the sauce)",
    "150g fresh brown breadcrumbs, toasted",
    "4 tbsp plain flour",
    "1 egg, beaten",
    "olive oilspray, for baking",
    "rocketsalad, to serve",
    "1 anchovy, rinsed and finely chopped",
    "3 tbsp low-fat mayonnaise",
    "200g Greek yogurt",
    "½ small pack flat-leaf parsley",
    "2 tsp Worcestershire sauce",
    "lemon juice(from above)"
  ],
  "category": "appetizer",
  "image": "https://www.babaganosh.org/wp-content/uploads/2015/08/cauliflower-fritters-6.jpg.webp",
  "method": [
    "Heat oven to 220C/200C fan/gas 7. Boil the cauliflower in salted water for 5 mins until soft. Drain, put back in the pan to steam off the excess water, then tip into a bowl to cool. Add the garlic, spring onions, chilli, parmesan, lemon zest, 50g of the toasted breadcrumbs, the flour, egg, and some seasoning. Shape into 16 cakes, then roll in the remaining breadcrumbs. Put on a plate and chill for at least 1 hr, or overnight, before cooking.",
    "To make the sauce, put all the ingredients in a food processor or blender. Add some seasoning and blend until smooth. Pour into a serving bowl and set aside. Can be made a day ahead.",
    "Liberally spray a large baking sheet with the oil. Put the cauliflower cakes on top and spray well again. Bake for 25 mins until golden and crisp. Serve with the sauce and some rocket salad."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6855"
  },
  "name": "Caramelised apple & walnut strudel",
  "ingredients": [
    "100g golden granulated sugar, plus extra",
    "seeds scraped from 1 vanilla pod",
    "4 Granny Smithapples, peeled and diced",
    "25g each currantand sultanas",
    "1 tsp ground allspice",
    "tsp ground nutmeg",
    "85g walnut, chopped",
    "6 large sheets filo pastry",
    "50g butter, melted",
    "200ml tub crème fraîche"
  ],
  "category": "dessert",
  "image": "https://www.heinens.com/wp-content/uploads/2021/08/800x550_Apple-Strudel-10.jpg",
  "method": [
    "Heat oven to 200C/fan 180C/gas 6. Heat 75g of the sugar and the vanilla seeds in a medium, heavy-based frying pan over a medium-low heat for 5-8 mins, or until golden brown and caramelised. Add the apples, currants, sultanas, allspice, nutmeg and walnuts, then cook for 10 mins or until the apple is tender. Remove the apple mix from the pan with a slotted spoon and cool to room temperature.",
    "Line 2 baking trays with baking paper. Place a sheet of filo on one of the trays, then brush lightly with the melted butter. Sprinkle over 1 tsp sugar. Repeat the process until there are 3 layers of filo. Repeat with the remaining sheets of filo on the second tray.",
    "Divide the apple mix along the shorter edge of both pastry sheets and gently roll into 2 logs, tucking in the ends as you go. Brush with melted butter and sprinkle over 1 tbsp sugar. Can be made up to 1 day ahead, kept chilled. Bake for 25 mins, or until the pastry is golden brown and crisp. Let cool slightly, then cut each strudel into 6 diagonal slices. Serve two slices each with a dollop of crème fraîche on the side."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6856"
  },
  "name": "Wild mushroom, potato & pancetta gratin",
  "ingredients": [
    "6 garlic cloves",
    "1 onion, halved",
    "3 bay leaves",
    "3 thyme sprigs, plus a sprinkle of leaves",
    "600ml pot double cream",
    "600ml whole milk",
    "140g diced pancetta",
    "25g butter, plus a knob",
    "250g wild mushrooms, roughly chopped after cleaning",
    "1¼kg medium potato(we used Maris Piper)",
    "1 whole nutmeg",
    "green salad, to serve (optional)"
  ],
  "category": "side",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/wild-mushroom-potato-pancetta-gratin-7e68976.jpg?resize=768,574",
  "method": [
    "Put the garlic cloves, onion, bay leaves, thyme, double cream and milk in a pan. Bring slowly to the boil over a low heat, partially cover with a lid and cook for 20-30 mins until the onion is tender and the cream mixture slightly thickened. Turn off and leave everything to infuse for 1 hr.",
    "Strain the cream mixture into a jug (or bowl) and discard the herbs. Put the garlic cloves and onion in a food processor or blender and whizz until smooth – add a drop of the cream if it helps. Stir the paste back into the rest of the cream and season with 2 tsp salt.",
    "Put the pancetta in a cold frying pan and cook gently, over a low-medium heat so the fat melts into the pan, until the pancetta is really crispy. Lift out with a slotted spoon, add the butter and mushrooms and turn up the heat, frying the mushrooms, until golden and dry.",
    "Leave the skins on the potatoes and slice as thinly as possible. Grease a large baking dish with a little more butter. Layer up the potato slices, scattering over some of the cooked pancetta, the mushrooms and a little freshly grated nutmeg and pepper as you go. Finish by slowly pouring over the cream so that it settles among all the layers, then scatter over a few more thyme leaves. Cover with foil.",
    "Heat oven to 180C/160C fan/gas 4. Bake the gratin for 1 hr, then remove the foil and bake for 35-45 mins more until golden and crispy on top. Poke a knife in to check the potatoes are tender, then leave for 10-15 mins to settle, before serving with a salad, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6857"
  },
  "name": "Feta & cucumber bites",
  "ingredients": [
    "1 garlic clove, crushed",
    "200g feta cheese",
    "100g ricotta",
    "4 tbsp chopped dill, plus extra fronds, to garnish",
    "1 large cucumber, halved lengthways, seeds scooped out and discarded",
    "cracked black pepper, to serve"
  ],
  "category": "appetizer",
  "image": "https://mamalikestocook.com/wp-content/uploads/2019/10/feature-stuffed-cucumber-appetizer.jpg",
  "method": [
    "Add the garlic, feta, ricotta and dill to a food processor and whizz until smooth but thick.",
    "Fill the middle of the cucumber with the cheese mix and smooth over. Cut into 3cm-thick slices. Sprinkle with cracked pepper and garnish with the dill fronds."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6858"
  },
  "name": "Mincemeat samosas",
  "ingredients": [
    "1 cooking apple, peeled, cored and finely chopped",
    "zest and juice 1 orange",
    "50g dried ready-to-eat apricots, chopped",
    "25g shelled pistachios",
    "50g dried cranberries",
    "175g sultanas",
    "1 tsp cinnamon",
    "½ tsp grated nutmeg",
    "2 tbsp brandy",
    "1 tbsp clear honey",
    "50g butter, melted and kept warm",
    "6 sheets filo pastry(270g pack)",
    "icing sugar, to decorate"
  ],
  "category": "dinner",
  "image": "https://cdn.cdkitchen.com/recipes/images/2016/03/34347-4868-mx.jpg",
  "method": [
    "Mix together the fruit, dried fruit, nuts, spices and brandy. Leave the mixture in the fridge for 30 mins to allow the flavours to develop, then stir in the honey. Heat oven to 200C/180C fan/gas 6. Arrange the filo sheets with the short side facing you and, using scissors, cut the stack in 3 vertically, to make long strips. Brush the top 3 strips with melted butter.",
    "Working quickly, put 1 heaped spoonful of mincemeat at the top of the first strip. Fold one corner of the pastry over it to form a triangle, then continue folding alternately left and right to form a triangular package, until you’ve used up all the strip. Repeat with the other strips, brushing with butter before folding.",
    "Place on a baking sheet and brush each one with more melted butter. Bake for 15-20 mins until crisp and golden. Dust with icing sugar and serve warm (reheat later in a low oven if necessary)."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6859"
  },
  "name": "Sole goujons with mango & lime dip",
  "ingredients": [
    "4 skinless sole or plaicefillets, each about 85g",
    "50g plain flour",
    "2 large eggs",
    "200g panko or coarse dried breadcrumbs",
    "4 tsp medium curry powder",
    "½ tsp fine sea salt",
    "spray oil",
    "100g half-fat crème fraîche",
    "4 tbsp mayonnaise",
    "2 tbsp mango chutney",
    "finely grated zest 1 lime",
    "juice 1 lime",
    "small pack coriander, leaves only, finely chopped"
  ],
  "category": "appetizer",
  "image": "https://cdn.mos.cms.futurecdn.net/rAWPzatc2ZVxkYao7zD7zB.jpg",
  "method": [
    "Put the fish on a board and cut each fillet on the diagonal into about 12 slivers. You should end up with around 48 finger-sized pieces of fish. Put the flour in a bowl and season.",
    "Beat the eggs in a medium bowl. Sprinkle half the breadcrumbs into a large bowl and stir in half the curry powder. Toss the fish pieces with the seasoned flour, then take one at a time and dip into the beaten egg, then coat in breadcrumbs evenly.",
    "Put on a tray lined with baking parchment while the rest are prepared, adding the reserved breadcrumbs and remaining curry powder to the large bowl after coating roughly half the fish pieces. Spray all the fish generously with oil and season again. Can be covered with cling film at this stage and kept in the fridge for up to 8 hrs before baking (or to freeze, see tips below, left.",
    "Heat oven to 220C/200C fan/gas 7. Bake the goujons for 8-10 mins until golden and crisp. To make the dipping sauce, mix all the ingredients in a bowl, then soon into a serving dish or dishes."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf685a"
  },
  "name": "Sweet potato chestnut roast",
  "ingredients": [
    "1 tbsp rapeseed oil, plus a dash for greasing",
    "2 onions, finely chopped",
    "1 large sweet potato, about 325g, coarsely grated",
    "3 garlic cloves, crushed",
    "180g pack cooked chestnuts",
    "2 tbsp fresh thyme leaves, plus extra for sprinkling",
    "1 tbsp tamari",
    "1 large egg",
    "2 tsp wholemeal flour",
    "300ml vegetable bouillonmade with 1 tsp powder",
    "2 tbsp tomato purée",
    "1 tbsp apple cider vinegar",
    "pinch mild chilli powder"
  ],
  "category": "vegetarian",
  "image": "https://images.cookforyourlife.org/wp-content/uploads/2018/08/Chestnut-twice-baked-sweet-potatoes.jpg",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Grease and line the base and sides of a 1lb (500g) loaf tin with baking parchment. Heat the oil in a large non-stick sauté pan and fry the onions for 10 mins until golden, stirring every now and then. Add the grated potato and garlic and cook for 5 mins more until the potatoes have softened.",
    "Tip into a bowl, (reserve the pan) and add two-thirds of the chestnuts crushing them up as you go, then stir in the thyme, tamari and egg. Press into the loaf tin, roughly break the remaining nuts and arrange them on top then bake for 45 mins.",
    "For the sauce mix the flour with a little of the bouillon to make a very wet paste. Return the pan to the heat and add all the ingredients, including the flour mix and stir over a high heat until well mixed and thickened. Keep simmering for a good 10 mins then taste as it should now be tangy rather than vinegary. If it is too sharp return to the heat and boil a little longer.",
    "Carefully take the loaf from the tin and remove the paper. Scatter with thyme. If you're doing the Healthy Diet Plan, serve half in 2 thick slices with half the tomato sauce and chill the rest for another day, otherwise serve the whole recipe as a meal for four people."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf685b"
  },
  "name": "Sticky BBQ wings & blue cheese dip",
  "ingredients": [
    "1kg whole chicken wings",
    "2 tbsp olive oil",
    "4 celery sticks, each cut into 4 small sticks (keep some with their leaves)",
    "bunch French breakfast radishes(with their leaves if you can get them)",
    "150ml tomato ketchup",
    "100ml cider vinegar",
    "100ml bourbon",
    "4 tbsp dark brown sugar",
    "2 tbsp hot chilli sauce",
    "1 tbsp Worcestershire sauce",
    "1 tsp ground cumin",
    "1 tsp ground coriander",
    "1 tsp ground paprika",
    "1 tbsp butter",
    "100g gorgonzola",
    "150ml soured cream",
    "50g mayonnaise",
    "good squeeze lemon juice"
  ],
  "category": "appetizer",
  "image": "https://realfood.tesco.com/media/images/buffalo-wings-HERO-a2c22b82-19d6-4ebf-b698-22c027ccaa2a-0-472x310.jpg",
  "method": [
    "Heat oven to 220C/200C fan/ gas 7. Cut the chicken wings into winglets by slicing through each of the joints. Keep the two meaty pieces and discard the wing tips, or freeze for stock.",
    "Put the winglets on a large baking sheet, drizzle with the olive oil, then season. Roast in the oven for 20 mins, then reduce the temperature to 180C/160C fan/ gas 4 and cook for a further 25 mins.",
    "Meanwhile, make the barbecue sauce. Put all the ingredients, except the butter, in a pan and mix together with plenty of black pepper. Let it bubble away for 3-5 mins to thicken up a little, then add the butter and stir until it has melted and made the sauce nice and shiny. Season to taste.",
    "Half an hour before the chicken wings are ready, take them out of the oven and brush over three-quarters of the barbecue sauce. When they’re fully cooked, toss them in the rest of the sauce so that they become sticky.",
    "In a small bowl, mash the blue cheese dressing ingredients together with some seasoning, until combined. The barbecue sauce and dip can be made a day ahead, covered and chilled. Serve alongside the wings with the celery sticks and radishes for dipping."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf685e"
  },
  "name": "Beef & mozzarella meatballs",
  "ingredients": [
    "12 ready-made meatballs(about a 360g pack)",
    "50g mozzarella, divided into 12 pieces",
    "300g tub fresh tomato & basil sauce"
  ],
  "category": "dinner",
  "image": "https://img.taste.com.au/o-QcOVpa/taste/2016/11/one-pan-mozzarella-meatball-bake-87880-1.jpeg",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. Wet your hands, push a piece of mozzarella into the centre of each meatball, then re-form the meat into a ball. Place on a baking tray and cook for 15-20 mins until they’re browned and cooked through.",
    "Meanwhile, tip the sauce into a pan. Gently heat, letting it bubble and reduce a little. Once the meatballs are cooked, pop a mini skewer in each one and serve with the sauce to dip."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf685f"
  },
  "name": "Prawn cocktail crostini",
  "ingredients": [
    "2 ripe avocados",
    "1 tbsp lemon juice",
    "300g cooked and peeled tiger prawn",
    "2 tbsp olive oil",
    "large ciabatta, diagonally cut into 8 slices",
    "8 nice Baby Gem lettuceleaves",
    "cayenne pepperand lemon wedges, to serve",
    "6 tbsp mayonnaise",
    "2 tbsp tomatoketchup",
    "2 tsp brandy(optional)",
    "few drops Tabasco sauce"
  ],
  "category": "appetizer",
  "image": "https://img.taste.com.au/UAbtOpK9/taste/2016/11/prawn-cocktail-crostini-92328-1.jpeg",
  "method": [
    "To make the sauce, mix all ingredients in a bowl, season well and set to one side. If you’re making this the day before, cover and place in the fridge until needed. Peel, then chop the avocados into small chunks, tossing in lemon juice as you go, so they don’t discolour.",
    "Mix the prawns with half the sauce, add the avocados and stir gently to coat everything. Heat a griddle pan. To make the crostini, rub a little olive oil onto each slice of ciabatta and grill on each side for 2 mins until toasted.",
    "To serve, spread a little cocktail sauce on each crostini, top with a lettuce leaf and add a spoonful of the prawn cocktail mix. Sprinkle with a little cayenne pepper and serve with lemon wedges."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6860"
  },
  "name": "Fresh herb sauce",
  "ingredients": [
    "85g watercress",
    "50g parsley",
    "50g walnut",
    "150ml olive oil",
    "1 tsp lemon juice",
    "1 tsp sugar"
  ],
  "category": "side",
  "image": "https://i0.wp.com/goepicurista.com/wp-content/uploads/2021/01/44-0E89293F-CF0E-4A69-87E8-F6F6193F370F-scaled.jpeg?ssl=1",
  "method": [
    "Place the watercress, parsley and walnuts in a blender and pulse until finely chopped. Add the oil, lemon juice and sugar, and season well. Blend for 1 min until everything has combined into a thick green sauce. Can be made several hours ahead."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6861"
  },
  "name": "Chorizo & prawn skewers",
  "ingredients": [
    "12 mini chorizosausages (for cooking chorizo cut into 12 pieces)",
    "12 raw shelled prawns",
    "1 tsp harissa",
    "½ garlic clove, crushed",
    "2½ tbsp mayonnaise",
    "2½ tbsp Greek yogurt",
    "1 tbsp chopped parsley"
  ],
  "category": "appetizer",
  "image": "https://cdn-img.georgeforemangrills.com/manager/georgeforemangrills_com/Recipes/large_prawn_and_chorizo_skewers.jpg",
  "method": [
    "Heat oven to 200C/180C fan/gas 6 and cook the chorizo on a tray for 12 mins. Meanwhile, mix together the prawns and harissa. In a bowl, combine the garlic, mayo and yogurt to make a dip.",
    "Turn the chorizo, add the prawns to the tray and cook for 3 mins more. Sprinkle the parsley over the prawns, then thread each onto a skewer, followed by a sausage. Serve with the dip."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6862"
  },
  "name": "Crab parcels",
  "ingredients": [
    "1 small potato, cut into quarters",
    "85g butter",
    "50ml single cream",
    "2 spring onions, plus extra for serving",
    "300g mixed white and brown crabmeat",
    "12 sheets filo pastry"
  ],
  "category": "appetizer",
  "image": "https://www.blueearthfoods.co.uk/wp-content/uploads/2021/04/DMP_Blue_Earth_44Foods_200321_0209-1-resized.jpg",
  "method": [
    "Boil the potato for 15 mins until soft. Meanwhile, place 25g of the butter and all of the cream in a heavy-based pan and bring to the boil. Slice the spring onions, separating the green and white parts, then add the white slices to the boiling liquid and cook for 1-2 mins to soften. Pass the cooked potato through a ricer or sieve to a really fine mash, then add to the pan and mix everything together. Set aside to cool.",
    "Add the crabmeat and sliced green bits of spring onion to the potato mixture and stir together. Melt the remaining butter. Unwrap the filo pastry and cover with a clean, damp tea towel to prevent it drying out. Brush melted butter over one sheet, place another on top and brush again with butter. Then add a final sheet of filo.",
    "Cut the filo sheets lengthways into 3 long strips. Then cut each strip in half across the middle. Place a teaspoon of the crab onto the bottom right-hand corner of each filo strip. Fold the filo over to make a triangle, then fold again, rolling up the strip. When the mixture is enclosed and you have a neat triangle shape, place on a baking sheet and brush with more butter. Can be made ahead up to this point and frozen for up to 1 month.",
    "Heat oven to 200C/fan 180C/gas 6. Cook the rolls for 15-20 mins until golden and crisp. To serve, pile the parcels up on a plate or bowl, then scatter over with extra sliced spring onion, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6864"
  },
  "name": "Pineapple sorbet with fresh mango",
  "ingredients": [
    "1 pineapple, peeled, cored and cut into chunks",
    "100ml lime juice(about 3 limes)",
    "1 ripe mango, peeled and thinly sliced, to serve",
    "500g caster sugar",
    "1½ tbsp lemon juice",
    "1 vanilla pod, split in half lengthways",
    "1 cinnamon stick"
  ],
  "category": "dessert",
  "image": "https://www.findingzest.com/wp-content/uploads/2017/04/Homemade-Mango-Pineapple-Sorbet.jpg",
  "method": [
    "Put the pineapple into a blender or food processor and blitz to a purée. To make the stock syrup, put all the ingredients in a large pot with 500ml water, slowly bring to the boil and stir until the sugar has dissolved, then remove from the heat.",
    "Tip the pineapple purée and the lime juice into the syrup and stir well. Leave to cool, then strain and churn in an ice-cream maker following manufacturer’s instructions. Place in a container and freeze. Alternatively, tip the syrup into a large tray and freeze until it starts to set, then every hour or so break up the ice with a fork. Serve the sorbet scooped into dessert glasses with a few slices of mango."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6865"
  },
  "name": "Polenta & prosciutto chips",
  "ingredients": [
    "250g ready-made block of polenta",
    "90g pack prosciutto",
    "1 tbsp olive oil",
    "25g parmesan",
    "tomato ketchup, to serve (optional)"
  ],
  "category": "appetizer",
  "image": "https://www.speck.it/CustomerData/496/files/Images/rezepte/chips-di-polenta_9.jpg",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. Cut the polenta into 18 chunky chips and the prosciutto into 18 strips. Put the polenta in a bowl along with the oil and a good grinding of pepper, and mix together. Wrap a strip of prosciutto around a polenta chip, then pop onto a baking tray. Repeat with the remaining chips and sprinkle over the Parmesan.",
    "Bake for 25-30 mins until golden, turning them over after 15 mins. Serve with tomato ketchup, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6866"
  },
  "name": "Korean beef bulgogi skewers",
  "ingredients": [
    "300g sirloin steak, fat removed",
    "2 tbsp soy sauce",
    "2 tbsp golden caster sugar",
    "2 tbsp mirin",
    "thumb-sized piece ginger, peeled and sliced",
    "2 garlic cloves",
    "50g chopped fresh pineapple",
    "1 tsp chilli flakesor Korean chilli powder",
    "1 tbsp sesame oil, plus extra for frying",
    "lettuceleaves, to serve",
    "toasted sesame seeds, to serve",
    "spring onions, thinly sliced, to serve",
    "2 tbsp sriracha or other chilli sauce",
    "2 tbsp kecap manis(Indonesian sweet soy sauce)",
    "juice 1 lime"
  ],
  "category": "appetizer",
  "image": "https://www.macheesmo.com/wp-content/uploads/2017/09/Bulgogi-Steak-Kabobs-Feature.jpg",
  "method": [
    "Put the steak in the freezer for 30 mins – it will firm up and be much easier to slice thinly. Meanwhile, make a marinade. Put the soy, sugar, mirin, ginger, garlic, pineapple, chilli flakes and oil in a food processor. Blitz until smooth, then pour into a bowl.",
    "When the meat is semi-frozen, thinly slice into 25 pieces and add to the marinade. Chill until ready to use, but don’t leave for longer than 2 hrs or the pineapple juice will break down the meat too much.",
    "Meanwhile, soak small wooden skewers in water for 10 mins. When ready to serve, thread a piece of meat onto each skewer. Heat a griddle pan, or frying pan, and brown skewers for 1-2 mins each side or until grill marks appear. Add a little more oil to the pan if needed.",
    "Mix together the dipping sauce ingredients in a small bowl. Serve the skewers with lettuce, sesame seeds, spring onions and dipping sauce."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6867"
  },
  "name": "Banana pancakes with crispy bacon",
  "ingredients": [
    "8 rashers smoked streaky bacon(or pancetta strips)",
    "140g self-raising flour",
    "1 tsp baking powder",
    "2 tbsp light soft brown sugar",
    "2 ripe bananas, 1 mashed, 1 thinly sliced",
    "2 large eggs",
    "25g butter, melted, plus a little extra",
    "125ml milk",
    "maple syrup"
  ],
  "category": "breakfast",
  "image": "https://www.passionforpork.com/wp-content/uploads/2017/05/pancakes_final03.jpg",
  "method": [
    "Heat the grill to high. Arrange the bacon on a baking tray lined with foil. Cook for 5-7 mins until crisp, then turn off the grill but leave the tray inside to keep warm. In a bowl, mix the flour, baking powder and sugar with a pinch of salt. Make a well in the centre and add the mashed banana, eggs, butter and milk. Whisk to a smooth batter without any flour lumps.",
    "Heat a little butter in a large frying pan. Once sizzling, ladle in small dollops of the pancake batter, leaving a little space between each, as they will spread out. Put 2 or 3 slices of banana onto the surface of each pancake and cook for 2 mins over a medium heat. When you see bubbles appear between the banana slices, flip the pancakes over and cook for 1 min more, until puffed up and golden. Transfer to a plate and keep warm with the bacon while you cook the rest. Serve the pancakes with the crispy bacon and a drizzle of maple syrup."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6868"
  },
  "name": "Creamy chicken & mango curry",
  "ingredients": [
    "12 boneless, skinless chicken thighs",
    "2 tsp turmeric",
    "2 tbsp sunflower oil",
    "2 onions, 1 chopped, 1 quartered",
    "2 large ripe mangoes",
    "6 tbsp good-quality Korma paste",
    "100g ginger, roughly chopped",
    "2 tsp ground cumin",
    "1 tbsp black onion seed(kalonji or nigella)",
    "400g can light coconut milk",
    "600ml chicken stock",
    "few coriandersprigs, basmati rice, naan bread, mango chutney, lime pickle and our sides (see 'goes well with'), to serve (optional)"
  ],
  "category": "dinner",
  "image": "https://www.simplyrecipes.com/thmb/dT3LGHn-xZPFyt0wfYpDgJWY7Mc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2008__05__mango-chicken-curry-horiz-b-1800-d4d247a7ca234b898bbdcfd2a6b0e19a.jpg",
  "method": [
    "Toss the chicken thighs with 1 tsp of the turmeric and some salt. Heat the oil in a big frying pan or wide flameproof casserole, and brown the thighs well on both sides. Remove from the pan. Add the chopped onion and cook for 5 mins until softened.",
    "Roughly cut all the flesh from one of the mangoes, scraping as much as you can from the stone. Put into a food processor with the korma paste, ginger and quartered onion. Whizz to a paste, then tip into the pan and gently cook until softened.",
    "Stir in the remaining turmeric, cumin and onion seeds and turn up the heat for a couple of mins. Return the chicken to the pan. Stir in the coconut milk and stock. Bring to a gentle simmer, then cover and cook for 20 mins.",
    "Uncover the pan and cook for another 25-30 mins until the chicken is really tender, adding a few drops of water to keep it saucy.",
    "Slice the remaining mango and stir in to heat through while you shred the chicken with two forks. Season and serve scattered with the coriander, with basmati rice, naan bread, chutney, lime pickle and our sides, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6869"
  },
  "name": "Blue cheese pasta",
  "ingredients": [
    "400g penne pasta",
    "25g butter",
    "1 onion, thinly sliced",
    "1 garlic clove, crushed",
    "1 tbsp fresh chopped sage, or 1 tsp dried",
    "100g stilton, cubed",
    "handful toasted walnuts, chopped"
  ],
  "category": "lunch",
  "image": "https://img.taste.com.au/ZSa9bdqX/w720-h480-cfill-q80/taste/2016/11/lemon-blue-cheese-pasta-7993-1.jpeg",
  "method": [
    "Boil the pasta according to pack instructions. In a saucepan, melt the butter, then gently fry the onion until golden. Add the garlic and sage, fry for a further 2 mins, then remove the pan from the heat. Drain the pasta and reserve some cooking water. Stir through the buttery onions, stilton and 2 tbsp cooking water, then sprinkle with the toasted walnuts to serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf686a"
  },
  "name": "Macaroni & cheese",
  "ingredients": [
    "350g pastashapes",
    "2 tbsp butter",
    "1 garlic clove, crushed",
    "1 tsp mustard powder",
    "½ tsp cayenne pepper(optional)",
    "3 tbsp plain flour",
    "500ml milk",
    "250g mix of cheesesyou have around (we used Cheshire, cheddar and camembert), plus extra hard cheese for the topping"
  ],
  "category": "lunch",
  "image": "https://www.allrecipes.com/thmb/MkbGgNcGadAWdYw0aRZbo8WapHM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/237311-slow-cooker-mac-and-cheese-DDMFS-4x3-9b4a15f2c3344c1da22b034bc3b35683.jpg",
  "method": [
    "Cook the pasta according to pack instructions, drain and set aside.",
    "Melt the butter in a saucepan, add the garlic and cook for a min until softened, then add the mustard powder and cayenne pepper and cook for 1 min more. Add the flour and stir to make a paste, cooking for about 1 min, until the mix starts to bubble a little. Take off the heat and gradually pour in the milk, whisking with every addition so the sauce doesn’t go lumpy. Return to the heat and cook for 5 mins until thickened, then add the cheeses, stir until melted, and fold in the pasta.",
    "Heat oven to 180C/160C fan/gas 4. Tip the pasta into a baking dish, and top with additional cheese, preferably some hard cheese such as cheddar or parmesan, then bake for 25-30 mins, until golden and bubbling. Allow to cool for 10 mins or so then serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf686b"
  },
  "name": "Brie, apple & onion tart",
  "ingredients": [
    "320g pack ready-rolled all-butter puff pastry, defrosted at room temperature if frozen",
    "1 tbsp olive or rapeseed oil, plus a drizzle",
    "3 large onions, halved and sliced",
    "2 tbsp white wine vinegar, plus a splash",
    "1 tbsp Dijon mustard",
    "small bunch of thyme, leaves picked, plus a few sprigs to serve",
    "1 eating apple",
    "100g cranberry sauce(or chutney)",
    "175g brie, sliced (or other cheese)"
  ],
  "category": "lunch",
  "image": "https://www.imperialsugar.com/sites/default/files/recipe/Apple-Brie-Tart-imperial.jpg",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. Unroll the pastry sheet onto a large baking tray (leave it on the paper from the pack). If the edges are not straight, trim them with a sharp knife. Score a border, about 1cm in from the edge. Score a criss-cross pattern over the central piece of pastry (this will prevent it from rising too much) and around the border, if you like. Bake for 15 mins.",
    "Meanwhile, heat the oil in a large pan. Add the onions and cook for 10-15 mins until softened and starting to caramelise. Stir in the vinegar, bubble for 1 min more, then add the Dijon mustard and thyme, season well and set aside. Slice the apple thinly through the core so a few slices have a nice star in the middle, and remove any seeds. Toss the slices in a splash of vinegar to prevent them from browning.",
    "The pastry should be puffed and starting to colour. Push down the centre, then spread over the onions. Add blobs of cranberry sauce, then top with the apple slices and brie, overlapping them to cover the tart. Add a few more thyme sprigs, drizzle with a little oil, then put back in the oven for a further 25 mins until the cheese is bubbling and the apple slices are soft. Serve warm or cold."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf686d"
  },
  "name": "Parmesan roasties",
  "ingredients": [
    "2kg floury potatoes, peeled and cut in half, or quarters if large",
    "5 tbsp sunflower oil",
    "5 tsp fine polenta",
    "100g parmesan, finely grated"
  ],
  "category": "side",
  "image": "https://www.greatbritishfoodawards.com/assets/images/recipes/potatoes_2.jpg",
  "method": [
    "Boil the potatoes in a large pan of water for 12 mins, drain, leave to cool, then put into the fridge until you’re ready to roast them. Can be done a day ahead.",
    "Heat oven to 200C/180C fan/gas 6. Pour the oil into a large, deep roasting tin, then put in the oven. Tip the polenta into a large casserole dish and season well. Add the potatoes, and turn them over to coat.",
    "Take the tin of oil out of the oven and, using tongs, carefully add the potatoes. Turn them over and sprinkle any remaining polenta over the top, then return the tin to the oven for 30 mins.",
    "Scatter the parmesan over the potatoes, turn them to coat, then return to the oven for a further 20 mins, or until crisp and golden."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf686e"
  },
  "name": "Bao buns with spicy pork",
  "ingredients": [
    "7g sachet fast-action dried yeast",
    "2 tbsp vegetable oil",
    "2 tsp baking powder",
    "2 tbsp caster sugar",
    "1 tbsp dried milkpowder",
    "350g plain flour",
    "chilli sauce, to serve",
    "400g pork fillet",
    "1 tbsp sesame oil",
    "2 spring onions, chopped",
    "3 tbsp hoisin sauce",
    "1 tbsp soy sauce",
    "2 tbsp clear honey",
    "½ tsp Chinese five-spice powder",
    "½ tsp chilli flakes",
    "1 tsp cornflour, dissolved in 1 tbsp rice wine"
  ],
  "category": "lunch",
  "image": "https://media.blueapron.com/recipes/373/c_main_dish_images/20140808-2036-180-2673/Pork_20Belly_20Buns-1535_high_feature.jpg",
  "method": [
    "First, make the filling. Finely dice the pork. Heat the oil in a frying pan and brown the meat until cooked through (about 6 mins). Add the spring onions and sauté for 1 min, then add the hoisin and soy sauces and the honey, five-spice powder, chilli flakes and cornflour mix. Simmer for 5 mins, then transfer to a bowl and chill.",
    "In a measuring jug, mix 200ml warm water with the yeast and oil. To make the dough by hand, put the dry ingredients in a mound on your work surface with a good pinch of salt. Make a hole in the middle, pour in the yeast mixture and slowly stir until it comes together. Knead on a floured surface for 10 mins or until the dough is soft. Or to use a standing mixer, put the dry ingredients in the bowl with a good pinch of salt. Turn on and pour in the yeast mixture. When the dough comes together in a ball, keep the speed on medium and knead for 8-10 mins until smooth and soft. Put in an oiled bowl and cover with cling film. Keep in a warm place until doubled in size (about 2-3 hrs).",
    "Take the dough out, knock it back and knead for 1 min, then put on a floured surface. Cut into 2 pieces and roll each into a fat cylinder. Cut each into 16 pieces. Press a couple of pieces flat (about 7.5cm wide). Put a disc in the palm of your hand and add 1 tsp of the filling. Bring the sides up and pinch together at the top. Repeat with the remaining dough and filling.",
    "Cut circles of baking parchment and put under each bun. Arrange the buns on a baking tray so they don’t touch each other. Leave to rise for another 30 mins.",
    "Make sure your steamer fits snugly over a pan or use a regular steamer with a pan and lid. Fill the bottom pan with water and bring to a boil. Set the steamer with the buns and their liners over the pan and cook for 10-12 mins. You will need to do this in batches. Remove and eat straightaway with chilli sauce."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf686f"
  },
  "name": "Aubergine & chickpea bites",
  "ingredients": [
    "3 large aubergines, halved, cut side scored",
    "spray oil",
    "2 fat garlic cloves, peeled",
    "2 tsp coriander",
    "2 tsp cumin seeds",
    "400g can chickpeas, drained",
    "2 tbsp gram flour",
    "1 lemon, ½ zested and juice, ½ cut into wedges to serve (optional)",
    "3 tbsp polenta",
    "1 tbsp harissa(we used Belazu rose harissa)",
    "150g coconut dairy-free yogurt(we used Coyo)"
  ],
  "category": "appetizer",
  "image": "https://www.nisalocally.co.uk/media/fephqptp/istock-1315903641.jpg",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. Spray the aubergine halves generously with oil, then put them cut-side up in a large roasting tin with the garlic, coriander and cumin seeds. Season, then roast for 40 mins until the aubergine is completely tender. Set aside to cool a little.",
    "Scoop the aubergine flesh into a bowl and discard the skins. Use a ",
    " to scrape the spices and garlic into the bowl. Add the chickpeas, gram flour, lemon zest and juice, roughly mash together and check the seasoning. Don’t worry if the mix is a bit soft – it will firm up in the fridge.",
    "Shape the mixture into 20 balls and put them on a baking tray lined with baking parchment, then leave to chill in the fridge for at least 30 mins. Swirl the harissa through the yogurt and set aside. Can make ahead to this point the day before and kept covered in the fridge.",
    "Heat oven to 180C/160C fan/gas 4. Tip the polenta onto a plate, roll the balls in it to coat, then return them to the tray and spray each one with a little oil. Roast for 20 mins until crisp, hot and golden. Serve with the harissa yogurt and lemon wedges, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6870"
  },
  "name": "Halloumi & bacon rolls",
  "ingredients": [
    "250g block halloumi cheese",
    "10 rashers pancetta or smoked streaky bacon",
    "1 tbsp chopped chives"
  ],
  "category": "appetizer",
  "image": "https://farm4.staticflickr.com/3856/14892115102_291cc4b58e_z.jpg",
  "method": [
    "Heat oven to 200C/fan 180C/gas 6. Cut the halloumi into 20 sticks. stretch each rasher of pancetta with the back of a knife, then cut in half. season the pancetta with just black pepper, then sprinkle with the chopped chives.",
    "Roll the pancetta around the halloumi in a spiral and arrange on a baking sheet. Bake for 10-12 mins or until the pancetta is brown and beginning to crisp."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6871"
  },
  "name": "Leek & potato soup",
  "ingredients": [
    "50g butter",
    "8 rashers streaky bacon, chopped",
    "5 large leeks, sliced",
    "2 large potatoes, cubed",
    "1.2l vegetable stock",
    "2 bay leaves",
    "300ml milk",
    "handful chopped parsley",
    "1 long thin baguette",
    "4 tbsp olive oil",
    "1 tbsp wholegrain mustard"
  ],
  "category": "lunch",
  "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2022/03/Potato-Leek-Soup-main-1.jpg",
  "method": [
    "Melt the butter in a large pan, add the bacon and fry it until it is just starting to colour. Add the leeks and potatoes, then stir well until they are glistening.",
    "Add the stock and bay leaves, season and bring to the boil. Partly cover and simmer for 15 mins, until everything is cooked. Fish out the bay leaves, then purée the soup in batches in a food processor or blender. Return to the pan and stir in the milk. Reheat gently and season to taste. Add more stock or water if the soup seems too thick (this will depend on the size of your potatoes). Sprinkle with parsley to serve.",
    "Make the toasts: heat oven to 200C/fan 180C/gas 6. Cut the baguette into thin diagonal slices. Mix the oil and mustard together, then brush over both sides of the bread. Spread them on a large baking sheet and bake for 10 mins. Serve with the soup for dipping. They can be baked earlier in the day and served cold or warmed through in the oven."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6872"
  },
  "name": "Creamed spinach",
  "ingredients": [
    "25g butter",
    "1 small onion, finely chopped",
    "2 tbsp plain flour",
    "200ml full-fat milk",
    "2 x 200g bags spinach",
    "100ml single cream",
    "fresh nutmeg, for grating"
  ],
  "category": "side",
  "image": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2Farchive%2Fd6b730cc860b2421c584c686940dd3d9f7f499c9",
  "method": [
    "Heat 25g butter in a saucepan, then add 1 finely chopped small onion and cook for 5 mins until softened.",
    "Stir in 2 tbsp plain flour and cook for 2 mins, then slowly start to whisk in 200ml full-fat milk. When it has all been incorporated, gently cook for 5 mins until the sauce has thickened. ",
    "Meanwhile, place two 200g bags spinach in a large colander. Pour over a kettle full of boiling water until the leaves have wilted (you may have to do this twice).",
    "Place the spinach in a clean dishcloth, squeeze out any excess liquid, then roughly chop.",
    "Stir into the sauce with 100ml single cream, gently heat, then finely grate over some fresh nutmeg and season well."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6873"
  },
  "name": "Eggs Benedict with smoked salmon",
  "ingredients": [
    "4 eggs",
    "2 tbsp white wine vinegar",
    "2 English muffins, halved",
    "a little butter, for spreading",
    "8 slices smoked salmon",
    "chopped chives, to serve",
    "2 tsp lemon juice",
    "2 tsp white wine vinegar",
    "3 egg yolks",
    "125g unsalted butter, diced"
  ],
  "category": "breakfast",
  "image": "https://thejewishkitchen.com/wp-content/uploads/2016/10/smoked-salmon-benedict-1.jpg",
  "method": [
    "First make the Hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.",
    "To poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.",
    "Lightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some Hollandaise and garnish with chopped chives."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6874"
  },
  "name": "Roast fillet of beef with mushrooms",
  "ingredients": [
    "25g dried porcini mushrooms",
    "400g wild mushroom",
    "200g shallots",
    "knob of butter, plus extra for roasting",
    "2 tbsp olive oil",
    "1 garlic clove, crushed",
    "2 thymesprigs",
    "1½ kg/3lb 5oz beef fillet",
    "1 tbsp plain flour",
    "3 tbsp brandy",
    "400ml hot beef stock",
    "2 tsp wholegrain mustard",
    "2 tbsp crème fraîche",
    "handful parsley, chopped"
  ],
  "category": "dinner",
  "image": "https://www.fifteenspatulas.com/wp-content/uploads/2016/11/Roasted-Beef-Tenderloin-Mushroom-Pan-Sauce-Fifteen-Spatulas-15.jpg",
  "method": [
    "Tip the porcini into a bowl and pour over 250ml boiling water. Leave for 20 mins to soften and plump up, scoop out the mushrooms with a slotted spoon and finely chop, then strain the liquid (leaving behind the last drop as it might contain grit) and set aside.",
    "Set aside about half the wild mushrooms, choosing those with the best shape, then finely chop the remainder. Chop 1 shallot very finely. Heat a large frying pan, add the butter and 1 tbsp olive oil, then cook the chopped shallot and garlic over a medium heat for 3-5 mins until softened. Tip in the chopped porcini and stir around the pan for 2 mins. Add the chopped mushrooms to the frying pan along with the thyme sprigs. Cook for 10 mins until lightly browned and any liquid has evaporated. Leave to cool.",
    "Place the beef on a board. Take a sharp knife and make a slice lengthways along the fillet, about one-third of the way down, so it folds out like a book. One side of the beef should now be thicker than the other. Make another lengthways slice along the thick half of beef so the beef unfolds to a flat, evenly thick piece of meat, about the size of an A4 page. Spread the mushroom mixture all over the beef and season really well. Tightly roll up the beef to reform into a log and tie about 8 pieces of string around to secure well.",
    "Heat oven to 200C/180C fan/gas 6. Place a large heavy-based roasting tin over a high heat on the hob (ensure that it will fit in your oven beforehand). Heat some more butter and the other 1 tbsp oil in the tin, then fry the beef, turning every couple of mins, until well browned all over. This will take about 10 mins.",
    "Tip the whole shallots into the tin around the beef and toss them in the oil. Roast for 20-25 mins for rare, 35 mins for medium and 45 mins for well done. If you have a thick piece of meat, it may take a little longer. Ten mins before the end of cooking, stir the whole mushrooms around the pan, coating well in the oil and juices, then leave to roast alongside the meat and shallots. Leave the meat to rest on a board for 10-15 mins and keep the vegetables warm in a serving dish while you make the sauce.",
    "Place the tin back on the hob. Stir in the flour, mixing well into any oil in the pan, then very carefully pour over the brandy, making sure you don’t pour straight from the bottle. Use a small whisk to stir in the brandy, scraping up all the lovely browned bits from the tin. When the brandy has nearly boiled away, pour over the strained mushroom liquid and beef stock. Cook for about 5 mins until the liquid just coats the back of a spoon, then stir in the mustard and crème fraîche. Season, sprinkle with parsley and pour into a gravy boat. Cut the beef into thick slices and serve with the vegetables, gravy and some Parmesan puffs, if you like."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6875"
  },
  "name": "Salmon, dill & potato tart",
  "ingredients": [
    "300g ready-made shortcrust pastry",
    "350g new potato, sliced",
    "284ml pot single cream",
    "2 eggs",
    "3 tbsp chopped dill, extra for sprinkling",
    "zest 1 lime",
    "200g pack smoked salmon, torn into strips"
  ],
  "category": "lunch",
  "image": "https://i.pinimg.com/originals/93/43/97/9343974bfd578fdc99014a1bea9e29d3.jpg",
  "method": [
    "Heat oven to 190C/fan 170C/gas 5. Roll out the pastry and line a shallow 28cm flan tin. Trim off the edges, then line with baking paper and beans. Put on a baking sheet, bake for 10 mins. Remove the paper and beans, then bake for 5 mins more.",
    "Cook the potatoes in boiling salted water for 6-8 mins until tender, then drain. Beat together the cream, eggs, dill, lime zest, salt and pepper. Scatter half the potatoes over the bottom of the pastry case, then put half the salmon strips in the gaps. Pour over half the egg mix, then arrange the remaining potatoes over the salmon pieces and put the remaining salmon in the gaps between. Pour over the rest of the egg mix.",
    "Bake for 25 mins until the top is lightly coloured and firm to the touch. Cool for 10 mins before removing from the tin, then serve warm or at room temperature sprinkled with extra dill."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6876"
  },
  "name": "Broccoli soup with cheese toasties",
  "ingredients": [
    "1 large potato, diced",
    "1.2l chicken or vegetable stock",
    "400g broccoli, chopped into florets",
    "7 slices bread",
    "175g cheese, grated – cheddar, red leicester or any blue cheese",
    "1 egg, beaten",
    "3 spring onions, chopped",
    "few drops Worcestershire sauce"
  ],
  "category": "lunch",
  "image": "https://myfoodstory.com/wp-content/uploads/2021/06/Healthy-Broccoli-Soup-4.jpg",
  "method": [
    "Heat oven to 200C/180C fan/gas 6. Put the potato and stock in a saucepan and bring to the boil, turn down to simmer for 10 mins until the potato is tender, then add the broccoli and some seasoning and cook for another 4-5 mins. Blend the soup until smooth, then return to the pan and keep warm while you make the toasties.",
    "Whizz 1 slice of bread to make crumbs, then stir in the cheese, egg and onions. Spread over 3 slices of bread, add a dash of Worcestershire sauce, and sandwich each one together with the remaining slices. Brush with oil and bake for 10 mins, turning halfway through, until the outside is crisp and golden and middle melted. Cut into triangles and serve with the soup."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6877"
  },
  "name": "Smoked salmon carbonara",
  "ingredients": [
    "200g quick-cook spaghetti",
    "1 tsp butter",
    "1 garlic clove, crushed",
    "150ml double cream",
    "2 eggs, beaten",
    "3 tbsp freshly grated parmesan",
    "120g pack smoked salmontrimmings",
    "½ small bunch chives, snipped"
  ],
  "category": "lunch",
  "image": "https://realfood.tesco.com/media/images/28-Salmon-carbonara-LH-f4671628-8a83-45ee-ae8e-81ac6c8a337a-0-1400x919.jpg",
  "method": [
    "Cook the spaghetti. Meanwhile, melt the butter in a small pan, add the garlic and gently sizzle for 1 min. Remove from the heat.",
    "Lightly beat the cream, eggs, softened garlic and half the Parmesan in a bowl. Stir in the smoked salmon trimmings.",
    "Drain the pasta well and return to the pan. Add the salmon mixture and the chives, then toss well so the heat from the pasta lightly thickens the sauce. Serve scattered with the remaining Parmesan and plenty of black pepper."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6878"
  },
  "name": "Tarte tatin",
  "ingredients": [
    "300g all-butter puff pastry",
    "plain flour, for dusting",
    "6 dessert apples(about 900g/2lb), such as Braeburn, Cox’s Orange Pippin or Adam’s Pearmain",
    "100g golden caster sugar",
    "85g unsalted butter(60g/2¼oz chilled and diced, 25g/1oz melted)",
    "crème fraîche(full-fat please!) or high-quality vanilla ice cream, to serve"
  ],
  "category": "dessert",
  "image": "https://recipe30.com/wp-content/uploads/2020/07/Tarte-tatin.jpg",
  "method": [
    "Roll the pastry to a 3mm-thick round on a lightly floured surface and cut a 24cm circle, using a plate as a guide. Lightly prick all over with a fork, wrap in cling film on a baking sheet and freeze while preparing the apples.",
    "Heat oven to 180C/160C fan/gas 4. Peel, quarter and core the apples. Put the sugar in a flameproof 20cm ceramic tatin dish or a 20cm ovenproof heavy-based frying pan and place over a medium-high heat. Cook the sugar for 5-7 mins to a dark amber caramel syrup that’s starting to smoke, then turn off the heat and stir in the 60g diced chilled butter.",
    "To assemble the tarte tatin, arrange the apple quarters very tightly in a circle around the edge of the dish first, rounded-side down, then fill in the middle in a similar fashion. Gently press with your hands to ensure there are no gaps. Brush the fruit with the melted butter.",
    "Bake in the oven for 30 mins, then remove and place the disc of frozen puff pastry on top – it will quickly defrost. Tuck the edges down the inside of the dish and, with a knife, prick a few holes in the pastry to allow steam to escape. Bake for a further 40-45 mins until the pastry is golden brown and crisp.",
    "Allow to cool to room temperature for 1 hr before running a knife around the edge of the dish and inverting it onto a large serving plate that is deep enough to contain the juices. Serve with crème fraîche or vanilla ice cream."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6879"
  },
  "name": "Classic potato salad",
  "ingredients": [
    "800g small new potato",
    "3 shallots, finely chopped",
    "1 tbsp small capers (optional)",
    "2 tbsp cornichons, finely chopped (optional)",
    "3 tbsp mayonnaise, or to taste",
    "3 tbsp extra-virgin olive oil",
    "1 tbsp white wine vinegar",
    "small handful parsley leaves, roughly chopped"
  ],
  "category": "lunch",
  "image": "https://www.simplyrecipes.com/thmb/eb7SMVJL0kaypejeGZVE413t2Mo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SIMPLY-RECIPES-Classic-Potato-Salad-LEAD-2-Horizontal-3dc58bbc058844cbb1e9242e8b1515a7.jpg",
  "method": [
    "Boil the potatoes in salted water for 20 mins until just cooked, drain, then cool.",
    "Cut the potatoes into chunks, then throw into a bowl with the shallots, capers and cornichons, if using. Add enough mayonnaise to bind, then mix together the olive oil and vinegar and add just enough to give a little sharpness to the salad. Stir in the finely chopped parsley and serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf687a"
  },
  "name": "Smoked salmon carpaccio",
  "ingredients": [
    "50g radishes, finely sliced into rounds",
    "2 tbsp white wine vinegar",
    "1 tbsp strong horseradish",
    "100g double cream, lightly whipped",
    "400g smoked salmon, cut into long slices",
    "100g cooked beetroot, finely sliced into rounds",
    "2 oranges, peeled and segmented",
    "2 preserved lemons, finely diced",
    "handful of pea shoots",
    "drizzle of extra virgin olive oil, to serve"
  ],
  "category": "lunch",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/smoked-salmon-carpaccio-1931346.jpg?resize=768,574",
  "method": [
    "First, lightly pickle the radish slices by putting them in a small bowl with the vinegar for at least 30 mins. Meanwhile, mix the horseradish with the whipped cream in a small bowl and season with salt.",
    "Lay 100g of the long salmon slices on 4 rectangular plates in a neat rectangle shape. Put 3 discs of beetroot on top of the salmon in different places. Arrange about 6 slices of the pickled radish around the salmon too. Add a few orange segments and some of the preserved lemon.",
    "Next, shape the horseradish into quenelles by using 2 teaspoons to scoop and roll it. Put 3 quenelles on each plate. Finally, scatter with the pea shoots, and drizzle over a little oil before serving."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf687b"
  },
  "name": "Turkey samosas",
  "ingredients": [
    "3 tbsp curry paste(we used korma)",
    "2 tbsp mango chutney, plus extra to serve",
    "2 tbsp natural yogurtfrom a 150g pot (serve the remainder)",
    "200g leftover cooked potatoes(roasted or boiled are fine), chopped into small chunks",
    "250g cooked turkeyor chicken, chopped into small pieces",
    "250g frozen peas",
    "bunch coriander, chopped, plus a few leaves picked to serve",
    "270g pack filo pastry(6 sheets)",
    "4 tbsp vegetable oil",
    "1 egg, beaten",
    "1 tbsp sesame seeds"
  ],
  "category": "lunch",
  "image": "https://arbuz.com/wp-content/uploads/2009/07/Somsa-Samosa-Sambusa.jpg",
  "method": [
    "In a large bowl, combine the curry paste, mango chutney and 2 tbsp yogurt, and mix well. Fold in the potatoes, turkey, peas and coriander, then season well.",
    "Heat oven to 200C/180C fan/gas 6. Cut the sheets of filo in half lengthways so you have 12 strips – keep the pastry covered with a tea towel while you work so it doesn’t dry out. Layer up 3 sheets of filo, brushing a little oil between each sheet. Pile a quarter of the filling in the top corner of the pastry in a triangle shape. Fold the pastry over to encase the filling, then keep folding until the parcel is sealed and the filo is used up. Brush the final edge with a little beaten egg to help stick the pastry together. Repeat to make all 4 jumbo samosas.",
    "Lay your samosas on a baking sheet and brush each one with more beaten egg, then sprinkle with sesame seeds. Bake for 35 mins or until the samosas are golden brown and the filling is piping hot. Serve with the remaining yogurt, some mango chutney and coriander leaves."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf687c"
  },
  "name": "Orange & spice wings",
  "ingredients": [
    "1kg chicken wings",
    "2 tbsp plain flour",
    "2 tbsp oil",
    "50g festive spice mix, see <a href='https://www.bbcgoodfood.com/recipes/festive-spice'>our recipe</a>",
    "1 orange, juiced",
    "1 tbsp honey",
    "pinch of salt, to serve"
  ],
  "category": "appetizer",
  "image": "https://thecozyapron.com/wp-content/uploads/2016/10/spicy-orange-chicken-wings_thecozyapron_10-17-16_1.jpg",
  "method": [
    "Heat oven to 200C/180C/gas 6. Put the chicken wings in a large bowl with plain flour and season well. Toss together to coat, then spread out over a large baking tray, drizzle with oil and cook for 40-45 mins, turning halfway through.",
    "When the chicken wings are nearly done, put the ",
    " in a saucepan with the orange juice and honey. Warm gently, then pour over the chicken wings, toss together, and return to the oven for a further 10 mins or until sticky. Sprinkle with salt to serve. "
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf687d"
  },
  "name": "Chocolate & almond croissants",
  "ingredients": [
    "6 croissants",
    "100g marzipan, broken into small pieces",
    "50g toasted sliced almonds",
    "50g milk chocolate, chopped"
  ],
  "category": "breakfast",
  "image": "https://res.cloudinary.com/hsxfx8igq/image/upload/t_16x9_recipe_image,f_auto/v1608585894/13_vjwdhl.jpg",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Slice into each croissant lengthways, but don’t go all the way through – they should open like books. Sprinkle or spread the bottom half of each with marzipan, followed by 1 tsp almonds and 1 tbsp chocolate.",
    "Close up, put on a baking sheet and sprinkle the remaining chocolate and almonds on top. Bake for 5 mins or until the chocolate has melted. Serve warm."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf687e"
  },
  "name": "Turkey laksa",
  "ingredients": [
    "1-2 tbsp Thai red curry paste, depending on taste",
    "1l chicken stock",
    "500g/ 1lb 2oz skinless turkeybreast, cut into strips",
    "225g thin rice noodles",
    "1 red pepper, deseeded and sliced",
    "300g beansprouts",
    "400ml can reduced-fat coconut milk",
    "juice 1 lime",
    "2 tsp sugar",
    "small handful coriander"
  ],
  "category": "dinner",
  "image": "https://media.riverford.co.uk/images/photo-3000x2000-bde35e2d776aab050a6cb17602328ebe.jpg",
  "method": [
    "Heat a large saucepan and fry the curry paste for 1 min, until fragrant. Tip in the stock and bring to the boil, then throw in the turkey and cook for 5 mins. Add the rice noodles and cook for 3 mins more.",
    "Add the pepper and beansprouts and cook for 2 mins more. Add the coconut milk, bring to a simmer, season with the lime juice and sugar, then spoon into bowls, sprinkle with the coriander leaves and serve."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf687f"
  },
  "name": "Herb & pepper crusted rib of beef",
  "ingredients": [
    "1 tbsp rock salt",
    "2 tbsp cracked black peppercorn",
    "3 garlic cloves, crushed",
    "small bunch rosemary, finely chopped",
    "small bunch parsley, chopped",
    "4 tbsp olive oil",
    "3kg rib of beefon the bone",
    "2 onions, sliced",
    "250ml red wine",
    "400ml fresh beef stock"
  ],
  "category": "dinner",
  "image": "https://img.taste.com.au/TinfJE52/taste/2016/11/beef-rib-eye-roast-with-pepper-herb-crust-90218-1.jpeg",
  "method": [
    "Heat oven to 220C/200C fan/gas 7. Mix the rock salt, peppercorns, garlic, rosemary, parsley and olive oil. Rub this mixture all over the beef rib then place in a roasting tin. Put in the oven and cook for 30 mins, then turn the oven down to 160C/140C fan/gas 3 and cook for a further 1 hr 20 mins. Remove from the oven, transfer the beef to a board, cover with tin foil and rest for 30 mins before carving.",
    "While the beef rests, make the gravy. Pour off all but 2 tbsp of fat from the roasting tin and reserve any juices. Fry the onions in the roasting tin over a medium heat for about 10 mins, then add the wine, stock and reserved juices. Keep cooking for a further 10 mins to reduce to a thick sauce, season well and serve alongside the roast beef."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6880"
  },
  "name": "Goat's cheese & cranberry tartlets",
  "ingredients": [
    "375-425g pack ready-rolled puff pastryor 500g pack ready-made pastry rolled 5mm thick",
    "1 egg, beaten",
    "3 tbsp cranberry sauce or a good-quality chutney",
    "3 x 120g goat's cheese logs (such as Soignon Petit Sainte-Maure), at room temperature",
    "1 tbsp fresh thyme leaf",
    "extra-virgin olive oil, for drizzling",
    "rocket leaves, to serve"
  ],
  "category": "appetizer",
  "image": "https://tastesofhomemade.com/wp-content/uploads/2020/11/easy-cranberry-cheest-tarts.jpg.webp",
  "method": [
    "Preheat oven to fan 200C/conventional 220C/gas 7. Lay pastry on a floured work surface. Using a round 7.5cm round pastry cutter, cut out as many circles as possible.",
    "Sit them on oiled baking sheets and score a circle about 2.5cm in from the edge of each disc by pressing gently with a 5cm cutter. Pierce the middle of each with a fork, brush with egg and top with a little cranberry sauce or chutney.",
    "Slice the cheese 5mm thick so you have a slice per disc (discard end rinds). Lay a slice on each tartlet, then top with thyme leaves, a drizzle of oil and a twist of black pepper.",
    "Bake for 10-15 minutes until the cheese is golden and the pastry crispy. Cool for 5 minutes and serve warm, garnished with rocket leaves."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6881"
  },
  "name": "Passion fruit & lime tart",
  "ingredients": [
    "500g pack dessert pastry",
    "8 passion fruits",
    "finely grated zest and juice of 1 lime",
    "200g golden caster sugar",
    "6 egg yolks",
    "142ml tub double cream",
    "icing sugar for dusting (optional)"
  ],
  "category": "dessert",
  "image": "https://img.delicious.com.au/mBxoaXcp/del/2016/06/gluten-free-passionfruit-and-lime-tart-31271-2.jpg",
  "method": [
    "Roll out the pastry and use it to line a 23cm tart ring, then chill for at least 20 mins. Heat oven to 180C/fan160C/gas 4. Line the tart with baking parchment and baking beans, then bake for 15 mins. Remove the parchment, bake for a further 5-10 mins until golden, then remove from the oven and reduce the temperature to 140C/fan 120C/gas 1.",
    "While the case is cooking, cut the passion fruits in half, scoop out the flesh into a bowl, then blitz with a hand blender. Push the pulp through sieve and mix the juice with the lime zest and juice. Beat the sugar and yolks together until pale, then beat in the cream and fruit juice. Carefully pour the custard into the tart case, then bake for 40 mins, until set with a very slight wobble. Remove the tart from the oven, then leave to cool completely.",
    "You can now either serve the tart as it is, or try a chef’s tip and dust it with icing sugar, then caramelise the top with a blowtorch."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6882"
  },
  "name": "Salmon & herby potato coulibiacs",
  "ingredients": [
    "600g potato, thinly sliced",
    "1 large onion, thinly sliced",
    "1 tbsp olive oil",
    "100ml double cream",
    "100ml crème fraîche",
    "4 tbsp chopped parsley",
    "4 tbsp chopped dill",
    "zest 1 lemon",
    "2 x 375g packs all-butter puff pastry",
    "a little flour, for dusting",
    "650g side of salmon, skinned and pin-boned, cut crossways into 3cm slices, then cut in half lengthways to get thick fingers",
    "1 egg, beaten"
  ],
  "category": "dinner",
  "image": "https://images.food52.com/5ovid74lzdJUW0EbWzOdVJ8l1LU=/1200x900/6c909485-6450-496a-9a6b-569f8071e873--Coulibiac-horiz.jpg",
  "method": [
    "Heat oven to 180C/160C fan/gas 4. Par-boil the potato slices for 2-3 mins. Drain and set aside in a large bowl.",
    "Gently fry the onion in the oil for 10 mins until lightly golden. Cool slightly, then stir in the cream, crème fraîche, herbs, zest and plenty of seasoning. Pour over the potatoes and mix very gently.",
    "Roll out one pack of pastry on a lightly floured surface to a 35 x 35cm, then lay on a large baking sheet. Pack ¼ of the potato mixture down one side of the pastry, leaving a 5cm border. Arrange ½ of the salmon on top to cover the potato. Cover the salmon with ¼ of the potato. Brush the pastry all the way round with beaten egg and fold over the pastry. Trim the edges and crimp with your fingers, or seal with a fork. Make decorative fish for the top, if you like.",
    "Roll out the remaining pastry and repeat the process, using up the rest of the potato and salmon. Chill for 30 mins.",
    "Brush the pastries all over with beaten egg. Bake for 40 mins. Leave to rest for 10 mins if serving hot, or serve cold."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6883"
  },
  "name": "Chicory & hummus bites",
  "ingredients": [
    "2 large heads of chicory",
    "1 carrot",
    "175g tub hummus",
    "16-18 black olives, preferably pitted"
  ],
  "category": "appetizer",
  "image": "https://jessicalevinson.com/wp-content/uploads/2015/10/Hummus-Endive-Boats-0008-700x500.jpg",
  "method": [
    "Up to 2 hrs ahead, separate the chicory into boat-shaped leaves and trim the ends so that they are all roughly the same size. You will probably get about eight or nine decent-sized leaves from each head of chicory. As the leaves get closer to the heart of the chicory, they will be too small to use for canapés, so save them to add to wintry salads.",
    "Peel the carrot, then keep peeling off strips until you have as many as the number of chicory leaves.",
    "Drop spoonfuls of hummus onto the chicory, then add a carrot curl and an olive to each. They’ll keep in the fridge for about 2 hours."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6884"
  },
  "name": "Prawn & fennel bisque",
  "ingredients": [
    "450g raw tiger prawn in their shells",
    "4 tbsp olive oil",
    "1 large onion, chopped",
    "1 large fennel bulb, chopped, fronds reserved",
    "2 carrots, chopped",
    "150ml dry white wine",
    "1 tbsp brandy",
    "400g can chopped tomato",
    "1l fish stock",
    "2 generous pinches paprika",
    "150ml pot double cream",
    "8 tiger prawns, shelled, but tail tips left on (optional)",
    "fennel fronds (optional)"
  ],
  "category": "lunch",
  "image": "https://aceline.media/wp-content/uploads/2020/08/editedprawnbisque.jpg",
  "method": [
    "Shell the prawns, then fry the shells in the oil in a large pan for about 5 mins. Add the onion, fennel and carrots and cook for about 10 mins until the veg start to soften. Pour in the wine and brandy, bubble hard for about 1 min to drive off the alcohol, then add the tomatoes, stock and paprika. Cover and simmer for 30 mins. Meanwhile, chop the prawns.",
    "Blitz the soup as finely as you can with a stick blender or food processor, then press through a sieve into a bowl. Spend a bit of time really working the mixture through the sieve as this will give the soup its velvety texture.",
    "Tip back into a clean pan, add the prawns and cook for 10 mins, then blitz again until smooth. You can make and chill this a day ahead or freeze it for 1 month. Thaw ovenight in the fridge. To serve, gently reheat in a pan with the cream. If garnishing, cook the 8 prawns in a little butter. Spoon into small bowls and top with the prawns and snipped fennel fronds."
  ]
},
{
  "_id": {
    "$oid": "6526d46bb030211929bf6885"
  },
  "name": "Sesame beef wraps",
  "ingredients": [
    "1 tsp vegetable oil",
    "175g beef steak, cut into thin strips",
    "1 red pepper, deseeded and thinly sliced",
    "2 garlic cloves, thinly sliced",
    "2cm piece fresh root ginger, thinly sliced and cut into matchsticks",
    "1 tbsp sesame seed",
    "2 tbsp soy sauce",
    "2 Baby Gem lettuces",
    "1 tsp sesame oil"
  ],
  "category": "lunch",
  "image": "https://marleyspoon.com/media/recipes/5270/main_photos/large/SKU0903_web__1_-1c29385811417e9db5d2ddb6d08fb35b.jpg",
  "method": [
    "Heat oil in a large frying pan. When the pan is really hot, tip in the beef and pepper, then cook for a few mins until lightly browned and the beef is cooked through. Tip in the garlic, ginger and sesame seeds, then cook for 1-2 mins more, stirring often until they start to turn golden.",
    "Pour over the soy sauce and 2 tbsp water, let it bubble down a bit until it starts to look syrupy, then drizzle with the sesame oil. Separate the leaves from the lettuces and arrange on a plate. Spoon a little of the beef mixture into each leaf, drizzle with pan juices and serve warm."
  ]
}]